[
    {
        "title": "How to profit from the collapse of South Africa?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bott4p/how_to_profit_from_the_collapse_of_south_africa/",
        "nr_comments": 20,
        "upvotes": "•",
        "content": {
            "text": "SA is looking like it’s on borrowed time as a state and a society. How can we make money off of this? Calls on $TM?\n",
            "gallery": []
        }
    },
    {
        "title": "What’s the best stock to do a call with $800 now on 3/27, and needs to end around 4/20",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1botmye/whats_the_best_stock_to_do_a_call_with_800_now_on/",
        "nr_comments": 33,
        "upvotes": "•",
        "content": {
            "text": "What do each of you say is the best stock symbol to do a Call with $800 I have now, but needs to end around 4/20th, that will give a great profit? \nCurrently I have one in for TSM which isn’t looking to well. \nI and hoping for some great advice from the great people on here that are so helpful! \nHoping to do better on this, then pull more funds out of another account, then go again at something else. \nReally hoping with everyone’s help and great guidance, we all see one, two, possible three great Calls in a row bumping us up tens of thousands to help one another and novitiate others and all of us, that we can do this, we can win at this time in this market. \nWhat is your first pick, call, price, breakeven, dates…etc. \nThanks everyone,\n",
            "gallery": []
        }
    },
    {
        "title": "Thank the Hood gods!!!",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bot4il/thank_the_hood_gods/",
        "nr_comments": 19,
        "upvotes": "•",
        "content": {
            "text": "Wish I had bought more before close. \n",
            "gallery": [
                "https://i.redd.it/xqfoihqqzsqc1.png"
            ]
        }
    },
    {
        "title": "Great Opportunity to short $HOOD - Robinhood's Downfall",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1boseo9/great_opportunity_to_short_hood_robinhoods/",
        "nr_comments": 32,
        "upvotes": "0",
        "content": {
            "text": null,
            "gallery": []
        }
    },
    {
        "title": "$1.57 Billion worth of Nvidia shares purchased before close totaling 1.69 Million shares",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bosbv1/157_billion_worth_of_nvidia_shares_purchased/",
        "nr_comments": 42,
        "upvotes": "83",
        "content": {
            "text": null,
            "gallery": []
        }
    },
    {
        "title": "So sad 😔 Market manipulation happening in real time",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bos7w9/so_sad_market_manipulation_happening_in_real_time/",
        "nr_comments": 82,
        "upvotes": "399",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/xmebjpp1rsqc1.jpeg"
            ]
        }
    },
    {
        "title": "These contracts ended the day at 20.50",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bor5bf/these_contracts_ended_the_day_at_2050/",
        "nr_comments": 14,
        "upvotes": "12",
        "content": {
            "text": null,
            "gallery": []
        }
    },
    {
        "title": "SPY pampin tomorrow or what?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1boq78v/spy_pampin_tomorrow_or_what/",
        "nr_comments": 57,
        "upvotes": "40",
        "content": {
            "text": "Here for all hot SPY takes. We booking profits tomorrow? More sideways bullshit? Implosion incoming? Let’s hear your well regarded opinions- bag holders only please\n",
            "gallery": [
                "https://i.redd.it/ov8xura1asqc1.jpeg"
            ]
        }
    },
    {
        "title": "$PSTG: The Unseen Behemoth Poised for a Moonshot",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bop7v2/pstg_the_unseen_behemoth_poised_for_a_moonshot/",
        "nr_comments": 22,
        "upvotes": "20",
        "content": {
            "text": "1. The Fundamentals are Screaming \"Buy\"\nPure Storage, folks, isn't your average Joe's data storage company. In an era where data is the new oil, PSTG is sitting on a gold mine with its innovative data solutions and flash storage tech. Their financials? Stronger than a garlic martini. With consistent revenue growth year-over-year and a clientele that includes some of the biggest names in tech, healthcare, and finance, PSTG is not just walking the walk; it's moonwalking.\n2. Technical Analysis: The Stars Align\nLet's break down the technicals, where the charts whisper secrets to those who dare listen:\n\nBullish Patterns Galore: PSTG has been painting the town red with bullish patterns. A recent breakout from a cup and handle pattern on the weekly chart suggests a potential upward trajectory. For the uninitiated, this is like seeing a double rainbow with a pot of gold at both ends.\nMoving Averages are Your Friend: The 50-day moving average recently crossed above the 200-day moving average, a golden cross, signaling a bull market on the horizon. It's like the market's way of giving us the nod.\nVolume Speaks Volumes: An uptick in trading volume accompanies the breakout, confirming the bulls are in town, and they're not here for the tapas. They're here for the whole feast.\n\n3. Industry Tailwinds Like a Category 5 Hurricane\nData is growing at an exponential rate, and with the advent of AI, IoT, and 5G, the demand for efficient, reliable storage solutions is skyrocketing. PSTG is at the forefront of this revolution, with products that outperform the competition on speed, scalability, and cost-efficiency. It's like bringing a gun to a knife fight.\n$PSTG (Pure Storage) stands at the vanguard of revolutionizing how the world stores and accesses data, through their cutting-edge \"disruptive storage\" solutions. In an era where data generation and consumption are skyrocketing, their innovative approach to flash storage technology is not just about storing bytes; it's about redefining speed, efficiency, and reliability in data access. By dramatically reducing energy consumption and physical space needs, while simultaneously offering unparalleled data processing speeds, they’re creating “storage-as-code” basically changing how we view data storage as a whole, re-writing how much Megabytes, and gigabytes can really hold. In a recent hardware change over, one of their customers was able to reduce their IT footprint to 5% of what it previously was, with better results.\nAlso they just partnered with NVDA\nTLDR - put your life savings into $PSTG\nPositions - 60c 4/19\n",
            "gallery": []
        }
    },
    {
        "title": "$HOOD YOLO",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1booif5/hood_yolo/",
        "nr_comments": 48,
        "upvotes": "80",
        "content": {
            "text": "Should I buy more tomorrow?\n",
            "gallery": [
                "https://www.reddit.com/gallery/1booif5"
            ]
        }
    },
    {
        "title": "Canada Goose (GOOS) stock down sharply as they layoff 17% of their workforce",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1boo485/canada_goose_goos_stock_down_sharply_as_they/",
        "nr_comments": 58,
        "upvotes": "193",
        "content": {
            "text": "Saw this coming a mile away. The private equity vultures who bought the company are stripping it for all it’s worth by sending quality into the ground, prices to the sky and workers to the unemployment lines. They may squeeze out a few more quarters of “line go up” but as it always goes with these money grubbing scumbags, it will all end in tears.\n",
            "gallery": [
                "https://www.cnbc.com/2024/03/26/canada-goose-to-cut-17percent-of-its-corporate-workforce.html"
            ]
        }
    },
    {
        "title": "Fuck you guys",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bonbfu/fuck_you_guys/",
        "nr_comments": 82,
        "upvotes": "894",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/j7mf53zknrqc1.jpeg"
            ]
        }
    },
    {
        "title": "Bearish on big boats",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bon2g1/bearish_on_big_boats/",
        "nr_comments": 17,
        "upvotes": "70",
        "content": {
            "text": "Post peak for sure \n",
            "gallery": [
                "https://i.redd.it/gnnwfutslrqc1.jpeg"
            ]
        }
    },
    {
        "title": "$6000 (200%) on $TSLA calls",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bomn5k/6000_200_on_tsla_calls/",
        "nr_comments": 16,
        "upvotes": "54",
        "content": {
            "text": "While my entire feed on Twitter was bad mouthing $TSLA, I was buying calls. Granted I started buying last week for this week's expiration, and averaging down the cost basis and to 40 contracts. \nI ain't a $TSLA fanboi. But when I see a good chart setup, i buy to that direction…\nI sold at the top just FYI. \n",
            "gallery": [
                "https://i.redd.it/bqix6v2rirqc1.jpeg"
            ]
        }
    },
    {
        "title": "TSLA 420.69 by end of the year",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bollba/tsla_42069_by_end_of_the_year/",
        "nr_comments": 69,
        "upvotes": "43",
        "content": {
            "text": "Hi regards,\nI am pissed. TSLA just go down and down and down everyday. I bought the dip on stock, it keeps on dipping, bought the dip on calls, it keeps on dipping, bought the dip on the car itself, well at least the car price stopped dipping. But only after I got the car, then I realize how good the car is.\nThen I asked myself, why the stock keeps going down? checked on X, everybody said interest rate is too high, demand problem etc. I was thinking, everybody around me seems fine, Papa Powell said the US economy is robust, job market remain tight etc, overall, everything fine!\nBut still... we got a problem, that's fine... but more importantly how are we gonna solve this problem? ads put on youtube, X, now even on facebook,so where are the demands? where?\nhere is what I did. I am so broke, I pulled out my phone, registered uber. Went on the road and make some $$$ buy more tsla calls.\nwhy uber? because people who use uber are either:\n\nDoes not have a car (potential buyer).\nhave a car, can't drive themselves, but need transportation. (potential FSD buyer)\nUber is MULTI-NATIONAL, regards all over the world can participate in this. If we regards can pull this off, imagine suddenly tesla uber showing up everywhere in the world overnight. Tesla gain more awareness, lead to demand picking up. I'm pretty sure they will make another movie about it.\nUbering in Tesla/EVs has a HUGE advantage over ICE when doing short trip. If you calculate the math, its about 13-25% more earnings.\nif you are 100% tsla, you gonna need to drive uber to supplement some income anyway.\n\nI have done 200 trips so far. This is what I gathered from this small sample size.\n\nlots of people (25% at least) doesn't even know how to open the tesla door!!!! that means they didn't even get into one of the tesla yet. At least in my area, that's the situation.\nThey LOVE LOVE LOVE the white interior and the roof, said they have never experience a car so clean and elegant! I said yeah Tesla is great, but I didn't say I clean the mess after they left everytime.\nLots of people asking me about the range anxiety, their information is still lagged in 2019. they don't know how long is the battery range, they don't know how fast the battery charge at home and super charger, they just don't know.\nLots of people asking me about the how does driving tesla feels like? I replied with my broken English to them, listed all the pros, cons I know of. They are very very surprised on no oil change for tesla.\nLots of people still think tesla is a 60k+ car instead of 30k-40k car.\nSome customers specifically ordered uber green/ green comfort, I asked them why is that, they said the Tesla experience is too good.\nSome people's friend went tesla, they can never go back to ICE.\n\nThere are many more, but my smooth brain cant list all of them out.\n​\nSo in the end my smooth brain concluded that, these mfs just don't know!!!! The product is awsome@@! but they just don't know!!!! They are NOT gonna buy if they don't know!!! That's why we got a demand problem!!! Thats why the stock is dipping and dipping and dipping@@!\n​\nSo I propose Mission TSLA$420.69 to all of those regards AROUND THE WORLD have major TSLA position, and have a tesla car.\n\nuber, spread the words. Uber has destination mode, you can pick up some folks on your way to work/school, and on your way back home.\nif you know how to create website or any other way/ form of plateform, create one. and let All the people who want to participate this together register. get each driver a QR code to post on the back of the driver/ passenger seat. Beside the QR code reads something like...\"Scan here if you like to know more about my tesla experience\".\nuber rider then can scan QR code, sound will pop up from their phone, driver start sharing. Be objective, say the pros, but make sure you also don't left out the cons. Honesty and sincerity is the best way.\nalso Post your referral link QR behind the seat\nand then we can even let the rider take some sort of survey etc. to collect some data\nlet riders record a 10 sec vid of what they what to tell elon, if we manage to pull this off, mail it to elon\nwe can brainstorm more\n\n​\nMore people know about it and experience it, more Teslas will be sold. Then We go tendie town.\nNot financial advise, you do you.\n​\nAs always, position:\nhttps://preview.redd.it/y1e1cc8uarqc1.jpg?width=1080&format=pjpg&auto=webp&s=50414688f9a1274e9fcc8b80031feb33af813264\nProof I Uber & Riders love tesla ride:\nhttps://preview.redd.it/4k6n64xdcrqc1.jpg?width=1080&format=pjpg&auto=webp&s=a0cd31db18cfa8dd0aef67ef206a24facaf6d4b7\nhttps://preview.redd.it/jezjv7xdcrqc1.jpg?width=1080&format=pjpg&auto=webp&s=1d0c94bceeadca005097cbb966e838330d508b18\nhttps://preview.redd.it/qvqni7xdcrqc1.jpg?width=1080&format=pjpg&auto=webp&s=86e97eb59890f94630a5ed89b937716071967b97\nhttps://preview.redd.it/rskiqaxdcrqc1.jpg?width=1080&format=pjpg&auto=webp&s=2248bee3eb91d2ee59ce953889fb67e5aa71d1ba\nhttps://preview.redd.it/shubk6xdcrqc1.jpg?width=1080&format=pjpg&auto=webp&s=3d9c39de736b8565a266cb2213f98bd02ac8132c\n​\nTL;DR\nif you have tesla car, go uber, tell people tesla good, people buy tesla car, we get tendies.\n",
            "gallery": []
        }
    },
    {
        "title": "Hershey Hit With Downgrade as Cocoa Prices Touch Record",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bolkyy/hershey_hit_with_downgrade_as_cocoa_prices_touch/",
        "nr_comments": 15,
        "upvotes": "27",
        "content": {
            "text": "Hershey Co. was downgraded at BNP Paribas Exane to neutral from outperform on Tuesday, citing the recent surge in cocoa prices that suddenly looks less transitory in nature.\nCocoa futures have more than doubled this year, climbing above $10,000 per ton for the first time ever on Tuesday before erasing gains and taking a breather from a historic rally. The commodity is outperforming the stock market’s highest fliers, including Nvidia Corp. Hershey shares, meanwhile, have gained just 2.4% since the start of January, underperforming the S&P 500 Index and the large-cap consumer staples index.\nhttps://finance.yahoo.com/news/hershey-hit-downgrade-cocoa-prices-144914318.html\n",
            "gallery": []
        }
    },
    {
        "title": "This is in thousands.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bolinz/this_is_in_thousands/",
        "nr_comments": 19,
        "upvotes": "39",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/bmlplssuarqc1.jpeg"
            ]
        }
    },
    {
        "title": "You truly are a regard if you invest in DJT",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bokhxa/you_truly_are_a_regard_if_you_invest_in_djt/",
        "nr_comments": 647,
        "upvotes": "1628",
        "content": {
            "text": "If anyone with half a brain looks at the SEC fillings, DJT is just a pass through for legal investigation funding. IT IS LITERALLY IN THE INCOME STATEMENT AND LEGAL SECTION. Also, the company only makes money by selling shares and putting it intro a trust that had a 5% return. \nSo post your Gains like some regard did this morning… all it shows is you are a lucky moron. \n",
            "gallery": [
                "https://i.redd.it/5vxuusbp3rqc1.jpeg"
            ]
        }
    },
    {
        "title": "SPY headed down, shark-out-of-water pattern detected.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bok4bf/spy_headed_down_sharkoutofwater_pattern_detected/",
        "nr_comments": 26,
        "upvotes": "28",
        "content": {
            "text": "SPY, like a shark out of water, aims to do one thing: get back underwater.\nThat's what will happen to your positions too if my analysis is correct.\nI drew in the teeth of the shark for visualization purposes, the teeth are not part of the technical analysis.\n5/17 SPY 420C because if I was a shark I would want to go down to the 420 level where I would smoke hella and then go higher. \n",
            "gallery": [
                "https://i.redd.it/1spvz3m21rqc1.jpeg"
            ]
        }
    },
    {
        "title": "🦿🚀 EMBRACE THE PROSTHETIC BOOM: WHAT THE MCDONALD'S & KRISPY KREME'S COLLAB WILL DO TO PROSTHETIC MARKET! 🚀🍩",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bojkri/embrace_the_prosthetic_boom_what_the_mcdonalds/",
        "nr_comments": 20,
        "upvotes": "24",
        "content": {
            "text": "Alright, listen up, fellow apes! We're diving headfirst into prosthetics, where the real cash is flowing faster than a supersized soda. Thanks to McDonald's and Krispy Kreme, we're in for a sweet ride, but hold onto your prosthetic limbs, because here's the scoop:\nThe Sugar-Pumped Surge\nDiabetes ain't just a word—it's a moneymaker. With more folks losing limbs due to diabetes-related complications, the demand for human prosthetics is about to explode like an overstuffed doughnut.\nNow, let's break down the top players in the game and see how they're poised to cash in on this sweet opportunity:\n​\n1. Össur (OTCMKTS: OSSR): Össur is like the Elon Musk of prosthetics, cooking up innovations faster than you can say \"rocket ship.\" From bionic limbs to cyborg-level braces, Össur's got the tech to make real life sex dolls.\n2. Touch Bionics: Touch Bionics specializes in cutting-edge myoelectric prosthetic hands, including their iconic i-limb series. With natural-looking and intuitive control, Touch Bionics is changing the game for upper limb amputees.\n3. Hanger, Inc. (OTCMKTS: HNGR): Hanger, Inc. isn't just about prosthetic devices; they're all about comprehensive patient care. From custom prosthetics to rehabilitation services, Hanger is there every step of the way for amputees.\n4. Freedom Innovations: has the word freedom in it.\nBottom Line\nWe're not just talking tendies we're talking life-changing investments. By jumping on the prosthetic bandwagon fueled by McDonald's and Krispy Kreme, we're not just making bank off obese and wheelchair bound people, we're making a difference in the lives of amputees everywhere.\n​\nsource: https://www.dailytelegraph.com.au/newslocal/parramatta/thirty-year-milestone-for-mcdonalds-employee-with-down-syndrome/news-story/01c42e6cf5e6fab604a4519c0ce36f96\n​\n",
            "gallery": []
        }
    },
    {
        "title": "I’m the one with $500 Puts *Update",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bojeyv/im_the_one_with_500_puts_update/",
        "nr_comments": 12,
        "upvotes": "32",
        "content": {
            "text": null,
            "gallery": []
        }
    },
    {
        "title": "The regards at the Fed posted their loss porn",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1boj7jg/the_regards_at_the_fed_posted_their_loss_porn/",
        "nr_comments": 86,
        "upvotes": "665",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/4g6oj7kquqqc1.jpeg"
            ]
        }
    },
    {
        "title": "QQQ Power Hour 1,000% 0dte gainer... thanks to squeeze, triangle, and crayons.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1boi0fh/qqq_power_hour_1000_0dte_gainer_thanks_to_squeeze/",
        "nr_comments": 35,
        "upvotes": "90",
        "content": {
            "text": null,
            "gallery": []
        }
    },
    {
        "title": "Earnings for THAT stock",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bohwbl/earnings_for_that_stock/",
        "nr_comments": 681,
        "upvotes": "2019",
        "content": {
            "text": "Net sales were $1.794 billion for the fourth quarter, compared to $2.226 billion in the prior year's fourth quarter.\nSelling, general and administrative (“SG&A”) expenses were $359.2 million, or 20.0% of net sales, for the fourth quarter, compared to $453.4 million, or 20.4% of net sales, in the prior year's fourth quarter.\nNet income was $63.1 million for the fourth quarter, compared to net income of $48.2 million for the prior year’s fourth quarter.\nCash, cash equivalents and marketable securities were $1.199 billion at the close of the quarter.\nLong-term debt remains limited to a low-interest, unsecured term loan associated with the French government's response to COVID-19.\n",
            "gallery": [
                "https://www.nasdaq.com/press-release/gamestop-reports-fourth-quarter-and-fiscal-year-2023-results-2024-03-26"
            ]
        }
    },
    {
        "title": "Well let’s this be a lesson for myself. If you buy options on a stock that you know will be really volatile in a day, just sell.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bohr0o/well_lets_this_be_a_lesson_for_myself_if_you_buy/",
        "nr_comments": 212,
        "upvotes": "307",
        "content": {
            "text": "Had fours calls on DJT in all of them were >150%: \n03/28 $50\n03/28 $60\n03/28 $70\n03/28 $80\nI guess I need to learn how to pull out, and learn an exit strategy. I am new to options and till I have win more that I have lost, but I hope not selling today pays off a little bit tomorrow.\nDo you think $DJT will raise a bit more tomorrow before the drop? Or did Trump were able to sell some stocks?\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bohr0o"
            ]
        }
    },
    {
        "title": "Krispy Kreme and McDonald's join forces: A sweet deal for investors?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bohn60/krispy_kreme_and_mcdonalds_join_forces_a_sweet/",
        "nr_comments": 25,
        "upvotes": "20",
        "content": {
            "text": null,
            "gallery": []
        }
    },
    {
        "title": "What Are Your Moves Tomorrow, March 27, 2024",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bohfyg/what_are_your_moves_tomorrow_march_27_2024/",
        "nr_comments": 8660,
        "upvotes": "528",
        "content": {
            "text": "View Post\n",
            "gallery": []
        }
    },
    {
        "title": "Viking Therapeutics stock jumps more than 25% on promising weight loss pill data",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1boh81f/viking_therapeutics_stock_jumps_more_than_25_on/",
        "nr_comments": 22,
        "upvotes": "41",
        "content": {
            "text": "Cramer has been pumping this stock \n",
            "gallery": [
                "https://www.cnbc.com/2024/03/26/viking-therapeutics-weight-loss-pill-shows-positive-study-results.html"
            ]
        }
    },
    {
        "title": "Among The Noise",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1boh5ho/among_the_noise/",
        "nr_comments": 12,
        "upvotes": "6",
        "content": {
            "text": "I read on today's business insider article about reddit that reddit plans to make money from advertising, data licensing, and building a user economy. Has anyone seen a reddit ad that really got your attention recently? Doesn't it seem like the gut reaction here is that ads aren't going to be their main leg in this three pronged model? And then data licensing - is it really that hard to make a headless non-api-based bot to scrape data on an as needed basis? And then how many posts do you regularly see getting gold? Is there any more to the user economy that i left out? If you sell something through traffic on reddit, does reddit get a cut? I just am genuinely wondering if this stock could be driven up by anything other than its derivatives in the short term.\n",
            "gallery": []
        }
    },
    {
        "title": "Game stonk YOLO",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bogzlt/game_stonk_yolo/",
        "nr_comments": 366,
        "upvotes": "662",
        "content": {
            "text": "I refuse to sell for a $450 loss so I'm letting it ride through earnings like an idiot. I look forward to being mocked in half an hour.\n",
            "gallery": [
                "https://i.redd.it/vzp0lnf3fqqc1.jpeg"
            ]
        }
    }
]