[
    {
        "title": "QQQ 5/17 call keep or sell",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgya9c/qqq_517_call_keep_or_sell/",
        "nr_comments": 13,
        "upvotes": "•",
        "content": {
            "text": "I'll probably cut my losses if I don't see green early tomorrow pretty deep exp but I don't wanna watch go to 0 \n",
            "gallery": [
                "https://i.redd.it/oa9ibftfiwoc1.jpeg"
            ]
        }
    },
    {
        "title": "Well then...",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgwkh7/well_then/",
        "nr_comments": 103,
        "upvotes": "404",
        "content": {
            "text": "I belong here \n",
            "gallery": [
                "https://i.redd.it/h9r5yvtg3woc1.png"
            ]
        }
    },
    {
        "title": "We shall see",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgukew/we_shall_see/",
        "nr_comments": 25,
        "upvotes": "36",
        "content": {
            "text": "🚀\n",
            "gallery": [
                "https://i.redd.it/pdq7xygqhvoc1.jpeg"
            ]
        }
    },
    {
        "title": "Never give up!",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgtlfb/never_give_up/",
        "nr_comments": 46,
        "upvotes": "459",
        "content": {
            "text": "Calls I made money off this month\nApple\nC3.AI (earnings)\nBoeing\nCostco (quick scalp)\nI’m finally back after a long break of losing everything and saving up. I’m currently unemployed with only 2k left in my bank account. \nBeen really focused on trying to time the candles and the bottom for the day and taking profit as soon as I’m up a bit. Call me paper handed Peter idc, but treating every option like a game of hot potato as soon as I’m up is working for me.\nBest if of luck tards. Pray that I break even soon. I’ll keep y’all posted.\n",
            "gallery": [
                "https://v.redd.it/cilrwo8l5voc1"
            ]
        }
    },
    {
        "title": "NVDA block trades flip positive before market close Friday",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgsfe9/nvda_block_trades_flip_positive_before_market/",
        "nr_comments": 14,
        "upvotes": "33",
        "content": {
            "text": "https://preview.redd.it/9jwznklbpuoc1.png?width=602&format=png&auto=webp&s=925610d2244f0f63f0506507d2baf892ff2bb54a\nGiven short volume fell on Friday 13%, and blocktrade selling slowly fell throughout the week eventually flipping green. This could possibly signal bullish sentiment. 3/8 and 3/15 saw the same amount of shares purchased except on 3/15 we were not met with the same sell demand. Given the consolidation in NVDA over the last week, and bulls pushing the stock up 3% even after the 10% sell off. I see a reversal coming soon.\n",
            "gallery": []
        }
    },
    {
        "title": "Bearish Market on Wednesday this week",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgrq5e/bearish_market_on_wednesday_this_week/",
        "nr_comments": 43,
        "upvotes": "13",
        "content": {
            "text": "I re-watched the FOMC January meetings by J Pow and he appears to be very serious about curbing inflation rates, I think because of the higher than expected CPI data this Wednesday J Pow will be very hawkish or atleast appear to be so (if he acts the same way he acted in the January meeting).\nI think he may even announce the possible pushback of the rate-cuts that were planned to materialize in June/July this year, I don't think he will announce any interest increases and probably keep them steady where they are now\nI'm going to buy 3/22 calls on the SQQQ at market close Tuesday and plan to sell them just before market close on Wednesday, right after J Pow speaks and gives his outlook at 2:30 pm. I think the market is going to be bullish on Monday and Tuesday due to Nvidia's GTC event (I've bought NVIDIA shares that I plan to sell Tuesday and will re-enter again after the dip) affording me an even better price for SQQQ (as it returns -3x the NASDAQ 100)\nMake some quick cash $ or do you guys think I'm regarded?\n",
            "gallery": []
        }
    },
    {
        "title": "Tsla to 150 and bounce?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgqlt2/tsla_to_150_and_bounce/",
        "nr_comments": 27,
        "upvotes": "14",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/udewc3v54uoc1.jpeg"
            ]
        }
    },
    {
        "title": "The best DD on $GOOS",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgp5lo/the_best_dd_on_goos/",
        "nr_comments": 25,
        "upvotes": "8",
        "content": {
            "text": "Canada Goose (GOOS) grew revenue and stock price like crazy until 2018. Then they decided to try direct to consumer and get into less warm ultra-luxury products. Because it worked well for their competitor Moncler and the ideas were popular generally, and why not cash in on the brand's popularity year-round instead of just selling winter coats. Also, lower priced brands like Moose Knuckles and Arc'teryx were on the rise. So it was easier for GOOS to move upward to ultra luxury. But the company still sells it's ultra functional heavy down parkas, so the risky move upward is countered by a solid recurring business.\nBut customers and investors didn't like the initial results of those changes. Customers complained about product quality (less goose down fill seen as low quality) and price increases. The fashion aspect wasn't creating enough appeal to offset those changes for customers either. Investors saw operational costs and inventory soar as the fashion and direct to consumer experiments increased marketing, leasing, and construction costs. Also inventory went up partially because of failed fashion experiments, but mostly because of the warm winters and work from home. So slower sales growth, tighter margins, and higher inventory made investors lose interest.\nDirect to consumer doesn't work certain products (like mattresses - remember Casper?) but it does for Moncler and Apple. No one sees what brand mattress you sleep on, but they do see what coat or fashion you wear. So brands are stronger in fashion apparel, especially outdoor fashion apparel. Both Moncler and Apple retail locations showcase their products like jewelry showrooms. So that's the direct to consumer vision GOOS adopted for their retail stores. It takes a lot of upfront investment to build the stores, and a lot of operational expenses experimenting with marketing and products. Once the company gets it right and streamlines operations, the excess expenses are history.\nThat's exactly the inflection point Canada Goose is at now. Their sales were up 40% on Black Friday weekend and their stores saw record traffic (brand is strong). However, temperatures rose to the mid 40s and 50s in the Northern US/Canada by mid December due to El Nino. But the winds are a changin'! On Thursday, the National Weather Service predicted (https://www.cpc.ncep.noaa.gov/products/analysis_monitoring/enso_advisory/ensodisc.shtml) that the next winter is likely to be a cold one. The line to get in at my local Canada Goose store used to be 2 hours long during cold winters!\nMoreover, work from home is slowly reversing. Everyone I talk to from programmers to business roles and lawyers, reports having to go into work more often this year vs last year. It's clear that most companies don't like work from home. Going into work means everyone has to wear their coats more often. With the extra wear and tear, they need to buy new ones for the colder winter next year. Also lots of people haven't needed to buy a heavy winter coat since before COVID. GOOS will sell a fuck ton more coats next year. But we don't have to wait until then.\nTheir rain wear, sweaters, shirts, and accessories are selling better this year than last year already. I talked to one of their store employee today about a range of topics, and this was the most surprising part. Despite the push into non-winter wear since way back in 2018, they are now beating their sales targets on these items. Dude was super cool and genuinely enthusiastic about the brand. My guess is it took them a while to understand what customers what in these categories and how to market to them. This will make the business less seasonal and increase revenue, margins, and income.\nFurthermore, there is legitimate speculation (https://x.com/NonGaap/status/1757928725608530307?s=20) that the company is about to be acquired. The largest shareholder of GOOS is Bain Capital and they own almost 40% of the company. Recently Bain Capital started moving their shares into a shell company that looks like it was used to take out a margin loan against their shares. As the shares have dropped in value, they had to post more and more shares as collateral for that debt. They are getting close to running out of shares to post.\nAt the same time, Bain Capital have changed their appointed director on the board and \"appointed an experienced operating partner [Beth Clymer - formerly at Bain Capital] to run point on finance & strategy.\" (quote from the tweet above) GOOS acquired their European supplier shortly after the new board member and Beth were appointed. Now the company has full vertical integration internationally. These are not coincidences. Bain needs an exit and the company is cheap and ripe (in terms of inflection point) for acquisition.\nBut fuck the probability of an acquisition and let's say I'm too optimistic about its future. The company hasn't taken on any additional long term debt since way before COVID. They will grow their revenue 10% in a year that most luxury brands will struggle to not shrink. Not to mention that it was a really warm winter. They are cashflow positive almost every year since IPO (including this year). They have bought back more than 10% of the company since going public. They grew revenue every year by double digits since IPO except for 2020 (COVID) despite all the challenging factors I listed above. Revenue, income, and cashflow are all up more than 3x since IPO.  The CEO is a grandson of the founder and owns almost 25% of the company. And somehow their market cap is below what it was when they IPO'd? Wtf? I rest my case.\n",
            "gallery": []
        }
    },
    {
        "title": "What’s TSM moves next week, what price should I pull out at or should I hold till earnings. Thoughts?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgoydo/whats_tsm_moves_next_week_what_price_should_i/",
        "nr_comments": 42,
        "upvotes": "24",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/pdeg0igimtoc1.jpeg"
            ]
        }
    },
    {
        "title": "Are we heading into a bull market?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgop1w/are_we_heading_into_a_bull_market/",
        "nr_comments": 158,
        "upvotes": "201",
        "content": {
            "text": "Are we heading in to a bear market? Inflation, CPI, PPI all came in and yea they couldve been better, but not too bad! Rates are probably staying at the same level or going down next Wednesday. Maybe up? 🤷🏽‍♂️\nWe’ve already seen some bulls wuss out this week, but hey, the number of ops stayed the same. Are there going to be more bulls next week? What do you guys think?\n",
            "gallery": []
        }
    },
    {
        "title": "Here’s definitive proof that TSM will hit $210 by 4/19",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgogyn/heres_definitive_proof_that_tsm_will_hit_210_by/",
        "nr_comments": 115,
        "upvotes": "606",
        "content": {
            "text": "210 is half of 420. \n4/19 is one day before 420.\n2024 is basically an anagram for 420, but with an extra 2 means double, so TSM will hit $420 by 420\n",
            "gallery": []
        }
    },
    {
        "title": "Are we heading into a bear market?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgmucy/are_we_heading_into_a_bear_market/",
        "nr_comments": 356,
        "upvotes": "211",
        "content": {
            "text": "Are we heading in to a bear market? Inflation, CPI, PPI all came in slightly worse than expected. Rates are probably staying at the same level or going up next Wednesday.\nWe’ve already seen the number of bulls decrease this week while the number of bears stay the same. Are there going to be more bears next week? What do you guys think?\n",
            "gallery": []
        }
    },
    {
        "title": "Monday will be fun",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgmmjm/monday_will_be_fun/",
        "nr_comments": 145,
        "upvotes": "185",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/f9vubzyj0toc1.jpeg"
            ]
        }
    },
    {
        "title": "Why don’t I hear more about saddling here?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bglyby/why_dont_i_hear_more_about_saddling_here/",
        "nr_comments": 67,
        "upvotes": "4",
        "content": {
            "text": "I have been lurking here for a few years now. I’m getting in to trading options myself and I am wondering why I don’t hear more about straddles/strangles* (thank you u/KAY-toe for the right terms) here? \nIt seems like alot of y’all deal with volatile stocks for the most part. I’m curious if anyone has tried buying calls and puts against a stock at the same time during very volatile trading weeks (like this week.) \nExample: \nTSLA fell hard this week - but it’s impossible to know for sure if this is the true bottom, or if it will suddenly shoot back up next week as people try to buy the dip. \nSince it’s likely to swing hard either way next week - why not buy both calls and puts on it? \nSet limits so that you auto sell at 2x investment, or if it falls below 1.5x investment. \nObviously one will fail, but it’s unlikely that both will fail. And assuming it does work out, you’re likely to at least break even, if not profit quite a bit depending on how far the stock swings either way. \nThe only way it seems like you’d lose major money is if the stock has a relatively flat week. But there’s many popular stocks here where flat weeks don’t seem to be that common. \nObviously you’d make less per stock but at volume maybe it would be statistically safer?\nJust curious if anyone has experience with this strategy (if it could be called that at all.) \n*Edit: \nI am talking about Straddle/Strangles, not Saddles. I fucked that one up but I am still curious to hear people’s experiences regardless. \n",
            "gallery": []
        }
    },
    {
        "title": "In less than a week my 1000% gains were lost",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bghr3v/in_less_than_a_week_my_1000_gains_were_lost/",
        "nr_comments": 171,
        "upvotes": "1110",
        "content": {
            "text": "I told myself I’ll never be one of those wsb regards, guess i was just born a regard \n",
            "gallery": [
                "https://i.redd.it/f0lo6nb5uroc1.jpeg"
            ]
        }
    },
    {
        "title": "United Airlines close to leasing Airbus jets, Bloomberg News reports",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bghqc3/united_airlines_close_to_leasing_airbus_jets/",
        "nr_comments": 217,
        "upvotes": "2581",
        "content": {
            "text": null,
            "gallery": [
                "https://www.reuters.com/business/aerospace-defense/united-airlines-close-leasing-airbus-jets-bloomberg-news-reports-2024-03-14/"
            ]
        }
    },
    {
        "title": "Will dump 4K into this and get my account to green by the end of this week 😤",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bghi43/will_dump_4k_into_this_and_get_my_account_to/",
        "nr_comments": 90,
        "upvotes": "183",
        "content": {
            "text": "Inverse me for free money \n",
            "gallery": [
                "https://i.redd.it/dilmg5k4sroc1.jpeg"
            ]
        }
    },
    {
        "title": "Prepare your anuš, this Wednesday's afternoon we ride the elevator down.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bghg1x/prepare_your_anuš_this_wednesdays_afternoon_we/",
        "nr_comments": 228,
        "upvotes": "610",
        "content": {
            "text": "After the October and December FOMC meetings Jpow was feelin' mighty fine. He'd won. Inflation was on a steady downward trajectory, and he could ease off the hawkishness. He packed the dovishness peace pipe and passed it around to Mr. Market and all his homies. But Jpow fucked it and packed the bowl with some nasty green meth. Bullishness and speculative behavior exploded like Tuco's temper. Financial conditions loosened to the extent that now we have the easiest money since before interest rate hikes even began!\nJpow observes the party getting out of hand, and as we all know, it is the Fed's job to take the meth laced peace pipe out of the circle just as the party is getting started. Loose financial conditions have led to a resurgence in inflation. And not just consumer facing inflation, but producer price inflation too, which leads the consumer rate, since price increases flow down the production chain.\nSo now he's thinking well fuck. If I wait to fix this fuckup too long, inflation risks running away again, and then someone will take my smug, private equity mask off and show the world I was Burns this whole time. He doesn't want to raise rates because the US government can't keep high interest rates and high debt loads forever. So he's going to fuck your calls. \nWednesday afternoon, he's coming out maximum hawkish. Like Jackson Hole hawkish. He knows if he doesn't he'll miss the last free opportunity to tighten financial conditions without a rate hike. \nIf he has to choose between a guaranteed stagflationary hard landing and a 20% haircut in indexes, he'll take the latter every time. \nPosition: 2,250 shares of $DOG, $31.49 avg. About 70.8k cost basis. I'm  down about 3.5k atm. Will sell at $33 for about a $3.5k profit. I'm implying the DJIA hits about 35k. \n",
            "gallery": []
        }
    },
    {
        "title": "TSM FTW",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgh2nl/tsm_ftw/",
        "nr_comments": 27,
        "upvotes": "49",
        "content": {
            "text": "https://investor.tsmc.com/english/monthly-revenue/2024\nUnless Uncle Jensen and Aunty Lisa are full of shit, TSM will have a very good ER and most likely the year. I'm a believer in Grandpa Morris, the spiritual leader of TSM. Positions included.\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bgh2nl"
            ]
        }
    },
    {
        "title": "What does an SP 500 Index Fund/ETF do during a recession?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bggd4b/what_does_an_sp_500_index_fundetf_do_during_a/",
        "nr_comments": 50,
        "upvotes": "0",
        "content": {
            "text": "I want to learn more about these for my Roth. Apparently these intruments let me buy into a fund that manages a portfolio of the most popular stocks based on some variables they have defined. I'm curious though - what do they do during a recession? I'm trying to bank on the SP500 averaging 10% over many years for my retirement. Do they mostly sell during a recession so that I still receive some gains? Do they buy up stock at lower prices? Not looking for financial advice, just curious to learn more\n",
            "gallery": []
        }
    },
    {
        "title": "My (ALMOST) Invincible Call Credit Spread Strategy",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgg3f3/my_almost_invincible_call_credit_spread_strategy/",
        "nr_comments": 182,
        "upvotes": "513",
        "content": {
            "text": "I got a shit ton of interest on a different thread and in my DMs, so I'm going to post this. I should be selling this, really. I'll probably delete this later.\nLet me caveat by saying this: I am working on a degree in mathematics and my father taught me how to paper trade when I was only 6 or 7, I've been doing this for 20 years, but I only created this strategy a couple months ago. I say created because every formula I use to calculate my shit is self-made. My math isn't perfect yet. I'm also NOT a financial advisor. Please don't take this as advice.\nTL;DR. Basically, I sell call credit spreads way out of the money on earnings week on stocks that aren't really great based on traditional technical analysis. If you don't know how this works, or how to do technical analysis, that's a completely separate chunk of information. Some may call this \"picking up pennies in front of a steamroller\" but I wouldn't call what I'm making \" pennies.\" and I wouldn't call stocks like Dollar General, Dollar Tree, and Ulta Beauty \"steamrollers\", but ok.\nOk, ready? Good. I'm gonna post this picture - my model - and explain what each line means. Then, I'm gonna explain how I use the info.\nCall Credit Spread Model - 3/18 - 3/22\n\nLine 1-3: Stock Info. This should be self-explanatory. The O/price avg is the sum of the at the midpoint of the at the money (ATM) call and ATM put. I use this to calculate the Implied movement (IM) in line 8.\nLine 4-7: Credit Spread Info. This is info on the actual credit spread I'm potentially going to sell. SL=Price of the Short Leg; LL=Price of the Long Leg; Premium = how much premium I expect to get for selling the spread. SL Delta = Delta of the short leg. SL Delta is important because, for many mathematical reasons, it tells you the rough probability of your buyer being successful. ex. LULU 585/595 the buyer would have a 4% chance of being successful. I use the short leg because if the price of the stock goes above my short leg, I start to lose money, and that's no bueno.\nLine 8-11: Stats. These are where I start to use my own formulas to determine whether I actually think it's a good idea. Gain = % portfolio gain expected if you sell the spread and win. IM = Implied Movement of the stock during earnings week. % to loss = how much the stock has to go up to cross the short leg and lose money. IM/Loss Ratio = how many times more than the IM the stock would have to move to cross my short leg.\nLine 12-14: My Scores. My safety score is calculated using by weighing the Delta and IM/loss ratio, taking into account the width of the spread as a percentage of the stock price. It's not out of 100, but the higher the better. My Risk/Reward Score is based on the mathematical concept of fair wagering based on the odds of loss. ex. if a wager is 50/50, the winner should receive back 200% of their wager; however, in a 90/10 wager, The one with a 90% chance to win should receive back only 111.1% of their wager. I use the inverse of the delta to determine the \"ideal\" reward (options are never ideal) and compare it to the actual reward for selling the spread. This one IS out of 100, So that LULU 585/595 spread is 71.7% of ideal.\nMisc. If you really want to know what this is, you can probably figure it out. I use it more in my put selling model. Also, I have META listed as a control, since sometimes earnings stocks can be weird, just to make sure my model is working correctly.\n\nOk, so every weekend, I compile my list, then, I take the ones with the best \"Dave Score\" (I wasn't planning on posting this, so I didn't get too creative) and go look at the stock. Generally, If I am actually bearish on a stock, I'll pull the trigger Monday at open. If I am generally bullish on the stock, I pull the trigger as close to the closing bell before they report earnings. Why? If a stock has bullish momentum, the IV is gonna skyrocket exponentially until the report, and the stock is likely to go up pre-earnings too. So, it's better to wait.\nYou might ask: Why do you use a bearish strategy even if you're bullish? Simple. People are regarded. They pay way too fucking much for options the week of earnings. If someone is willing to pay for call options 30% out of the money on an overvalued company, who am I to deny them? 1 or 2 out of 100 times, they win. That's why I use that analysis to decide which ones are most likely to win for me. And indeed, I have won. All of them. About 25 total trades in a row out of 70-ish that I've analyzed. ONE of those 70 would have lost (DELL). But my model saw it coming, so i stayed away. I've made anywhere from 3-15% per week depending on how many of these I run per week. I started almost 3 months ago.\nThis is how my model looked when it was just a baby about a month ago - before I optimized it and did primarily earnings.\nMy first real model\nMy Model V2.\nIf any of you are planning on buying these LULU calls from me, I suggest not doing it.\nWhy call credit spreads and not put credit spreads? Because people are generally bullish on literally everything.\nWill this eventually fail? Mathematically, yes. Over a long enough timeframe and enough samples, anything will fail. That's why I made the model, to keep me as far away from failure as possible until I have enough money to have financial freedom. Hopefully I only have to do this a couple more months. It's not sustainable forever. Should you do it? It's not guaranteed, but sure, I don't care. If you want to use my model this week, go ahead.\nIf you have questions, DM me. If you want me to make a course so you can buy it from me, DM me. I'm not gonna make a course, but it will make me laugh.\nGood luck and happy trading.\nEDIT: Please stop swamping my DMs asking for a copy of my spreadsheet. I’ve spent weeks on it and it’s not even finished. I’m not prepared to give it away right now, sorry. \n",
            "gallery": []
        }
    },
    {
        "title": "$MSTR CONVERTIBLE NOTES ARE $2300 CALLS 🚀🚀🚀",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bgei80/mstr_convertible_notes_are_2300_calls/",
        "nr_comments": 34,
        "upvotes": "275",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/a84mzqln3roc1.jpeg"
            ]
        }
    },
    {
        "title": "Went full regard on calls, which ones should print?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bg9361/went_full_regard_on_calls_which_ones_should_print/",
        "nr_comments": 184,
        "upvotes": "272",
        "content": {
            "text": "Hello fellow regards, I went full regard on NVDA, TSM calls for next week GTC and TSM earnings in a month. Planning to get rid of NVDA calls after GTC if there is a high jump in the stock and it reaches 975-1000 level. For TSM, not sure if I am holding until earnings or selling before, I'll see based on how the stock moves. They should have their March earnings report come out too so that could be a good catalyst if it is good. Might lose some money of 200/220 4/19c's but those were bought just to have more shares to control for cheaper never meant to be held until expiration. \nAlong with these, I also jumped on the MSTR hype train with the short squeeze going on and the stock growing parabolic due to HF's having to buying the stock back to cut their losses. Was planning to sell this before the weekend to avoid theta, was 1k up on the call too but did not have my device to sell it so couldnt go thru with it. Planning to get out of it this week if MSTR does really good, else might try to breakeven if not.\nI also got some ORCL calls for their earnings. Since they were far OTM they got IV crushed. I was up 1k on them at one point but decided to hold for the NVDA conference due to their \"exciting partnership with NVDA in upcoming week\" announcement. Will sell the 140c's if the stock goes high due to the announcement, might get rid of most of 150c's too but will hold onto 160c's I think.\nWhat do you guys think, this yolo is gonna work? Which of these calls are gonna/not gonna print? Its either lambo or wendy's imo, I have my 60% my port in this play so hopefully it plays out.\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bg9361"
            ]
        }
    },
    {
        "title": "We need to talk about technical analysis",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bg84j9/we_need_to_talk_about_technical_analysis/",
        "nr_comments": 68,
        "upvotes": "0",
        "content": {
            "text": "In general, this sub is not a fan of using technical analysis to help guide options decisions. I was skeptical as well - I mean, looking at charts with a million imaginary lines drawn on it reminded me of Charlie and pepe silvia. Looked to me like people were drawing conclusions from imaginary data while thinking they were smarter than they really are. It also didn’t help that the technical analysis often failed. \nUnfortunately, this logic is flawed for a few reasons. First of all, no trader that religiously uses TA would say their strategy is 100%. Losses happen, trends are broken, and there are plenty of variables that technical analysis cannot cover. The goal is to be better than 50%, which would have prevented many of you regards from moving in behind the Wendy’s dumpster. \nSecondly, why would it be a bad thing to have more data at your disposal to help make decisions? If you choose to ignore the data and trends, that’s up to you. But it will never hurt to understand the bets we’re making a little better. Much of the loss porn on here come from positions that made little sense from a technical analysis perspective. \nI guess it comes down to what a trader’s goal is. If they want to gamble and make speculative bets, carry on. But personally, I would like to consistently trade profitability. After all, wouldn’t this sub be better if we were known for skilled plays instead of being regarded enough to populate every wendy’s dumpster? The sub needs to win its wife back from her boyfriend. \n",
            "gallery": []
        }
    },
    {
        "title": "\"Happy Learned to Putt\" (MSTR Vol.2)",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bg5wpj/happy_learned_to_putt_mstr_vol2/",
        "nr_comments": 62,
        "upvotes": "613",
        "content": {
            "text": "Running on Diesel Fuel and getting fitted for my Space Suit. \n34 inseam.  \n",
            "gallery": [
                "https://i.redd.it/stdcm0ti5poc1.png"
            ]
        }
    },
    {
        "title": "FedEx earnings",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bg3wjq/fedex_earnings/",
        "nr_comments": 40,
        "upvotes": "42",
        "content": {
            "text": "Last year Q3, FedEx missed earnings but upped their full-year earnings forecast, which helped drive the stock up. Maybe a similar story this time where they perform badly but announce some mechanism to provide optimism to the stockholders?\nhttps://www.reddit.com/r/Fedexers/s/MeA6QAWTQh\nhttps://www.reddit.com/r/wallstreetbets/comments/1bfetuu/i_did_it_my_first_ever_10_bagger/?share_id=xEk2LeROoccYfi1vByVDn&utm_content=1&utm_medium=android_app&utm_name=androidcss&utm_source=share&utm_term=1\nI have talked to many FedExer and most of them told it was a low volume seaso compare to 2_3 years ago. Many people won 10x bags last FedEx Er. \nThe things which is concerning is everyone is like \"FedEx puts for sure\" which I have seen many time goes total opposite such as in case of Costco. Also FOMOing badly. What are your thoughts? \n",
            "gallery": []
        }
    },
    {
        "title": "Update: winning",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bg2kp2/update_winning/",
        "nr_comments": 49,
        "upvotes": "380",
        "content": {
            "text": "If I didn’t sell either option I’d be up another 90k 🤡 bought shares instead because I was afraid of a correction\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bg2kp2"
            ]
        }
    },
    {
        "title": "My route to 200k",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bg1bmq/my_route_to_200k/",
        "nr_comments": 262,
        "upvotes": "576",
        "content": {
            "text": "Hi Regards,\nI'll just go ahead and dive in head first:\nI've been cooking up an options trading strategy focused on the earnings reports, and I'm laying it all out here, looking for your legendary insights, roasts, and wisdom. 🚀🌕\nThe Core of My Strategy:\n1. It's all about playing call options around earnings reports, targeting companies 2-3 weeks out from their big day. Puts? Nah, they're off the table due to less appealing risk/reward vibes considering capped earnings potential. If anything I would only revisit that idea in june where that seems to be the least ER releases.\n2. Keeping an eye on the VIX (and put-call ratio + a/d line) to gauge market mood swings. A high VIX might spell out more opportunities, but it's also sus.\n3. 200-day MA is my compass, guiding me through the stock's trend. Plus, comparing the stock's current stance against analyst price targets to sniff out underpriced gems. I am thinking of using Earnings Wisper. (because I'm not using my crack money)\n4. Timing is the key – I plan to exit just before earnings are announced. Trying to sidestep the \"sell the news\" trap that seems to catch the crowd off-guard and gain on the anticipation and the new open interest driving the calls price up. Only need +50%.\n5. With a starting war chest of $1,600, I'm throwing in an additional $1k each month. Targeting a 5% risk per trade, eyeing a 1.5 risk-reward ratio. Aiming for up to 12 trades a month, given that not every week is Christmas during earnings season.\nThis strategy isn't set in stone. I’m on a quest for knowledge\nWhat I'm Looking For:\n\nYour Experience: Ever danced this dance before? How'd it go?\nPitfalls: Any \"gotchas\" or common traps I might be overlooking?\nOptimization Tips: How can I sharpen my strategy? Any tools, indicators, or resources you swear by?\n\nI'm all ears and ready to learn from the best (and the worst). This is essentially everything i have learned from trading maybe ~3 months every day on SPY and losing money so I wanted to try something new.\n! 🚀🎲\n",
            "gallery": []
        }
    },
    {
        "title": "US inflation 3.2% makes us cry but Berkshire Hathaway swims in money",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bg10bo/us_inflation_32_makes_us_cry_but_berkshire/",
        "nr_comments": 161,
        "upvotes": "568",
        "content": {
            "text": "Summary: Berkshire Hathaway printing insurance money and keeping inflation up. Without shelter core inflation is at 2.2%. Rate cuts coming, Stocks go UP\nThis guy analysed the inflation data and guess who is profiting. Our beloved Warren Buffett. Without insurrance hikes we are below 2% inflation. https://www.youtube.com/watch?v=08u1BwMSKHA\n​\nhttps://preview.redd.it/rzni97wujnoc1.jpg?width=780&format=pjpg&auto=webp&s=915c2614fe0b36ecaa677f8405cd85f4d32fc59c\n",
            "gallery": []
        }
    },
    {
        "title": "How the Federal Reserve Could Throw Stocks for a Loop",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bfzojn/how_the_federal_reserve_could_throw_stocks_for_a/",
        "nr_comments": 64,
        "upvotes": "73",
        "content": {
            "text": "As of midday Friday, the S&P 500 index had declined just 0.2% for the week, while the Dow Jones Industrial Average gained 0.1% and the Nasdaq composite fell 0.7%.\nWhile stocks didn’t freak out about inflation, other financial markets certainly reacted. The federal-funds futures market reflects just a 58% chance that the Fed will cut interest rates at least once—by July. At the end of December, there was a 75% chance of at least one cut by March.\nWhat’s more, the two-year Treasury yield, a barometer for expectations about the fed-funds rate, is up more than 30 basis points for the year, to 4.7%. The last time it was at this level, in early December, the S&P 500 was 11% lower. (A basis point is 1/100th of a percentage point.)\nThe stock market is ignoring these troublesome signals—and the Fed may have to provide a wake-up call at its monetary policy meeting, which ends this coming Wednesday. Almost no one expects the Fed to actually do anything—there’s a 99% chance it leaves rates right where they are—but it’s the signals about the future investors should worry about. The current “dot plot” suggests three cuts this year, but it’s possible that could change.\n“The Fed’s policy meeting next week could be a highly consequential one,” writes Thierry Wizman, global foreign exchange and rates strategist at Macquarie, who notes it could “formally extend the wait-and-see period.”\nIf the Fed officially dashes hopes of rate cuts this year, the market would be, well, unthrilled. “We expect price action to be quite volatile as we believe that investors are placing too much emphasis on the timing and magnitude of potential Fed rate cuts, with market expectations and Fed speak seemingly at odds at the current moment,” writes Brian Belski, chief investment strategist at BMO Capital Markets. “We do not view the current pace of U.S. stock market gains as sustainable.”\nThe counterargument is that, under the surface, the market is showing signs that it can remain hot. More than 60% of stocks on the S&P 500 have notched gains this year, according to FactSet, so the index isn’t so reliant on a handful of Big Tech names to stay afloat. With inflation still pretty hot and commodity prices up this past week, the index’s energy and materials sectors gained. Even consumer staples, which broadly have strong pricing power, are flat for the week, outperforming the index.\nWill the Fed finally spark a rotation that causes the market to sink? We’re about to find out.\n",
            "gallery": []
        }
    }
]