[
    {
        "title": "$RDDT has low volume and interest on the first option date post-lockup",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnw9ae/rddt_has_low_volume_and_interest_on_the_first/",
        "nr_comments": 13,
        "upvotes": "20",
        "content": {
            "text": "180-day lockup ends mid-September; yet the following 18OCT24 options have pretty low volume and open interest compared to shorter durations. Same story for 17JAN25 and 16JAN26. \nI don’t get why long dated options aren’t getting more interest given that, historically, most IPOs slump after release, coupled with potential post-lockup selling. \n",
            "gallery": []
        }
    },
    {
        "title": "Denny's restaurants $DENN- undervalued?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnvdra/dennys_restaurants_denn_undervalued/",
        "nr_comments": 38,
        "upvotes": "10",
        "content": {
            "text": "Bought the stock around $6 in 2020, but missed selling around $20 during the COVID reopening in 2021. Thought the stock would reach $30, but in 2021 never anticipated inflation would hurt them so hard. Since 2022 the stock has really declined and slow boat to nowhere.\nThat said, they're a profitable company and a good dining option for price sensitive consumers during high inflation, but their stock doesn't reflect any of that. Instead analysts bash the stock for low growth especially in opening new franchised locations in the hyper competitive casual restaurant field. Why the disconnect between what analysts see and the fact that most Denny's locations have full parking lots daily?\n",
            "gallery": []
        }
    },
    {
        "title": "What a week I’M BACK BABY",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnv3yv/what_a_week_im_back_baby/",
        "nr_comments": 12,
        "upvotes": "30",
        "content": {
            "text": "Slowly making my way back to even. Say prayers for me regards \n",
            "gallery": [
                "https://i.redd.it/co36lgwexkqc1.jpeg"
            ]
        }
    },
    {
        "title": "$DWAC to $DJT -Likely does $90+....Trump Media & Technology Group start their Media Building Empire Officially Tomorrow. Read on..",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnuz7c/dwac_to_djt_likely_does_90trump_media_technology/",
        "nr_comments": 159,
        "upvotes": "22",
        "content": {
            "text": "Full Disclosure, I am NOT a TRUMP FAN. \nTruth Social will be just ONE arm. With the MASSIVE inflow of liquidity coming in from his share count, he can easily begin his media empire, under the same ticker. THATS WHAT PEOPLE WILL BE BUYING TOMORROW, NOT TRUTH SOCIAL.\nTrump TV? you bet your bottom dollar this is just the beginning Trump's long time goal of starting his own media empire, and Truth Social, a Twitter Clone is NOT the end all be all. It will likely evolve into a more unique social media platform, more akin to Facebook or Reddit a hybrid.\nHe certainly will have a shit ton of money to start his beloved: Trump/Truth TV. And EVERYTHING BRANDED WITH TRUTH/TRUMP in media. And this Trump Media & Technology Group will all be under THIS TICKER: $DJT and THAT'S  WHAT PEOPLE WILL BUYING TOMORROW, NOT TRUTH SOCIAL.\nHe certainly will have enough money to build his little ego media project ; )\nDonald Trump to own nearly 80 million 'DJT' shares\nBy Tomi Kilgore\nAfter Digital World Acquisition Corp.'s merger with Trump Media & Technology Group Corp. closes, former President Donald Trump is expected to own 78,750,000 shares of the combined company.\nThat would represent 69.4% of the outstanding shares, assuming maximum redemptions by DWAC shareholders, according to the latest S-4 filing with the U.S. Securities and Exchange Commission.\nTrump would be by far the largest shareholder. Why not, the company's stock ticker post-merger will be his initials, \"DJT.\"\nARC Global Investments, which is the investment vehicle of former Chief Executive Patrick Orlando. is expected to be the second-largest shareholder, with 10,790,415 shares, or 9.3% of the shares outstanding.\nCurrent CEO of Trump Media, Devin Nunes, would own 115,000 shares, or less than 1%.\nDonald Trump Jr., who is expected to be a director of the company post-merger, isn't listed as expected to own any shares after the deal closes.\nLINK:\nhttps://www.marketwatch.com/livecoverage/dwac-stock-trump-vote-truthsocial/card/donald-trump-to-own-nearly-80-million-djt-shares-IVyIqs7DTk5Ucl59sPvu\n",
            "gallery": []
        }
    },
    {
        "title": "Benzinga Newswire quoting WSB members about DWAC/DJT",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnufax/benzinga_newswire_quoting_wsb_members_about/",
        "nr_comments": 40,
        "upvotes": "117",
        "content": {
            "text": "Shoutout to u/RainGator, u/TheSavageBeast83, u/Chester-Ming, and u/ireddit2014\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bnufax"
            ]
        }
    },
    {
        "title": "Traders Tomorrow",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnub6y/traders_tomorrow/",
        "nr_comments": 39,
        "upvotes": "332",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/v41zdac1rkqc1.jpeg"
            ]
        }
    },
    {
        "title": "First gains post. In at IPO, out at $55. Invested only because of insider lockup.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnt4zz/first_gains_post_in_at_ipo_out_at_55_invested/",
        "nr_comments": 22,
        "upvotes": "108",
        "content": {
            "text": "",
            "gallery": [
                "https://i.redd.it/3szuddt4ikqc1.jpeg"
            ]
        }
    },
    {
        "title": "Imagine not making money",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnt2w1/imagine_not_making_money/",
        "nr_comments": 211,
        "upvotes": "1286",
        "content": {
            "text": "scroll out you regard. \nposition MSTR last week 1 1500c and 1 1600c into 1000 SMCI sold early and missed out on 50k. Rebought 1600 MSTR friday and sold at the beginning today and missed out on 80k+. \nCurrent Position: Lulu 400c 3/28, Dwac 45c 3/28 (you owe me one trump for stealing my money in 2021) and 200c AMD 4/19. \nnot financial advice, just here for the casino.\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bnt2w1"
            ]
        }
    },
    {
        "title": "Darkpools trend BULLISH for $NVDA",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnrtoq/darkpools_trend_bullish_for_nvda/",
        "nr_comments": 51,
        "upvotes": "37",
        "content": {
            "text": "Bearish sentiment continues to fall after the major pull back on 3/8. The trades themselves continue to gain green volume.\nLast Friday the sentiment was unclear but as of today its very obviously trending in a bullish direction. This aligns very well with the direction of the stock. I'm all in nvda this week, I personally believe we could see it touch $1000. Let me know what you think.\n",
            "gallery": []
        }
    },
    {
        "title": "PANW Next Move",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnr8fb/panw_next_move/",
        "nr_comments": 36,
        "upvotes": "26",
        "content": {
            "text": "Before the regarded police jumps on me, yes yes this is unrealized loss so not real loss porn. But I’d like to hear some regarded opinions on what’s going on with PANW in general and what you make of this play. \nI’m most likely going to diamond hand these through the fall at least. I think the election will have heightened attention towards cybersecurity in general. \nIn Auntie Nan We Trust \n",
            "gallery": [
                "https://i.redd.it/1mstg6n54kqc1.jpeg"
            ]
        }
    },
    {
        "title": "Why MARA perform worse than CLSK? Doesn't make sense at all",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnr3yj/why_mara_perform_worse_than_clsk_doesnt_make/",
        "nr_comments": 25,
        "upvotes": "8",
        "content": {
            "text": "MARA Hash Rate 28.7EH/s, which means around produce 43 BTC/day. For today's price that's like print 3M USD per day.\n​\nCLSK Hash Rate 16EH/s, like 55% of MARA, means around 24 BTC/day...1.67M USD per day.\n​\nMARA holding  16,930 BTC and CLSK only have 4218 BTC Holding.  That's like 25%\n​\nAnd now CLSK at 23.40 USD/per share and Market cap 4.63B. While MARA 20.95USD/per share and Market cap 5.61 Billion.\n​\nBTW RIOT hash rate  12.4 EH/s and hold 8067 BTC\n​\nGOT 50 MARA call today. Let's see how it goes...\n​\nCorrection for CLSK hash Rate\n",
            "gallery": []
        }
    },
    {
        "title": "RDDT hit $69 LFGGG",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnr07g/rddt_hit_69_lfggg/",
        "nr_comments": 64,
        "upvotes": "242",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/9ujbb6oj2kqc1.jpeg"
            ]
        }
    },
    {
        "title": "JOBY? (and other eVTOL)",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnqfgr/joby_and_other_evtol/",
        "nr_comments": 22,
        "upvotes": "6",
        "content": {
            "text": "What do you think about JOBY? They are an electric vertical take-off  and landing (eVTOL) small plane company that has already had  partnerships with NASA, Delta, UBER, Toyota, & the US Airforce.   Their plan is to be an affordable,  green ridesharing company similar to  Uber but in the air. They have $1B in cash, and  Dubai government just  granted them exclusive air taxi rights for next 6 years.   They  are scheduled to start providing service there in 2026.   \nIt seems like the next obvious step to me, and most of the time I  choose to literally invest in the future that I want to see.  It's  worked fairly well so far.  I only have a few hundred shares, but I'm  curious what y'all think.   \nThere are other emerging eVTOL companies that also have my  attention. I sometimes roll Archer (ACHR). They just got a deal with  United Airlines.   \nI have dabbled in Eve Air Mobility (EVEX)   \nI just learned about Blade but I haven't looked into them.   \nWhat do you think reddit?   \n",
            "gallery": []
        }
    },
    {
        "title": "I’m up 30% today on RDDT. Thanks Reddit!",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnpqop/im_up_30_today_on_rddt_thanks_reddit/",
        "nr_comments": 154,
        "upvotes": "746",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/qq4dnvqztjqc1.jpeg"
            ]
        }
    },
    {
        "title": "Citi loan Update: +$12k.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnpmy0/citi_loan_update_12k/",
        "nr_comments": 100,
        "upvotes": "794",
        "content": {
            "text": "Tomorrow 🚀\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bnpmy0"
            ]
        }
    },
    {
        "title": "$5K in COIN weekly $280 puts, what could go wrong?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnpepb/5k_in_coin_weekly_280_puts_what_could_go_wrong/",
        "nr_comments": 16,
        "upvotes": "5",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/o7m1i7horjqc1.jpeg"
            ]
        }
    },
    {
        "title": "Monday gains",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bno4in/monday_gains/",
        "nr_comments": 20,
        "upvotes": "132",
        "content": {
            "text": null,
            "gallery": [
                "https://www.reddit.com/gallery/1bno4in"
            ]
        }
    },
    {
        "title": "Yikes!!! There and back again! 2k-80k in two weeks.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bno1s9/yikes_there_and_back_again_2k80k_in_two_weeks/",
        "nr_comments": 50,
        "upvotes": "187",
        "content": {
            "text": "Full goblin mode. Original plan for the week was gamestopp calls but I got a lil impatience…\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bno1s9"
            ]
        }
    },
    {
        "title": "Doing my part for Reddit",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bno0il/doing_my_part_for_reddit/",
        "nr_comments": 13,
        "upvotes": "59",
        "content": {
            "text": "Bought these first thing this morning 💎👐🏽\n",
            "gallery": [
                "https://i.redd.it/9000koe6ijqc1.jpeg"
            ]
        }
    },
    {
        "title": "Canadian firm launches AI-powered ETF targeting AI investments",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnnjb1/canadian_firm_launches_aipowered_etf_targeting_ai/",
        "nr_comments": 10,
        "upvotes": "1",
        "content": {
            "text": "A Canadian asset manager launched an ETF using AI to build a portfolio focused on AI investments specifically. The fund, named Evolve Artificial Intelligence Fund (ARTI), includes megacap tech stocks like Nvidia and Microsoft, alongside lesser-known players like UiPath Inc. and CorVel Corp. Identifying these companies was challenging, akin to predicting beneficiaries of the internet boom in the 1990s. Evolve uses a model by Boosted.ai to select stocks with the right AI exposure. The fund will rebalance quarterly, aiming to minimize turnover and attract investor interest. \nSource: https://www.reuters.com/business/finance/canadian-firm-launches-ai-powered-etf-targeting-ai-investments-2024-03-25/\n",
            "gallery": []
        }
    },
    {
        "title": "Decent day, it's honestly meaningless until those earnings numbers come out",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnnew3/decent_day_its_honestly_meaningless_until_those/",
        "nr_comments": 222,
        "upvotes": "1241",
        "content": {
            "text": "Been getting tons of deleted posts so I'm not even going to address the bears on here. Have fun guys\n",
            "gallery": [
                "https://i.redd.it/fsplxhm1ejqc1.png"
            ]
        }
    },
    {
        "title": "Reddit puts",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnndso/reddit_puts/",
        "nr_comments": 55,
        "upvotes": "125",
        "content": {
            "text": "IPO = it’s probably overpriced \n",
            "gallery": [
                "https://i.redd.it/6ko0gagudjqc1.jpeg"
            ]
        }
    },
    {
        "title": "What Are Your Moves Tomorrow, March 26, 2024",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnnb5l/what_are_your_moves_tomorrow_march_26_2024/",
        "nr_comments": 6835,
        "upvotes": "622",
        "content": {
            "text": "View Post\n",
            "gallery": []
        }
    },
    {
        "title": "Update to my previous post🚀📈",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnnauw/update_to_my_previous_post/",
        "nr_comments": 58,
        "upvotes": "229",
        "content": {
            "text": "Yes, It's unrealized. I know.  Holding until at least Wednesday morning. \n",
            "gallery": [
                "https://i.redd.it/759fzx4ddjqc1.jpeg"
            ]
        }
    },
    {
        "title": "You guys are idiots for downplaying RDDT",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnn8nx/you_guys_are_idiots_for_downplaying_rddt/",
        "nr_comments": 595,
        "upvotes": "1043",
        "content": {
            "text": "do you realize GPT-1 through 3 were made primarily off Reddit posts?\nSam Altman is the largest shareholder in Reddit as well.\nPinterest is valued at 3.5x current Reddit valuation; yet Reddit has more traffic.\nThe fact that Reddit is valued so low and its ads make 10% of what meta makes off Facebook isn’t a weakness; it is a huge fucking opportunity. \nReddit is a social media AND AI play. You are idiots for going with the hive mind as you always do.\n",
            "gallery": []
        }
    },
    {
        "title": "BITX $31,000 Long at $47.2 (660 shares)",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnn5ct/bitx_31000_long_at_472_660_shares/",
        "nr_comments": 27,
        "upvotes": "2",
        "content": {
            "text": "BITX is a BTC futures 2x leveraged ETF.\nI had a rebalance set for Friday at 3 that I forgot to confirm. Would have made my average entry at $45.9 and would have been 700 shares. Got it in today and miss d on t on the 20% gain but that's ok.\nThe fund holds two months of Futures and cash on hand. AUM over a billion now.\nPlan to hold it through the halving in mid April. It constitutes 97% of my Roth IRA. If things go crazy high before then, I may reallocate up to 3% , twice per day, into my other slices, to lock in the gains.\nPosition represents about 10% of my Networth. I'm a Middle School History Teacher.\nI had a random encounter at the pharmacy parking lot yesterday with a guy from New Orleans who lives in my rural NC town now.  I was in my car lining up these trades for market open, and I exit my vehicle. \nThis big newer truck Rolls by, and the window lowers to expose a face covered in tattoos. Completely toothless. Two tear drop tats on the right side of his face. Indistinguishable and faded tats on his left arm. \nHe calls out loudly as he rolls closer, something to the extent of \"Ain't nobody listening to me. I've been at this fourteen years and no one will listen.\"\nThe plot dictates that I hear the man out. I wave him over to see what he has to say.\n\"5 million! Five million dollars, mark my words is where Bitcoin is going next year. Ain't nobody wanna listen. It's free money!\" \nAt this point I grin and motion him over to a parking spot. He tells me how BTC saved him when he bought in at $16 and cashed out most around $600 for various things, that he got cheated out of property by in laws but that his stache kept him afloat.\nThe Parking lot Prophet of Profit has spoken. It is either your buy signal from above, or your sell signal.\nI've been in BTC since 2017, but never have I ever had an actual random person on the street try to evangelize me on buying Bitcoin.\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bnn5ct"
            ]
        }
    },
    {
        "title": "Nutanix (NTNX) goes brrrr",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnmudo/nutanix_ntnx_goes_brrrr/",
        "nr_comments": 30,
        "upvotes": "8",
        "content": {
            "text": "Stupid IT ape here. Excuse my shitty English \nSo broadcom bought vmware and as everybody expected it's repeating the symantec move. They are firing lots of people, not renewing visa, raising prices (in some cases x10 or x20), selling parts of the company, etc.\nVmware is THE on premises virtualization company. If you still run non cloud (most big organizations do), then there is a very high chance you depend on vmware. \nThe rasing prices is not the only issue, you know there will be no good development, support is going to be a mess, etc...\nSince 1 month ago that this started everybody is going crazy looking for alternatives to run away from vmware, all vendors calling...\nNutanix is the best enterprise ready alternative, the other option is going full cloud (aws, azure,etc.), most companies won't do that due to many reasons (capex vs opex, latency, regulatory requirements, etc.). \nThe price raise will start soon, I predict it will get full attention after the next quarter results in a couple of months. \nDo your due diligence...\n",
            "gallery": []
        }
    },
    {
        "title": "$DWAC",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnmnu9/dwac/",
        "nr_comments": 35,
        "upvotes": "59",
        "content": {
            "text": "Before & after. Took profits before they switch the ticker to $DJT in the AM. Sensed a pump and dump\nAm I regarded for pulling out too soon or did I make a non-regarded choice for once?\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bnmnu9"
            ]
        }
    },
    {
        "title": "Am I cooked bros",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnmees/am_i_cooked_bros/",
        "nr_comments": 26,
        "upvotes": "27",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/gx8ps2547jqc1.jpeg"
            ]
        }
    },
    {
        "title": "700k RDDT YOLO now green!",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bnltq2/700k_rddt_yolo_now_green/",
        "nr_comments": 154,
        "upvotes": "675",
        "content": {
            "text": "Was down 70k at one point but mama we made it\n",
            "gallery": [
                "https://i.redd.it/owvq4pt33jqc1.jpeg"
            ]
        }
    }
]