[
    {
        "title": "BREAKING: Pentagon is funding a new $40 million Al program",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bicg9q/breaking_pentagon_is_funding_a_new_40_million_al/",
        "nr_comments": 16,
        "upvotes": "•",
        "content": {
            "text": "Newly leaked documents reveal that the Pentagon is funding a new $40 million\nAl program through DARPA with the codename \"CARCOSA\".\n",
            "gallery": [
                "https://i.redd.it/viz06ix848pc1.jpeg"
            ]
        }
    },
    {
        "title": "SPY 0DTE Question",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bibj8v/spy_0dte_question/",
        "nr_comments": 17,
        "upvotes": "•",
        "content": {
            "text": "I was looking at 0DTE's for SPY and I saw that SPY isn't very volatile, it is a pretty steady stock that only moves a few dollars up and down every day (at least in the last 3 months). Knowing that, would it be safe to sell puts completely out of the money for like 20 bucks? SPY is 512.69 currently and a 508 sells for 20 dollars. I know for sure it's not moving below 508 on March 19. Also, do that many people exercise SPY contracts in 0DTE or just sell it for a profit?\n",
            "gallery": []
        }
    },
    {
        "title": "AI missing link",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bibf6l/ai_missing_link/",
        "nr_comments": 11,
        "upvotes": "•",
        "content": {
            "text": "Let’s discuss potential missing link for the AI boom before it spirals into oblivious amount of worldwide adoption and hopefully find a missing link before it kicks off big time because that’s direction where  technology is headed.\nFirst of all we need to discuss what could AI potentially mean for our future and what implications it might have.\nTo my best of knowledge from reading various statements and articles, AI is going to take a big chunk of jobs across all of the sectors.\nLogistics\nTeslas Cybertruck will have an option of following one another and therefore you’ll have a fleet of trucks, commandeered by one driver who’s first in the convoy, cruising on a highway\nTesla is already mapping all the roads to perfection before the commercial usage of cybertrucks to it’s fullest.\nAutomation of factory jobs\nThere’s activist already actively protesting like we’re back in 1760 during the start of the industrial revolution.\nHealthcare \nAn AI doctor is currently learning about (Chatgpt-like software) that’s potentially going to make better judgments and diagnosis then the doctors themselves\nWe still might be a long way down the road from this one, but money is clearly being dumped into projects like these \nEducation \nAI softwares will have an ability to recognize students learnings patterns and adapt the learning program to each student individually.\nResults have been proven already at staggering 62% grade improvement. \nNot everyone learns the same and that’s the problem AI will fix\nThese are very few of many sectors in which AI will intertwine with our lives and it’s only the beginning. \nAs with all booms in the tech, AI is the logical next step.\nFor AI to achieve massive adoption it needs computing power, advertisement and ___________?\nTo break them down\nComputing power\nIf you haven’t heard about Nvidia, Dell, Taiwan Semiconductor Manufacturing etc.  you must live under a rock\nThese companies have been under the spotlight for a while now and they’re making record deals and gains.\nFor example.in 2013 Nvidia sold 1.5mil units of their H100 GPUs to Meta, Microsoft, Google and other companies for 37.5Billion in revenue only from 1 processor(wait times were about 6 months).\nThey’re also expecting to ship 2 million of the same GPU in this year.\nWith currently a supply being shorter then the demand, many companies are on a race to pick up the biggest pie of the cake and that was reflected on their stock prices.\nWith that being said ,Computing Power was one fragment of AI boom where the money could have been made by us investors( that’s if you recognized the opportunity on time) .\nNot saying there’s no more money to be made in this sector but we’ve definitely come far, fast. \nThe next fragment needed for a massive adoption of AI is advertisement.\nGoogle and Amazon are taking the first spots \nAI is directly used in advertising products across all of the sectors.\nIt’s abilities are reducing the amount of manpower for the job and it’s is also self advertising by doing so.\nThese kind of automated tasks will give companies the ability to reduce labour cost which will directly translate into higher revenue.\nMassive adoption of AI in advertisement sector is coming sooner then you think. \nFor a seed to become a tree it will need water, sunlight,and carbon dioxide.\nAs we mentioned above, massive AI adoption will need Computing Power, Advertisement and something else to really take over the whole technological sector like a wildfire.\nThe reason why I believe it needs something else to spark is because it’s simply not there yet.\nThere’s been great opportunities to make money in the last year with crypto going parabolic, especially AI projects, plain company stocks that sell/manufacture semi conductors, playing call options on their earnings, holding or playing call options on microstrategy etc.\nWith all the above being said, I’m asking you redditors, what is the missing link? \nIf we could figure out where will the next big money flow into, we can be ahead of the game and make some serious money.\nIf Massive AI adoption gas it’s carbon dioxide and water, what would sunlight translate into?\n",
            "gallery": [
                "https://i.redd.it/udmyi5kqt7pc1.jpeg"
            ]
        }
    },
    {
        "title": "The japs hike interest rates for the first time in 17 years",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bibdol/the_japs_hike_interest_rates_for_the_first_time/",
        "nr_comments": 18,
        "upvotes": "•",
        "content": {
            "text": "WW3 confirmed. The last time they did this they attacked Pearl Harbor. Man your battle stations and get your puts in a row boyos it’s about to go down \n",
            "gallery": []
        }
    },
    {
        "title": "Someone look at LCID stock",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bib86j/someone_look_at_lcid_stock/",
        "nr_comments": 21,
        "upvotes": "0",
        "content": {
            "text": "I think theres something special about this stock. Can someone look at the technicals and tell me if you see what I see. We have a chance of something big!\n",
            "gallery": []
        }
    },
    {
        "title": "Tesla downgraded by Goldman",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bib7ut/tesla_downgraded_by_goldman/",
        "nr_comments": 10,
        "upvotes": "13",
        "content": {
            "text": null,
            "gallery": [
                "https://m.ph.investing.com/news/stock-market-news/goldman-sachs-cuts-tesla-shares-amid-production-and-market-concerns-93CH-1165788"
            ]
        }
    },
    {
        "title": "It's time to go big short QQQ/SPY",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1biau1e/its_time_to_go_big_short_qqqspy/",
        "nr_comments": 36,
        "upvotes": "22",
        "content": {
            "text": "Good evening fellow regards,\nI never thought I'd be saying this but, this bull market is actually about to get some dick and we can make money buying puts. I'm usually not citing reasons aside from charts because fundamentals and environmental speculation are typically irrelevant, but since the market is making a major top there are indeed catalysts and warning signals. \nLet me start with the most compelling reason: BOJ is set to raise interest rates. There had been speculation on this in August the last time the market pulled back. Google this to learn about why it matters cuz it's too much to explain. The tl;Dr is the yen/usd trade enables a ponzi scheme in US equities that's mainly possible because of the negative Japanese rate. \nHow about warning signals in the charts? ⚠️ \nToday the current market leaders (chip stocks) rejected a bullish break upwards in their chart and went into \"system.sell mode\". I call it \"system.sell\" because the character of the selling is very much controlled and gradual. You could see it in 2022 often. \nOther former bad boys on the street, MSFT and AAPL, also rejected breakouts recently. \nMajor tops usually press into and fail against resistance multiple times with broadening candles. See QQQ and SPY charts. 🕵️‍♂️ \nBonus reasons and speculative targets for downside: \n1) McDonald's said recently people aren't buying their trash ass food because everyone is broke as fuck and out of savings. Might also throw some money at puts on these devils since these guys are the ones picket fencing the end of the world and their chart had spooky 👻 drops recently. \n2) Biden has recently asked Congress to dole out stimmy to the housing industry. Stimmy is usually reserved for the abatement of recession. \n3) It's March 18. Usually markets get some dick in February and March. The volume drawing catalysts of GTC and FOMC gives big money a decent way to exit some risk after a massive run up from last year's bottom. \nMy first target QQQ is 420, then 402.5, and 385 for a potential bottom(could be lower or higher, but im just looking at technical probability). Chart watchers would say it's 392, but volatility usually causes markets to overshoot. \nI don't really know about SPY cuz I don't trade it. But, your wife's boyfriend could probably tell you. \nGood luck, my friends. Also, for a stop loss and abandonment of this idea I'd reckon a break and close above 445 QQQ is where that's at. \n",
            "gallery": []
        }
    },
    {
        "title": "Updated NVDA Slides For Tomorrow",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1biagie/updated_nvda_slides_for_tomorrow/",
        "nr_comments": 17,
        "upvotes": "26",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/4la370hvk7pc1.jpeg"
            ]
        }
    },
    {
        "title": "Elon Musk teases flying car in Don Lemon interview: \"Jetsons Vibes\"",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bia41p/elon_musk_teases_flying_car_in_don_lemon/",
        "nr_comments": 13,
        "upvotes": "4",
        "content": {
            "text": "In an interview with journalist Don Lemon released in full on Monday morning, the Tesla and SpaceX CEO was asked about the new model of the Roadster—the car manufacturer's original design—which is due to be released next year. \"Look, I don't want to give away much more than what I've said publicly, except that the Roadster will be a collaboration between SpaceX and Tesla—so you can expect some rocket-y stuff there,\" he said. \nAsked by Lemon if it could be a flying car, Musk responded: \"Maybe,\" before waggling his head and laughing. \"It's not out of the question. I've got to reserve the cool stuff for when we actually unveil it, but it's going to be really cool; it's going to have some rocket technology in it.\"\nHe added: \"I think, really, the only way to do something that's cooler than the Cybertruck is to combine SpaceX and Tesla technology to create something that's not ever really a car.\"\n\"Then what would it be?\" Lemon asked.\n\"Something that's never existed before,\" Musk said, before agreeing with Lemon that it would have \"Jetsons vibes,\" a reference to the space age Hanna-Barbera cartoon which features flying cars.\nWHAT WE KNOW:\nMusk has previously teased the collaboration between his two companies in a June 2018 post on X, formerly Twitter—a platform which he now also owns.\nAt the time, he said the electric sports car would have a SpaceX-designed optional package that would include around *\"10 small rocket thrusters arranged seamlessly around [the] car\"** that would \"dramatically improve acceleration, top speed, braking & cornering. Maybe they will even allow a Tesla to fly...\"*\nIn 2019, he wrote that the new model would be able to go from zero to 60 miles per hour in 2.1 seconds \"before adding [the] rocket thruster option.\"\nThen late last month, Musk wrote on X that he had \"radically increased the design goals for the new Tesla Roadster,\" adding: \"There will never be another car like this, if you could even call it a car.\"\nSource: https://www.newsweek.com/elon-musk-teases-tesla-flying-car-spacex-don-lemon-interview-1880275\n",
            "gallery": [
                "https://www.newsweek.com/elon-musk-teases-tesla-flying-car-spacex-don-lemon-interview-1880275"
            ]
        }
    },
    {
        "title": "RKLB to the 🚀",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bia1t0/rklb_to_the/",
        "nr_comments": 11,
        "upvotes": "12",
        "content": {
            "text": "RKLB, not a popular name to a lot of investors and customers, but it'll be real soon.\nA little about RKLB and why I'm sharing this with you..\nRocketLabUSA is a new big player in the space industry, they're gonna be like spaceX v2.0, except publicly traded, and owns hundreds of contracts with the government. They recently partnered with NASA to go on space missions and they're well funded. They even  have contracts for IoT Machines & Technology, IoT is the technology where you can control physical things by just simply the Internet, which you already know how huge that is, especially do they implement that into their space missions. I attached screenshots of their upcoming missions, I didn't get All of them since they got a lot planned for 2024, basically All the work they did in the past was literally built for 2024, so this is a huge beginning for them. All the missions that I mentioned and you'll read about are all scheduled to launch in 2024! Including NASA missions.\nI saw this and I've been learning more about them for a month now, I'm extremely excited to see their growth. \nMy calls are already in 🤣\nLmk your thoughts\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bia1t0"
            ]
        }
    },
    {
        "title": "Why don't I see much straddling in here?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi9xgn/why_dont_i_see_much_straddling_in_here/",
        "nr_comments": 24,
        "upvotes": "28",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/swa39er7g7pc1.jpeg"
            ]
        }
    },
    {
        "title": "Where to gamble a measley 100$",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi9s0g/where_to_gamble_a_measley_100/",
        "nr_comments": 17,
        "upvotes": "0",
        "content": {
            "text": "I want to whale on my favorite game but I don’t want to spend more than 100$.  I figure I’ll throw it down on an option or two and see how much I get to spend. I’m thinking TQQQ or XXXX, but if some guy on the internet has a surefire play I’m all ears\n",
            "gallery": []
        }
    },
    {
        "title": "Step forward, regard",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi9k9x/step_forward_regard/",
        "nr_comments": 10,
        "upvotes": "52",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/uw20umz1d7pc1.jpeg"
            ]
        }
    },
    {
        "title": "Dow jones",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi9e1t/dow_jones/",
        "nr_comments": 19,
        "upvotes": "36",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/5asp7kajb7pc1.jpeg"
            ]
        }
    },
    {
        "title": "My ketamine prescription is in the best interests of Tesla investors, says Elon Musk",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi97tf/my_ketamine_prescription_is_in_the_best_interests/",
        "nr_comments": 13,
        "upvotes": "37",
        "content": {
            "text": null,
            "gallery": [
                "https://ca.finance.yahoo.com/news/ketamine-prescription-best-interests-tesla-174908123.html"
            ]
        }
    },
    {
        "title": "Nvidia CEO Jensen Huang announces new AI chips: 'We need bigger GPUs'",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi90w9/nvidia_ceo_jensen_huang_announces_new_ai_chips_we/",
        "nr_comments": 11,
        "upvotes": "79",
        "content": {
            "text": null,
            "gallery": [
                "https://www.cnbc.com/2024/03/18/nvidia-announces-gb200-blackwell-ai-chip-launching-later-this-year.html"
            ]
        }
    },
    {
        "title": "One of us. One of us. One of us.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi8ukx/one_of_us_one_of_us_one_of_us/",
        "nr_comments": 14,
        "upvotes": "52",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/stvj1kpx67pc1.jpeg"
            ]
        }
    },
    {
        "title": "Google King of AI - tendies update",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi7wq7/google_king_of_ai_tendies_update/",
        "nr_comments": 10,
        "upvotes": "10",
        "content": {
            "text": "If you haven't read my DD \"Google: King of AI, end of woke\" - then maybe you should\nI didn't realize the tendies would come so soon but of course the GeminiPhone announcement certainly helped. Sorry not sorry to all the Goog haters.\nhttps://preview.redd.it/54qmxarvx6pc1.png?width=1208&format=png&auto=webp&s=518d725751fec09b49be9e946c302b3a18c5790c\nThis is just the beginning though, one news story that the market is reacting to but only a first step of the overall trend until sentiment reverses. Google has the full AI package and share price has a ways to go to catch up to the AI hype names. I'm hodling.\nCheck out this screenshotted Reuters article echoing the King of AI thesis\nhttps://twitter.com/pennycheck/status/1769707761015615523\nThe time to sell is when everyone agrees Goog is the King. Right now people are just excited about the AAPL deal. Enjoy the ride ya'll\n",
            "gallery": []
        }
    },
    {
        "title": "NVDA's Wall of Calls",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi7o2n/nvdas_wall_of_calls/",
        "nr_comments": 93,
        "upvotes": "744",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/t5a144yzw6pc1.png"
            ]
        }
    },
    {
        "title": "Snowflake ❄️ + NVIDIA",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi6y6k/snowflake_nvidia/",
        "nr_comments": 15,
        "upvotes": "28",
        "content": {
            "text": "Snowflake partnership with NVDIA\nBeen holding 100 shares of $SNOW since the last time it dipped down to these levels.\nI miss the Sloots but Sridhar is making moves. As long as he starts talking about drugs on the next earnings call he’s golden.\n",
            "gallery": [
                "https://investors.snowflake.com/news/news-details/2024/Snowflake-Teams-with-NVIDIA-to-Deliver-Full-Stack-AI-Platform-for-Customers-to-Transform-Their-Industries/default.aspx"
            ]
        }
    },
    {
        "title": "Nike is 'losing its luster,' downgraded to Sell",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi6sc9/nike_is_losing_its_luster_downgraded_to_sell/",
        "nr_comments": 56,
        "upvotes": "91",
        "content": {
            "text": "Nike (NKE) received a downgrade from Williams Trading. Analyst Sam Poser lowered their rating to Sell from Hold and decreased their price target from $92 to $85, arguing that the company is \"losing its luster.\" Poser was also critical of Nike's leadership.\nhttps://finance.yahoo.com/video/nike-losing-luster-downgraded-sell-201225210.html\n",
            "gallery": []
        }
    },
    {
        "title": "What's an appropriate P/E multiple for the S&P 500? 40x? 80x?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi6j2h/whats_an_appropriate_pe_multiple_for_the_sp_500/",
        "nr_comments": 11,
        "upvotes": "4",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/cjyfhsihn6pc1.png"
            ]
        }
    },
    {
        "title": "Robinhood to allow Futures Trading",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi6gxn/robinhood_to_allow_futures_trading/",
        "nr_comments": 47,
        "upvotes": "93",
        "content": {
            "text": "As for my two cents… it’ll be a bloodbath. Apparently, Robinhood users don’t hemorrhage enough money already on short term out of the money options. Robinhood thought, let’s kick this up a notch. I get the libertarian mindset, but still, the losses will be massive. Helping your users bankrupt themselves as swiftly as possible doesn’t seem like the best long term strategy.\nThe screenshot is from the Stocktwits newsletter.\n",
            "gallery": [
                "https://i.redd.it/p2jpoh4jn6pc1.jpeg"
            ]
        }
    },
    {
        "title": "The Singularity is Coming Faster Than Your Wife's Boyfriend 🚀📈",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi62bx/the_singularity_is_coming_faster_than_your_wifes/",
        "nr_comments": 124,
        "upvotes": "402",
        "content": {
            "text": "Listen up regards, the AI singularity is about to skull-fuck the markets and send certain stocks to the goddamn moon. 🌙 You think Elon's self-driving cars and sexbots are cool? Child's play compared to the exponential mindfuckery that's brewing.\nOnce artificial superintelligence arrives, it's game over for you smooth-brained apes still YOLOing on meme stocks. The ASI will analyze the markets with the processing power of 69,420 autist brains and then proceed to 4D chess the financial system into total submission. SPY $4206.90 EOY.\nSo which stocks will be the horse cock winners in our robot overlord future?\n$NVDA, $AMD - no shit, Captain Obvious. These guys make the silicon dildos powering the AI revolution. They'll keep printing tendies even after SkyNet goes live.\n$GOOG, $AMZN - if the AI doesn't kill us all, it'll still need to advertise shit and sell us more useless crap we don't need. Goog and Bezos will happily plug into the AI hive mind. literal cannot go tits up.\n$TSLA - Papa Elon's galaxy brain will either merge with the AI god and become an immortal cyborg, or get his ass absolutely clapped when the AI concludes humans are obsolete. Either way, TSLA to $42,069. Funding secured.\nTL;DR: We're all fucked in the long run but you can still profit in the short term before the AI takes over. Something something first as tragedy, then as farce. GUH. Positions: long $ROPE\nThis is not financial advice, I lick windows and eat crayons for all 3 meals. Do your own research and may Jerome Powell have mercy on your souls.\n",
            "gallery": []
        }
    },
    {
        "title": "Might be working at Wendy's next week or buying a Lambo",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi5tud/might_be_working_at_wendys_next_week_or_buying_a/",
        "nr_comments": 282,
        "upvotes": "407",
        "content": {
            "text": "Yolo\n",
            "gallery": [
                "https://i.redd.it/evb3nvjni6pc1.jpeg"
            ]
        }
    },
    {
        "title": "Important: GTC Financial analyst Q&A will be held 3/19/24 8:30am PT",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi5i8k/important_gtc_financial_analyst_qa_will_be_held/",
        "nr_comments": 18,
        "upvotes": "29",
        "content": {
            "text": "https://preview.redd.it/sjat381lf6pc1.png?width=1216&format=png&auto=webp&s=0ee4b4b002c7e9edf392c1757fcd9af45184e7f1\nGTC financial analyst call is tomorrow morning. NVDA might recover when its obvious how big todays announcement was. Jensen did not say how much of an impact Blackwell will have on Nvidia's profits. Hopefully tomorrow morning we can understand how much Nvidia is going to gain with this new GPU.\n",
            "gallery": []
        }
    },
    {
        "title": "Breaking news from Australia !",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi5d5v/breaking_news_from_australia/",
        "nr_comments": 20,
        "upvotes": "829",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/t25tlq07f6pc1.jpeg"
            ]
        }
    },
    {
        "title": "Biggest gain and biggest loss",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi4za3/biggest_gain_and_biggest_loss/",
        "nr_comments": 31,
        "upvotes": "37",
        "content": {
            "text": "New to the subreddit. Thought I'd share a big win and a big loss.\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bi4za3"
            ]
        }
    },
    {
        "title": "TLDR for those of you that didn’t watch NVDA livestream today",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi4me4/tldr_for_those_of_you_that_didnt_watch_nvda/",
        "nr_comments": 302,
        "upvotes": "1479",
        "content": {
            "text": "\nNVDA is rebranding to SKYNET\nNVDA will convert the majority of the worlds workforce into GPUs within the next couple decades\nNVDA will definitively bring us into a Star Wars era of robotics within the next couple decades\nNVDA will have deep roots in every industry, including weather, biology, construction, warehousing, logistics, everything\nDatabases will become intelligence generators. AMZN, MSFT, GOOG, ORCL are also going to Jupiter, likely operating as NVDA, erm sorry SKYNET subsidiaries\nBlack leather jackets will indefinitely be the new fashion craze and be perpetually sold out\n\nLong live Jensen Huang, long live NVDA.\n",
            "gallery": []
        }
    },
    {
        "title": "God I love Nvdja",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bi3yn5/god_i_love_nvdja/",
        "nr_comments": 19,
        "upvotes": "21",
        "content": {
            "text": "Big gains from Friday. Lose it all come Friday. 🐱\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bi3yn5"
            ]
        }
    }
]