[
    {
        "title": "Which stock are you going to ride or die with at least for the next 5 years?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmdfbl/which_stock_are_you_going_to_ride_or_die_with_at/",
        "nr_comments": 15,
        "upvotes": "•",
        "content": {
            "text": null,
            "gallery": []
        }
    },
    {
        "title": "Should I keep it or sell it ? NVDA",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmbxzg/should_i_keep_it_or_sell_it_nvda/",
        "nr_comments": 18,
        "upvotes": "•",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/co82x512j7qc1.jpeg"
            ]
        }
    },
    {
        "title": "NANCY PELOSI STRIKES AGAIN",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmazb8/nancy_pelosi_strikes_again/",
        "nr_comments": 23,
        "upvotes": "55",
        "content": {
            "text": "Hope you all saw the post / news about Nancy Pelosi’s recent investment into Datbricks and it’s connection to Forge Global. \nAnyways, I bought some contracts on Friday afternoon.. stock went up almost 40% AH (I’m assuming people found out about Forge Global and its link).\nAssuming these contracts are worth 1.44 at open, that’s a ~ 1.8k profit. Not much but still profit. I’m thinking of selling 5 at open and letting the other 5 ride a few days as more people hear about the news. What do you all think I should do? \nAlso, this stings a bit as I almost put in 7k worth of contracts instead of 700… should have went with the 7k but oh well, hindsight is always 20/20.\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bmazb8"
            ]
        }
    },
    {
        "title": "CEO of soon to be the most valuable company in the planet wants you to suffer",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmayld/ceo_of_soon_to_be_the_most_valuable_company_in/",
        "nr_comments": 181,
        "upvotes": "652",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/hwbsjjvh97qc1.jpeg"
            ]
        }
    },
    {
        "title": "How to buy Ukrainian bonds in US/Canada? They currently pay about 38.10% per year.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmarp7/how_to_buy_ukrainian_bonds_in_uscanada_they/",
        "nr_comments": 68,
        "upvotes": "189",
        "content": {
            "text": "https://www.finanzen.net/anleihen/a2rtrp-ukraine-anleihe\n",
            "gallery": [
                "https://i.redd.it/d1n9wl8o77qc1.png"
            ]
        }
    },
    {
        "title": "Who put this up at the Meiji shrine in Tokyo",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm9d2w/who_put_this_up_at_the_meiji_shrine_in_tokyo/",
        "nr_comments": 86,
        "upvotes": "1968",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/3k54c3wnu6qc1.jpeg"
            ]
        }
    },
    {
        "title": "FTX: SBF’s lawyers slam DoJ’s “medieval” 50-year sentence recommendation",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm909y/ftx_sbfs_lawyers_slam_dojs_medieval_50year/",
        "nr_comments": 32,
        "upvotes": "89",
        "content": {
            "text": null,
            "gallery": [
                "https://v.redd.it/ebktn54hr6qc1"
            ]
        }
    },
    {
        "title": "Lululemon Stock Drops 16% Despite Earnings Beat, as Guidance Is Lighter Than Wall Street Expected",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm8g0u/lululemon_stock_drops_16_despite_earnings_beat_as/",
        "nr_comments": 43,
        "upvotes": "90",
        "content": {
            "text": "Lululemon Athletica (NASDAQ: LULU) stock dropped 15.8% on Friday, following the activewear specialist's release on the prior afternoon of its report for the fourth quarter of fiscal 2023, which ended Jan. 28. (You read these numbers correctly -- fiscal year 2023 includes about a month of calendar year 2024.)\nThe stock's decline is attributable to guidance, not to the fourth-quarter's results. Management's outlook for the first quarter and full year of fiscal 2024 was lighter than Wall Street had expected for both revenue and earnings. The fourth-quarter's results, on the other hand, beat the analyst consensus estimates for the top and bottom lines.\nhttps://finance.yahoo.com/news/lululemon-stock-drops-16-despite-110000658.html\n",
            "gallery": []
        }
    },
    {
        "title": "Why Apple Will Prevail",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm893e/why_apple_will_prevail/",
        "nr_comments": 65,
        "upvotes": "32",
        "content": {
            "text": "The Department of Justice has filed its long-telegraphed suit against Apple, and it will doubtless be a long process that will produce negative headlines, but we think that Apple will prevail in the end. Similarly, Apple does not have a monopoly on the broader smartphone or digital gaming markets. The DOJ case is broader but will still ultimately hinge on defining market (is the market iOS or all smartphones?) and producing evidence showing that Apple’s actions directly harmed competition and consumers.\nhttps://finance.yahoo.com/m/0e345398-8ea0-38be-9155-c5078e078a53/why-apple-will-prevail.html\n",
            "gallery": []
        }
    },
    {
        "title": "Lulu calls",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm7ja0/lulu_calls/",
        "nr_comments": 44,
        "upvotes": "57",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/iu0oadxze6qc1.jpeg"
            ]
        }
    },
    {
        "title": "All aboard the Winnebago",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm6dup/all_aboard_the_winnebago/",
        "nr_comments": 12,
        "upvotes": "45",
        "content": {
            "text": "Do I know what I’m doing? No\nDo I know to always inverse what some regard on WSB says on here? Yes\n",
            "gallery": [
                "https://i.redd.it/31o247np56qc1.jpeg"
            ]
        }
    },
    {
        "title": "RDDT options all things set",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm5zo6/rddt_options_all_things_set/",
        "nr_comments": 28,
        "upvotes": "53",
        "content": {
            "text": "All things are set in TastyTrade to Monday ...\nI hope I don't get a free pass on Wendy's. See you there regards.\n",
            "gallery": [
                "https://i.redd.it/nlhwdglk26qc1.png"
            ]
        }
    },
    {
        "title": "SoundHound AI DD: THE MOAT OF RESTUARANT AI",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm5vmd/soundhound_ai_dd_the_moat_of_restuarant_ai/",
        "nr_comments": 13,
        "upvotes": "5",
        "content": {
            "text": "My SoundHound AI DD\nRelationship with Nvidia:\nYes, we all know Nvidia has 1,730,883 shares of SOUN which was around 3.7 million at the time of the investment. Yes I KNOW THAT INVESTMENT WAS NOT RECENT. I swear to god if one of you says that in the comments. Listen up regards, you know what is recent? Rishi Dhall the VP of Automotive at Nvidia announcing they are working with SoundHound (SH) to bring gen AI into cars. Here’s the direct quote, “We’re working with innovative partners like SoundHound to bring generative AI and accelerated compute into the car - enhancing the occupant experience and bringing greater safety behind the wheel. SoundHound’s in-vehicle voice interface, powered by NVIDIA DRIVE, can provide drivers with fast, accurate information, even when there’s no connection.” If directly working with Nvidia doesn’t get you up then maybe you need to get that checked out.  \nRoad to profitability:\nRevenue model. Product royalties & service subscriptions. They have secured payment processing partnerships with Toast, Oracle and Square. Demand is through the roof, Daddy Keyvan Mohajer, CEO of SH, said that they have to put “multi-national chains with tens of thousands of locations” on hold to deal with EVEN BIGGER COMPANIES. Just one year ago SH was knocking on companies doors to get their business, now they have a WAIT LIST them. Some companies are signing contracts with SH for TEN YEARS. The avg is 6.5 years! Money going toward soliciting for sales will be DECIMATED.  \nSH recently (feb 2024) INCREASED their revenue guidance for 2024 and 2025 with revenue at 70 million for 2024, and exceeding 100 million for 2025. Revenue at 70 million is almost DOUBLE of 2023’s revenue of 38.227 million. Why does this matter? Companies DO NOT say they are increasing revenue unless they are SUPER confident, having to backtrack on guidance is not something companies want to do. CFO Nitesh Sharon of SH said “... in the restaurant space that for us is billions and billions of annual revenue opportunity. And we’re just scratching the surface of it.”\nBeing that SH is close to profitability, and once profitable, they have $395 million fed and $109 million state losses from previous years that they can write off on any future income thus allowing for EVENGREATER REVENUE MARGINS.    \nConsumer feedback:\nRestaurants using SoundHound AI love their service and plan on continuing their subscriptions. See SoundHound’s most recent YT video from Detroit's Original Chicken Shack Fast and Efficient: How Detroit’s Original Chicken Shack Is Winning with AI Even the employees love this phone answering service, cause THEY DON’T HAVE TO ANSWER THE DAMN PHONE ANYMORE. Anyone who’s worked in the service industry knows how awesome this is. THIS PROVES SH RESTAURANT SERVICES ISN'T JUST FOR DRIVE THRU AI TERMINALS. But those are great too.   \nSYNQ3 Acquisition:\nFinalized Jan 3 2024.   \n\nThis brings in over 10,000 signed restaurants, with 100,000 in the pipeline.\nWill enhance SoundHound’s AI models by bringing in the data of 50 million interactions\nThis acquisition helps SoundHound solidify themselves as the restaurant AI leader\nBrings in Steve Bigari, CEO and Co-Founder of SYQN3 and a former McDonald’s Operator\n\nSH announced yet another TOP 15 fast food chain has been secured and that announcement will be soon.\nMY OWN THOUGHTS: As fast food chains look toward AI and see their competitors lining up to use SH’s services, we will see the major chains follow suit soon. Do you think Old Uncle McDonald and his farm want to go with a competitor like Presto Automation who can barely keep their lights on? Who even likes Presto? Yuck! No, they will want to go with SoundHound AI. When this next Top 15 fast food chain is announced, I suspect another jump in SH’s share price soon. Last time SOUN jumped to 10 dollars the short interest dropped to 9% as short sellers closed their positions helping run the price up. Short interest is back up to 13% already, and I can't wait to see this short sellers get burned. SOUN to the moon 🚀\nPositions as follow:\n434 shares @ 7.19\n15 1/16/26 $10 Calls @ 2.18 Average  \nShares\nCalls\nI will be loading up on more shares and more 2026 calls. Will update in 1 month. Expecting to double my position sizes. No this is not a short term play, this is DD for 💎🙌. If you gamble on short term calls expecting them to announce Uncle Ronnie has signed on next week, THAT IS ON YOU. NOT FINANCIAL ADVISE. \n",
            "gallery": []
        }
    },
    {
        "title": "Nvidia announces AI-powered health care 'agents' that outperform nurses — and cost $9 an hour",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm5syp/nvidia_announces_aipowered_health_care_agents/",
        "nr_comments": 390,
        "upvotes": "1602",
        "content": {
            "text": null,
            "gallery": [
                "https://www.foxbusiness.com/technology/nvidia-announces-ai-powered-health-care-agents-outperform-nurses-cost-9-hour"
            ]
        }
    },
    {
        "title": "Advice on using Insider info?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm5ki6/advice_on_using_insider_info/",
        "nr_comments": 26,
        "upvotes": "0",
        "content": {
            "text": "I trust Chatila. Yes I look at the Open Insider website. Yes, I'm a degenerate.\nI just got a bunch of calls on FTCI - first time using options derivatives on Robinhood. Let's hope it doesn't bite me in the Ass.\nI'm bullish though - seems that the insiders know more than we do necessarily. Has anyone used this information/sort of strategy effectively? \nI'd like to hear your takes - maybe I can learn a semi-profitable strat here.\nhttps://preview.redd.it/o86tw67bz5qc1.png?width=1576&format=png&auto=webp&s=65482adddcce59e0abd0d1ea73aca9b107c4acc7\n",
            "gallery": []
        }
    },
    {
        "title": "The Will it Or Won’t It Come Back Dilemma (BOEING, BABA, & 3M)",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm4vk4/the_will_it_or_wont_it_come_back_dilemma_boeing/",
        "nr_comments": 44,
        "upvotes": "0",
        "content": {
            "text": "A lot of us have been bag-holding many stocks. Oftentimes it’s because we feel—especially if it’s a large company, well-known brand, formerly perennial earnings report beater—like it will come back. Classic case are Boeing and BABA. \nThe logic is typically:\nBoeing: It’s a duopoly with Airbus. It’s gotta come back…\nBABA: Once China comes back, BABA will definitely rip up…\nUnfortunately, not all formerly great names come back. \n3M is a case study in this—a company that once was a reliable winner has been dead money for years now.\nAll this to say…\nWhat are YOU bag-holding? Have you thought about the opportunity cost? Is it time to actually just cut those losses and sell? \n",
            "gallery": []
        }
    },
    {
        "title": "Next NVDA Move",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm3ixo/next_nvda_move/",
        "nr_comments": 111,
        "upvotes": "161",
        "content": {
            "text": "What’s going on regards — I come bearing some gain porn disguised in an inquiry for regarded and sensible opinions alike. \nNow these have clearly printed more than enough so I’m looking to mitigate risk a bit. In particular, I don’t trust the next couple FOMCs and inflation numbers action. I have no doubts they’ll crush earnings, but we just saw a semi-“delayed” pump with NVDA after the keynote. \nAt the same time, momma didn’t raise a paper-handing bitch. So instead of selling and tossing into VOO, I’m looking to roll these over to 2 $1060C for 03/25. Solid likelihood of those being in the money much before then. \nAlright not trying to write essays — let me hear whatever drug-fueled creative responses you come up with\n",
            "gallery": [
                "https://i.redd.it/7w9bc83oj5qc1.jpeg"
            ]
        }
    },
    {
        "title": "YOLO",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm2j05/yolo/",
        "nr_comments": 420,
        "upvotes": "2137",
        "content": {
            "text": "Listen up regards, Jimmy is going to the moon, here’s why.\nInsiders buying more, 75.4 million shares drs, Ryan Cohen becoming CEO and investing company money with ZERO compensation, over $1 billion in cash, $100 million swings YoY, full year profitability, best quarter of the year, and market at all time highs. Yet the stock price has declined for 3 years and is currently near its 52 week low. Seems look there isn’t much more room for downside with green dildo sized upside potential.\n",
            "gallery": [
                "https://i.redd.it/fmcv3v89c5qc1.jpeg"
            ]
        }
    },
    {
        "title": "NVDA Puts ruining my plans to live off market",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm1joe/nvda_puts_ruining_my_plans_to_live_off_market/",
        "nr_comments": 356,
        "upvotes": "658",
        "content": {
            "text": "I sold and bought calls mid-day but I’m really hoping this MSTR put will pay off. If only BTC can keep getting pounded until after Monday morning.\nDisclaimer: I left my job and do not want to work for a red-headed girl any more\nTLDR: I was fired and I’m blowing my savings\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bm1joe"
            ]
        }
    },
    {
        "title": "Will DJT shit the bed next week? Full DD with updated regard speculative theory on Trump selling",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blylzw/will_djt_shit_the_bed_next_week_full_dd_with/",
        "nr_comments": 477,
        "upvotes": "747",
        "content": {
            "text": "Before this adderall-fueled hype train leaves the station next week, I thought i'd write up a definitive DD on the imminent DWAC/DJT merger.\nThis DD will cover everything: fundamentals, Truth Social, ownership, dilution, Trump's holdings and lockup, the future of TMTG, regarded theories and more. You may have seen my original comment (that was stolen and reposted) with a regarded theory about Trump selling shares - if you can't be bothered to read the full DD, then skip to the end for an updated regard theory of Trump potentially selling shares - now with new information and speculation!\nBefore I begin, a quick shoutout to the legend that is u/SPAC_Time. This guy is probably the most knowledgeable person about SPACs i've ever seen, and has been posting excellent information over on r/DWAC_Uncensored, a lot of which is included in this DD. I strongly recommend going and having a look at this sub as it has SO much great information on it. There's loads on there that i've not included in this DD. He's also patiently answered all my questions, so thank you king.\nI've been following this since the beginning, and even made an account on Truth Social to see what the bulls are thinking. Honestly some of the shit they come out with over there make the regards on this sub seem like fucking Albert Einstein.\nI'll also preface this by saying I have a terrible trading record, mostly crippling losses, so obviously none of this is financial advice and you should ignore everything I say. If anything is incorrect drop a comment below and i'll fix it.\nOverview\nYou probably already know what this is about, so I won't go into to much detail. Back in 2021, Trump started his own company, TMTG (Trump Media and Technology Group), which owns the social media network Truth Social. It wasn't actually Trump's idea, it was pitched to him, more on this later. The aim is to bring this to the public markets via a SPAC merger with DWAC (Digital World Acquisition Corp). Yesterday shareholders approved the merger, and it's set to complete this merge next week. DWAC has been trading publicly for a few years now, soon the ticker will change to DJT when the merger is finalised.\nBefore I get into the finer details, here's a quick TL;DR of the bull and bear points for those who will look at this post and say \"i'm not reading all that\"\nBullish\n\nTrump is a hype machine.\nSomething something woke mind virus and free speech\nTruth Social is a soapbox for Trump, and everyone listens to what he says.\nThe run-up to the election will generate a lot of hype.\nIf Trump wins the election, DJT could trade on hype for a long time\nIn theory, if he does win the election, TMTG could become significantly more relevant, leading to an improvement in its fundamentals.\nIf the above happens, it's possible TMTG could bring to market their other proposed ventures - a news network and competitor to the existing streaming services.\n\nBearish\n\nThe fundamentals are pure dogshit\nIf Trump loses the election, it's all over, TMTG will probably go bankrupt.\nTrump could potentially sell shares around the time of the merger.\nDJT will be propped up by just hype, not adequate shareholder equity, which is volatile and unstable.\nThe dilution could cause a significant drop in share price if there isn't enough hype to offset it.\nTrump is a serial grifter who's failed at many businesses in the past and screwed over countless customers, investors, suppliers and more.\nSPACs have had a terrible track record in recent years, espeically those with poor fundamantals.\nSPACs are a cheap way to go to market, with the shareholders bearing the cost of this.\nTMTG has no path to profitability in the forseable future. It has not provided any updated business plans, future growth estimates, guidance or updated revenue projections.\nThe other proposed ventures (news network, streaming service) are extremely expensive to get going, we're talking hundreds of millions, even billions of dollars just to get off the ground. As i'll explain later, TMTG could have gained the cash to do this through the merger, but unwound it, making these ventures completely unfeasible with the cash DJT will get in this merger.\n\nRight lets get into the details.\nTruth Social\nCurrently, Truth Social is the only revenue stream that TMTG has. I don't know if you've been on there at all but it's basically a hive-mind echo chamber of Trump worship.\nThere's basically 3 types of users:\n\nMAGA cult\nBots shilling ED pills and fake gold coins.\nA small number of anti-Trump trolls, posting on every truth Trump does.\n\nI am of the opinion that Truth Social is a completely flawed concept. The concept is that Trump is trying to make a social media network, or \"big tent\", that will be a town-square that is used by everyone - Republicans, Democrats, independents, everyone.\nIn reality, Truth Social is a social media network hashed together from open source code to spread one-sided propaganda of a presidential candidate. Right off the bat it's a one-sided Trumpfest, and does not make any effort to include anyone other than MAGA.\nIf Hillary Clinton made a social media network, do you think MAGA would join it? They absolutely wouldn't and this question just highlights their flawed thinking.\nYou can say what you want about the one-sided nature that the legacy social media networks like Twitter became, but they weren't set up by a political candidate solely to give them a soapbox.\nThere's also nearly no unique IP behind Truth Social. It's an open-source platform with no unique features. Other than (currently) the only way to hear Trump's thoughts as he takes a shit, it's worthless. It doesn't even live up to it's \"free speech\" claims, as they regularly ban people for arbitrary reasons.\nFundamentals\nUnsurprisingly, the fundamentals of this company are absolute dogshit. This company makes barely any revenue, and has losses in the tens of millions. I can't see how this is going to get any better after merger, and they'll have an $18m SEC fine to pay.\nFrom the balance sheet from the latest revision of the S4 in February:\nFor the 9 months ended September 30 2023, TMTG made about $3.2m, with an operating loss on that is about $10m.\nTMTG claimed that in it's current financial year it projects to make about $17m in revenue, although I can't see how this projection wold be accurate. There's not been any meaningful uptick in users on Truth Social, major advertisers still avoid advertising there, and the other alleged revenue streams that they proposed early on (like a news network and streaming competitor) haven't come to fruition.\nThere's barely any cash backing shares of DJT\nThe shareholder equity of DJT after the merger will be painfully low. After the merger completes, DJT will have access to the money in the trust. This money is essentially the money that DWAC sold the original DWAC shares for when it initially entered the market before it found an acquisition target (TMTG) - about 30m shares at $10/share - so the trust has approximately $300 million in it.\nAfter the merger, DJT will have to pay an $18m fine to the SEC as a result of the investigation which concluded last year.\nIgnore the current market value of DWAC shares for a moment. Let's look at how much cash is actually backing each share. Doing a rudimentary calculation (because we don't know exactly how much money DJT will actually get from the trust, or the in-depth liabilities TMTG has): Lets say we take the full value of the $300m trust, minus the SEC fine, and the actual cash backing each share of DJT will be approximately $2.08 per share. This value could be even lower, as legal fees and other operational expenses (like DWAC expenses, and potentially costs of their lawsuits) need to be subtracted from the trust on merger before the cash is released to DJT.\nThis low cash backing for each share is very low, it's even very low for a SPAC. In the last four years, the average cash backing per share after merge of all SPACs was about $6.67.\nNormally, SPACs obtain PIPE (Private Equity in Public Entity) investment during the merger process to offset low cash per share after merge. They specifically do this to ensure the SPAC can meet its operational obligations, and pay all the required costs to bring the merger to market.\nDWAC did have a $1.3b PIPE deal set up. This would have given the company an absolute shit ton of money, enough to fund operations for years, and fuel expansion and growth. It would have meant that each share of DJT would have been worth approximately $11.80 - pretty solid cash backing for a SPAC.\nHowever, they completely unwound this PIPE investment. My guess is because they didn't want the extreme dilution that the PIPE would have caused. The PIPE shares were not under lockup, and PIPE investors could have sold immediately on market open after the merger, destroying the share price. They were given a good deal on the shares (it was a percentage below current market value), so likely would have sold for an immediate profit. Remember this part because it works into my regarded theory later on. Spoiler alert: They weren't protecting the retail shareholders by doing this.\nOwnership and dilution - what about the 1 billion shares?\nCurrently, DWAC is mostly owned by retail. These retail shareholders are somewhat unlike \"normal\" retail shareholders in that they are insanely dedicated. Many of the estimated 400,000 retail shareholders in this will not sell for any reason. Trump could literally dump shit in their faces and they'd probably take it and hold their shares. You could say that this retail holding is stronger than in the average company\nAfter the merger this will all change.\nCurrently the float of DWAC is about 30m shares.\nAfter the merger, the DJT float will swell to about 135m shares. The majority of these shares will be owned by Trump, currently under lockup for 6 months (more on this later).\nThere's been lots of talk about 1 billion shares being dumped into the float after merger. This has even been widely circulated in the press, but it's incorrect.\nDWAC have authorised 1 billion shares, it hasn't issued them. This means that in the future, DJT could potentially issue up to 1 billion more shares without having to conduct a shareholder vote or amend the company charter. It's like 1 billion reserve shares sat there if they need it.\nIt's actually a pretty common thing to do with IPOs and SPACs, many companies authorise shares to be issued later on to raise funds etc.\nIn any case, if they did issue more shares from this 1 billion amount, it wouldn't be until way after the merger.\nThere will, however, be significant dilution on merge. On business completion, up to 8,369,509 shares will be dumped into the float, given to holders of TMTG convertible notes. These shares will not be locked up like other insider shares, and can be sold immediately after merge. The holders of these notes will likely do this because they'll immediately realise a 400%+ gain. This is significant dilution, and could cause a huge drop in share price, unless insane Trump mania causes a hype rally to offset it. Much of the rest of the float is potentially (foreshadowing here) locked up, but this 8m share dump is significant.\nTrump hype\nThe hype surrounding trump is real. We've seen it many times before with DWAC - the insane rally to $175/share was surreal. It's plummet after was equally unreal.\nThe hype has the potential to offset everything - shitty fundamentals, insane dilution and more. It's the reason DWAC has traded so far away from reality in terms of an accurate valuation.\nI'm sure you all saw this post about the hype, that led to you all pumping up the price of the OP's contracts by like 800% before he sold most of them:\nhttps://www.reddit.com/r/wallstreetbets/comments/1bikpfj/these_calls_could_be_500_baggers_turn_1000_into/\nThe first takeaway from the above DD is that the hype is fucking insane, and supersedes everything, can cause the share price to rocket to the moon regardless of anything else.\nI agree with this. It's possible that there will be a huge buying demand to offset the dilution on merge. DJT could rally to the fucking moon.\nThe other is the theory that Trump will shill DJT and all his MAGA cult will all rush to buy in.\nThis theory i'm not convinced on. Much of his cult have no idea how to trade shares, many of them are braindead and can barely read. And if you think that they'd buy shares anyway, think about this:\nTrump has literally been on-stage at rallies in front of tens of thousands of his most die-hard supporters, and directly shilled Truth Social to them and they still haven't rushed to join. And Truth Social is a zero-barrier, free to use social media network specifically set up for them.\nI personally don't think we'll see millions of MAGA pouring into the market to buy DJT. Any MAGA who already know how to trade will be holding shares of DWAC already.\n​\nRegarded Trump selling theory - now with updates!\nNow it's time for the juicy stuff - the regarded speculative theory on Trump selling shares.\nDisclaimer: This is a regarded theory that probably won't happen, obviously i'm jumping to conclusions not necessarily found in hard evidence. If it does happen, though, I expect to be awarded a flair from the mods.\nIt's widely understood that Trump has a lockup on his shares for six months after the merger.\nThere is, however, a clause that undermines this.\nIn the latest revision of the S4, filed in February, on page 42, it reads:\n\nLock-Up. Unless waived by Digital World prior to the Closing, key stockholders of TMTG (including its management team) agreed to be subject to a six-month lockup in respect of their Digital World common stock, subject to certain customary exceptions, which would provide important stability to the leadership and governance of TMTG.\n\nThis means that, at any time before the merger closes, DWAC could waive Trump's lockup for some or all of his shares. Further to this, they could do it before it was disclosed publicly. In addition to this, Trump could sell shares for several days before DJT issued it's first 8K approximately 4 days after the merger.\nAs mentioned in my previous comments, I theorise that Trump could potentially dump some or maybe even all of his shares, potentially even destroying the company and allowing him to walk away with billions. He could then just go back to X to continue to be able to reach an audience far bigger than on TS.\nRemember when Trump met with Elon earlier this month, and everyone thought it was to do with Elon donating to Trump's campaign? Wrong. I theorise that they were doing a mutually-beneficial deal:\nElon agrees to ensure Trump never gets banned from X under any circumstances, ensuring he always has a soapbox.\nTrump agrees to return to X, giving Elon a huge bump in viewers.\nTrump dumps a load of his shares, pays his legal bills, makes a shit ton of money, gets a much bigger audience on X compared to Truth Social. It's a win win for both of them.\nAdditionally, I theorise that DWAC unwound the PIPE deal not for retail shareholder benefit, but to avoid Trump's shares from dropping in value so he could sell them at a higher price after merge. DWAC never issued a reason publicly as to why they unwound the PIPE. Unwinding the PIPE is seriously detrimental to the core of the business itself. It means significantly less cash to fund operations for a company that makes yearly losses in the tens of millions with no path to profitability.\nThe company will get under $300m of cash, rather than nearly $1.6bn it would have gotten with the PIPE deal + initial $300m share offering by DWAC. I'm yet to hear a reasonable explination as to why DWAC would unwind the PIPE.\nThe counters to the above tin-foil hat theory are:\n\"But Trump wouldn't need to sell, he could just borrow against his shares\"\nI'm not convinced about this for several reasons. Firstly, what sane lender is going to lend up shares that are under lockup for 6 months. They wouldn't be able to force Trump to sell his shares to repay the debt for up to 6 months if he defaulted on the loan. Secondly, TMTG is basically worthless, with barely any shareholder equity as described above...his shares aren't worth anything and have barely any cash backing them. Lenders will want solid fundamentals before lending against shares, they aren't gonna lend him half a billion $ on shares that are propped up on hype. He recently went to more than 30 surety companies recently to try and get a loan to pay his bond, and all of them turned him down. None of them would accept real estate or non-liquid assets as collateral.\nReuters is also reporting that he can't borrow against them due to previous terms he's agreed to:\n\nIt is unclear how and when these cases will be resolved. Even if the  deal gets completed next week, Trump will not be allowed to sell any of  his shares in the combined company for six months or borrow against them, based on terms he previously agreed.\n\nHe likely wouldn't be able to borrow against his shares even if his restriction was lifted.\n\"The board wouldn't allow it\"\nGo look at who the board of DJT is made up of: Trump, his sons and some of his closest yes-men. He basically controls the board. The DWAC board is made up of Trump yes-men as well. The fucking SEC investigation was specifically about how Trump colluded with DWAC without disclosing it publicly.\n\"Why would Trump destroy his own company?\"\nBecause said company is basically worthless. It has a high share price now based on hype, but it's going to take A LOT of work to get it generating revenue and profit. When the hype dies down, the share price could plummet, reducing hes unrealised net worth. If he loses the election it's all over, and if he hasn't sold by that point he'd lose BILLIONS. Institutional investors won't be touching this, so there won't be a solid foundation of ownership.\nTrump looks out for himself, and he's backed into a corner.\n\"But he's screwing over his base\"\nObviously there's a risk here, in that dumping his shares on his cult could cause a significant backlash, and he needs every vote he can get going into an election. However current DWAC shareholders are a tiny percentage of his base. If he dumped his shares on them, the majority of his base probably wouldn't even know about it. I'm not even convinced they'd turn on him either, they are literally in a cult. Remember when he said this back in 2016: \"I could stand in the middle of Fifth Avenue and shoot somebody, and I wouldn't lose any voters, OK?\". Still rings true today.\nTrump is desperate. NY is about to start seizing his assets, potentially within days. I can't imagine him choosing TMTG over Trump Tower for example, especially when he could potentially liquidate his entire holding of TMTG for an immediate gain of several billion cash.\nWhat's going to happen after merger?\nHonestly...who fucking knows. It could absolutely shit the bed due to dilution even if Trump doesn't sell shares.\nOr the hype of Trump could propel the share price into the stratosphere.\nEDIT: Forgot to add in the next step which will be the ticker changing from DWAC to DJT. The earliest this could happen is Monday. However an actual date hasn't been announced yet, so it could be Tuesday or Wednesday, or even later towards the end of the week.\nI could, and probably will be, wrong about all of this. Be sensible and don't trade this merger.\nHave fun regards.\n​\n",
            "gallery": []
        }
    },
    {
        "title": "Soundhound",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blxrq7/soundhound/",
        "nr_comments": 128,
        "upvotes": "139",
        "content": {
            "text": "I am fully invested at 8.11 cost basis with a total of 13000 shares.  Not worried by any means. If you play the stock market you always know that there are going to be ups and downs.  \nCompanies such as Soun that start to gain momentum especially this early in the ai boom will always lose traction due to short sellers that lose large amounts of money when things aren’t going their way. \nThis is why last week short selling bombarded the news so that the bears could make back the money they lost.  It’s a push and pull sort of thing.  On top of making their money back they are pushing the stock to its lowest point to then hop on the train as it starts to go back up to make even more money. \nReports of the ceo and coo selling shares was made to satisfy tax withholding obligations related to the vesting of restricted stock units. Of course they don’t mention this when they put out these reports because this helps them short the stock even more. \nIf you’re a day trader trying to make money obviously this may have threw you for a loop and the panic selling began.  \nHere is the proof in the pudding that I am fully invested and am not worried one bit.  If and when it goes down more I would encourage more people to buy if they already haven’t.  \nIt’s a good company and it will have a great earnings in may.  Be patient my friends. Don’t let the bears get to you. It’s all a part of the game they play. \n",
            "gallery": [
                "https://i.redd.it/llmv67h0d4qc1.jpeg"
            ]
        }
    },
    {
        "title": "APPLE AI/TECH GAME PLAN",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blxqdt/apple_aitech_game_plan/",
        "nr_comments": 58,
        "upvotes": "36",
        "content": {
            "text": "Hi, I want to know what you guys think about this idea on Apple. Let me know. \nApple has become one of the most successful companies of all time. They were the innovators of the past but and not really pushing the boundaries like NVDIA. This is a good thing for Apple and what I believe to be their plan. \n\nMonopoly’s run shit in America. companies that have established themselves as economic powerhouses continue to take over and consume industries. It’s possible that Apple could be waiting to buy their way into the AI/TECH boom instead of trying to innovate further. \nAPPLE has a massive cash pile and it’s been  growing just as soon as the AI/TECH boom started. This allows Apple to have options when it comes to their next move in the industry.\nGrowing cash pile isn’t good for now. From what I’ve see a growing cash pile means the stock for Apple has underperformed. But as soon as we see Apple start to put that money to use which we have not seen yet it just allows investors stock up on shares. \nApple could simply buy their way into the industry and become a top dog again because they have enough money and resources to either buy a company that already has experience with the new age of tech. Or Apple could start to dump money into something new and impactful since they already have more than enough capital and resources to pull it off.\n\nWhat’s my plan?\nI plan on waiting for that cash pile to keep stacking high and as soon as I see significant decreases I will dump money into shares and wait a year or buy leaps.\n",
            "gallery": []
        }
    },
    {
        "title": "One wrong move derails everything",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blwcdg/one_wrong_move_derails_everything/",
        "nr_comments": 27,
        "upvotes": "50",
        "content": {
            "text": "I am green far more than red. But I have a bad tendency to destroy my account averaging down on  0dte Fridays. I just can’t help it. If I were to trace and remove these Friday blowups from my p/l the difference would make me sick to my stomach I’m sure.  I’m at the point where I need to fix my psychology or quit.\n",
            "gallery": [
                "https://www.reddit.com/gallery/1blwcdg"
            ]
        }
    },
    {
        "title": "-$225k for the year; do I win any prizes?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blw258/225k_for_the_year_do_i_win_any_prizes/",
        "nr_comments": 244,
        "upvotes": "658",
        "content": {
            "text": "Part of the healing process is admitting this loss. Chased some sqqq way early in the bull run; lost about $150k there. Parleyed into day trading, was doing alright with it but started to get greedy and those $1k losses turned into $20k because “of course it will turn around” don’t be me, dont gamble. Im all in indexes now… guaranteeing a full market crash in the next 1-2 months \n",
            "gallery": [
                "https://i.redd.it/ut3zqic404qc1.jpeg"
            ]
        }
    },
    {
        "title": "Thoughts on $MTCH (online dating)?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blvl25/thoughts_on_mtch_online_dating/",
        "nr_comments": 36,
        "upvotes": "2",
        "content": {
            "text": "It appears to have bottomed.\nHedge funds have gotten in recently.\nTheir cash flow looks good.\nAnd just from a common sense perspective and a personal perspective I personally was a previous paid member because not only am I not a big bar or club guy but I think people are tired of spending hundreds of dollars on a night out to barely meet anyone that's half decent. For 20 bucks a month I can sit on my couch and filter through the good and the bad much easier. \nOne thing that concerns me is I don't foresee there being any kind of catalysts to really move it quickly so it could just be a slow steady climb. \n",
            "gallery": []
        }
    },
    {
        "title": "RUSSELL 2000 Rally",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blvh87/russell_2000_rally/",
        "nr_comments": 174,
        "upvotes": "188",
        "content": {
            "text": "As the title suggested, the next big play is going to be small caps.\nApple is getting double penetrated sideways, by both the DoJ and European law makers. Tesla is eating shit because nobody in China wants their crap anymore. Fed JPoW was the biggest I don't give a single flying fuck about inflation dove I've ever seen, I mean the guy LEAKED February inflation figures and told us hey man fuck your puts. \nNormally after these massive run ups, equity flows should go into small caps. That's yet to happen, this week I'm looking for Russell2k entries while all you regards trade spy. NVDA holding up the entire SPY with their massive balls. \n",
            "gallery": []
        }
    },
    {
        "title": "Taiwan Semiconductor, the rise of the machines.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blv6c7/taiwan_semiconductor_the_rise_of_the_machines/",
        "nr_comments": 241,
        "upvotes": "510",
        "content": {
            "text": "The digital artificial intelligence age is upon us. Why make food when you can create employees that run on electricity, and never sleep. That's the real catch with recent inflation, it has been in food. They never raised the price of food before, not for things like rice and beans, not anything like now. Food has always been subsidized for a cheap labor force. A big Mac was five dollars for at least the last 20 years in the Midwest. Not only will the masses not have jobs, basic necessities will skyrocket. Corporations don't need us anymore. \nIf you can't beat em, invest accordingly.    \nhttps://preview.redd.it/fok1eeq5t3qc1.png?width=3130&format=png&auto=webp&s=83f84f5762a6360b8858d0114636a757d93c29ae\n",
            "gallery": []
        }
    },
    {
        "title": "Was Josh Brown Right or Wrong about Nvidia? 😂",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bluikl/was_josh_brown_right_or_wrong_about_nvidia/",
        "nr_comments": 19,
        "upvotes": "0",
        "content": {
            "text": "Does anyone remember this beautiful moment? First, let me be clear. I love The Compound and Friends Podcast. So much so that I started a Reddit community. However, I have to be completely honest about what I witnessed in February. \nDuring the early stages of Nvidia’s bull run, Josh came out on CNBC and said he trimmed his position by 20%. I was shocked! I thought to myself, this thing hasn’t even warmed up yet. Looking back, I think I made the right move to hold….BUT, alternatively, does anyone think Josh was right?  \nWhat say the people? \nhttps://www.reddit.com/r/TheCompoundandFriends/s/esgTBnnUS2\nhttps://youtu.be/wthkRbzAZfY?si=N3SE9nKtoAzSMWLw\n",
            "gallery": []
        }
    },
    {
        "title": "Airbus wins jet orders from two Asian customers of rival Boeing",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blsgit/airbus_wins_jet_orders_from_two_asian_customers/",
        "nr_comments": 61,
        "upvotes": "763",
        "content": {
            "text": null,
            "gallery": [
                "https://www.reuters.com/business/aerospace-defense/jal-plans-buy-42-planes-with-catalogue-price-124-bln-2024-03-21/"
            ]
        }
    },
    {
        "title": "SPR yolo - BA may buy SPR this weekend! I need it to happen",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blqlm4/spr_yolo_ba_may_buy_spr_this_weekend_i_need_it_to/",
        "nr_comments": 13,
        "upvotes": "1",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/obquv5qsq2qc1.jpeg"
            ]
        }
    }
]