[
    {
        "title": "The market has officially entered uncharted territory where there is no basis for predictions.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bn4ww9/the_market_has_officially_entered_uncharted/",
        "nr_comments": 36,
        "upvotes": "•",
        "content": {
            "text": "​\nhttps://preview.redd.it/avtexom4peqc1.png?width=582&format=png&auto=webp&s=3783745c2e4ec89c167f75583259c8261499de12\n​\n​\n​\n",
            "gallery": []
        }
    },
    {
        "title": "I’m going to delete my brokerage app come back in one month to sell.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bn3avz/im_going_to_delete_my_brokerage_app_come_back_in/",
        "nr_comments": 201,
        "upvotes": "275",
        "content": {
            "text": "Deleting app coming back in one month to sell we will see how that will go. April 24th. Mark it. \nFor the banking sectors will collapse, the overall debt is too much and too little money there will be a problem with lack of cash on hand and SPY will have its greatest correction ever. \n",
            "gallery": [
                "https://i.redd.it/j0p2kbbaaeqc1.jpeg"
            ]
        }
    },
    {
        "title": "3 \"Myths\" About Nvidia Stock",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bn2qeh/3_myths_about_nvidia_stock/",
        "nr_comments": 36,
        "upvotes": "33",
        "content": {
            "text": "\nNvidia's Comparison to Cisco in 2000: \n\nNvidia is often compared to Cisco Systems during the dot-com bubble, both being pivotal players in their respective industries. However, Nvidia's advantages, including its invention of the GPU and development of the CUDA platform, make it a stronger entity than Cisco was at the time. Nvidia's rapid growth and expanding margins further differentiate it from Cisco's performance during the dot-com boom.\n\nCompetition in AI Won't Diminish Nvidia's Leadership: \n\nDespite emerging competition in AI GPU technology, Nvidia's comprehensive ecosystem, featuring assets like CUDA and Superchips, sets it apart. While competitors may affect pricing, Nvidia continues to explore new markets, such as AI PC chips and edge computing, maintaining its competitive edge and potential for growth.\n\nNvidia's Valuation Isn't Overstretched: \n\nSome argue that Nvidia's stock is overvalued, akin to a bubble. However, the company's strong fundamentals, including significant profit growth and reasonable valuation metrics, suggest otherwise. With expected growth and competitive advantages, Nvidia's current valuation appears reasonable and less prone to a sudden collapse.\nThis post  is basically a simplified version of an article found on yahoo finance. Source is below if you'd like to read a more in depth version.\nhttps://finance.yahoo.com/news/3-dangerous-myths-nvidia-stock-114500679.html\n",
            "gallery": []
        }
    },
    {
        "title": "China's Minister of Commerce Wang Wentao met with AMD CEO Lisa Su on Sunday. Meanwhile, China Blocks the Use of AMD CPU",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bn2kuz/chinas_minister_of_commerce_wang_wentao_met_with/",
        "nr_comments": 12,
        "upvotes": "46",
        "content": {
            "text": "On March 24, Minister of Commerce Wang Wentao met with Chair and CEO of AMD Lisa Su. Meanwhile, China government blocks the use of AMD hardware in all governmental PC, laptop, datacenter. On one hand, they calling for foreign investments and showing their openness to the world; on the other hand, they are blocking your products.\n​\nWondering how Lisa feels been backstabbed \nGlobal Times on X: \"China's Minister of Commerce Wang Wentao met with AMD CEO Lisa Su on Sunday. The two sides discussed the China-US business and trade relationship, as well as AMD's business development in the Chinese market. Wang wished for the US to work with China in providing clear safety… https://t.co/jwmRxLJNrK\" / X (twitter.com)\n​\nhttps://preview.redd.it/8b38htsp3eqc1.png?width=700&format=png&auto=webp&s=2a400c87016bacdb2d915c937b8ec12215fb4012\n",
            "gallery": []
        }
    },
    {
        "title": "Rivian discussion. Can I hear your opinion?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bn1ahe/rivian_discussion_can_i_hear_your_opinion/",
        "nr_comments": 245,
        "upvotes": "68",
        "content": {
            "text": "5 facts = rivn go up? \n1) The percentage of purchased vehicles that are electric have been rising by about 33% per year. \nRight now we are at about 8.5%. By 2026 it should be around 16%. By 2040 it should be around 90%. (Look at norway as an exampleof how it can be even faster)\nhttps://images.app.goo.gl/7zmmZHZXAV8fDotT9\n2) Teslas' market share of EVs has gone from 100% in 2013 to 79% in 2020 65% in 2023 and 55% in 2024. According to these numbers and various other factors that I will not put into the tldr, Teslas ev market share with real competition is about 20%. (Look at China as an example)\nhttps://images.app.goo.gl/kVgqx3BaS74aihTP7\n3) Rivian sold the most vehicles in the only class that they sold vehicles in (above $70,000). What happens when they sell the same class as tesla? \nhttps://m.investing.com/news/stock-market-news/earnings-call-rivian-outlines-efficiency-and-production-plans-as-r1s-becomes-the-topselling-ev-in-us-93CH-3311403\n4) Consumir reports show Rivian had the highest customer satisfaction ratings and the highest customer loyalty of any EV brand.\nhttps://images.app.goo.gl/Srxi2VjfN9Nt2Qjx9\nWhat's everyone's thoughts?\n",
            "gallery": []
        }
    },
    {
        "title": "First of Many Missteps to Come From TTWO - Stock Will Suck Ass",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bn12ga/first_of_many_missteps_to_come_from_ttwo_stock/",
        "nr_comments": 47,
        "upvotes": "206",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/jgk4pq9xqdqc1.jpeg"
            ]
        }
    },
    {
        "title": "WSB philosophy",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmyfml/wsb_philosophy/",
        "nr_comments": 77,
        "upvotes": "1299",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/l2mz3ye46dqc1.jpeg"
            ]
        }
    },
    {
        "title": "ADM goes up",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmya5k/adm_goes_up/",
        "nr_comments": 16,
        "upvotes": "8",
        "content": {
            "text": "Just added $2k more to my position on Friday\nNo reason for it to stop until the next earnings. Overblown investigation showed no material effect on the balance sheets. Interim CFO getting stock price incentive compensation only if he stays for a successor.\n$70/share\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bmya5k"
            ]
        }
    },
    {
        "title": "With China crap, is TSM fucked?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmy2dx/with_china_crap_is_tsm_fucked/",
        "nr_comments": 110,
        "upvotes": "0",
        "content": {
            "text": "I still have calls but I’m curious what others thoughts are.   To me this can only hurt their stock price.     Maybe the US comes to the rescue…. I don’t know. \n",
            "gallery": []
        }
    },
    {
        "title": "Went to Meiji Jingu in Tokyo yesterday and put my wish on the wall. Don’t thank me regards go buy some more NVDA",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmwzen/went_to_meiji_jingu_in_tokyo_yesterday_and_put_my/",
        "nr_comments": 16,
        "upvotes": "67",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/t6qgq5tavcqc1.jpeg"
            ]
        }
    },
    {
        "title": "I may not have many brain wrinkles, but I see a pattern here",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmwrc4/i_may_not_have_many_brain_wrinkles_but_i_see_a/",
        "nr_comments": 24,
        "upvotes": "41",
        "content": {
            "text": "Chart should be self explanatory. Ticks are daily. Charts go back up to 1yr. Both have consistently had short percent of float in the range of 35-60% during this time period. I may be a degen but I kind of love this play. Even if you torture animals for fun, I think we can make some money here. Following the CVNA trajectory tho, this isn't a \"buy weekly calls\" sort of situation. For BYND, I think we buy shares and hold for a few months. I know, I too hate having to hold for a few months just to 3x, but I think it'll be fun to actually buy and hold for once.\n​\nhttps://preview.redd.it/ugugnwsctcqc1.jpg?width=790&format=pjpg&auto=webp&s=a27737decbaff98b7a1642704a18925c3c31a15f\n",
            "gallery": []
        }
    },
    {
        "title": "$AMD vs $NVDA: A Comparative Analysis for 2024",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmwmjf/amd_vs_nvda_a_comparative_analysis_for_2024/",
        "nr_comments": 40,
        "upvotes": "131",
        "content": {
            "text": "Let's dive in...\nFinancial Data\nNvidia is projected to achieve explosive revenue growth in fiscal 2024 of 126% to $58.1 billion. AMD analysts model an acceleration to 21.9% growth in 2024 to $30.5 billion.\nAnalyst Opinions\nNvidia's software moat around CUDA is viewed as a key competitive advantage that will make it difficult for rivals to displace Nvidia's leadership position. For AMD, analysts are optimistic about continued share gains in server CPUs against Intel, and expect AMD to emerge as the clear #2 player in data center GPUs behind Nvidia.\nRisks and Uncertainty\nIf enterprise adoption of AI is slower than expected or if hyper scalers shift workloads to in-house chips, it would impact growth estimates for AMD and Nvidia. Geopolitical tensions around AI and potential export restrictions are another risk factor.\nEarnings and Profit Drivers\nAnalysts model Nvidia's GAAP operating margins can reach 64% by fiscal 2027. AMD is also expected to expand margins, with a long-term target of 35% adjusted operating margins.\nRead the full article here:\nhttps://www.nasdaq.com/articles/amd-vs-nvidia-a-comparative-analysis-for-2024\n",
            "gallery": []
        }
    },
    {
        "title": "Why I am taking QQQ calls on Monday",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmvxpq/why_i_am_taking_qqq_calls_on_monday/",
        "nr_comments": 95,
        "upvotes": "87",
        "content": {
            "text": "March: In like a Lion, out like a Lamb...\nThe start of this month was quite unsettling with the bombardment of catalysts which included CPI, PPI and FOMC. With those headwinds behind us, I believe March will wrap up sweet for the bulls. Seasonality wise next week is one of the best weeks of the year for QQQ. I know seasonality to some can be BS but in a bull market, seasonality is a fair metric to CALIBRATE future predictions. \nLast week we got a boost from FOMC, pushing the Qs from ~445 to ~447. Honestly a small move for such a substantial FOMC catalyst. I think there is more in the tank for this week and seasonality suggests so. (Note: this upcoming bullish QQQ week can be credited to MSFT for also having one of its best weeks on the horizon as well) \n----\nHopefully Monday is flat/closes red with Consumer Confidence uncertainty looming (data is released on Tues), no matter the result of CC I think we rally hard tues into the remainder of the week to stay on par with QQQ's bullish seasonality. \n\nTake weekly QQQ 445 strike calls + QQQ weekly 447 calls \nOptional: MSFT 415 strike, May 17 calls (I already own one but plan on adding another if Monday is red) \n\nLMK your thoughts, seasonality has been one of the best metrics for me so far (Cashed on ANET last week which has 70% + in March) Lets ride fellas! \n​\nhttps://preview.redd.it/cs8jzmve4bqc1.png?width=2892&format=png&auto=webp&s=ffe91fecb43f18395c79be20e207a1c5b5150511\nhttps://preview.redd.it/v0hc643c4bqc1.png?width=2894&format=png&auto=webp&s=c7aef8f78dafbce6392a8283db7b5432e0c1cc24\nhttps://preview.redd.it/7cv4csgancqc1.png?width=1170&format=png&auto=webp&s=006fac606b35edd16168e3e140ad1888864bcc6d\n",
            "gallery": []
        }
    },
    {
        "title": "Is anyone looking at $VRT?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmvul5/is_anyone_looking_at_vrt/",
        "nr_comments": 135,
        "upvotes": "233",
        "content": {
            "text": "The company is called Vertiv holdings. They make all the essential infrastructure for the buildings that physical house the Nvidia AI brain, such as power supplies, cooling systems, racks and enclosures, switchgear, controls and monitoring systems. Pretty much all the guts inside of an Nvidia data center is made by them. \nTheir stock has been ripping for the past year. Anyone have any idea on smart way to invest in $VRT? They are a \"Solution Advisor: Consultant partner\" in Nvidia's partner network.\n",
            "gallery": [
                "https://i.redd.it/gp8pzbwxmcqc1.jpeg"
            ]
        }
    },
    {
        "title": "Reeks $HIMS 45k yolo",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmvc0c/reeks_hims_45k_yolo/",
        "nr_comments": 14,
        "upvotes": "35",
        "content": {
            "text": null,
            "gallery": [
                "https://www.reddit.com/gallery/1bmvc0c"
            ]
        }
    },
    {
        "title": "Bullish or bearish on $ASAN",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmv1yk/bullish_or_bearish_on_asan/",
        "nr_comments": 27,
        "upvotes": "2",
        "content": {
            "text": "I currently have a 2X leveraged 10,000$ position in asana inc. let me know your take on it\n",
            "gallery": [
                "https://i.redd.it/3cwqgx26hcqc1.jpeg"
            ]
        }
    },
    {
        "title": "What Are Your Moves Tomorrow, March 25, 2024",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmtvku/what_are_your_moves_tomorrow_march_25_2024/",
        "nr_comments": 5313,
        "upvotes": "587",
        "content": {
            "text": "View Post\n",
            "gallery": []
        }
    },
    {
        "title": "China pushing Huawei CPUs and banning AMD, Intel.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmslzd/china_pushing_huawei_cpus_and_banning_amd_intel/",
        "nr_comments": 313,
        "upvotes": "1587",
        "content": {
            "text": "TLDR - NVDA(GPU) will moon; AMD and Intel will dump. \nThe link above explains the Huawei results and why China needs to ban competition. \n",
            "gallery": [
                "https://www.techradar.com/pro/mysterious-huawei-cpu-test-results-emerge-online-and-youre-in-for-a-shock-if-true-the-improvements-mean-that-huawei-is-not-far-behind-amd-epyc-or-intel-xeon"
            ]
        }
    },
    {
        "title": "A run of the mill",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmqdpa/a_run_of_the_mill/",
        "nr_comments": 57,
        "upvotes": "200",
        "content": {
            "text": "We are moving along the red line, a run of the mill recovery.\n",
            "gallery": [
                "https://i.redd.it/3xlcv6vmibqc1.jpeg"
            ]
        }
    },
    {
        "title": "CVNA",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmmkf6/cvna/",
        "nr_comments": 60,
        "upvotes": "66",
        "content": {
            "text": "While we've recognized CVNA's trading behavior resembling that of an AI  stock, despite its $6B debt load, elevated P/E ratio, and record-high default rates for car loans, as well as it now stands as the 12th most shorted company in the market, at 32%. Nevertheless, it's crushing it. Me no understandee.\n​\nhttps://preview.redd.it/11hmripzoaqc1.png?width=1014&format=png&auto=webp&s=9e3e4b475300fa217a245dbcfe5d3ac716c7f8d6\n",
            "gallery": []
        }
    },
    {
        "title": "Alphabet BERS hate this one simple trick",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmkv1a/alphabet_bers_hate_this_one_simple_trick/",
        "nr_comments": 41,
        "upvotes": "0",
        "content": {
            "text": "Hi my fellow bol chads\nI'm a avid user of YouTube mobile and noticed in c. the last month that YouTube have changed their mobile ad format. Previously it was 'wait 5 seconds, then can skip both ads', now it's 'wait 5 seconds, skip the first ad, wait another 5 seconds, skip the second ad'.\nThis just blew my mind (not literally thankfully).\nJust think about it my friends. This small change has effectively increased YouTube's mobile ad revenue by 100%. 100% (in theory). Incredible. Mobile ad revenue is a big chunk of Alphabet's revenue, so IMO revenue might beat expectations.\nAlso they might announce more details about integrating AI into apple products, so another bullish reason for next earnings.\nObviously have to throw some meat to those hungry bears, so another thought is that this increase in mobile ad revenue is offset by a potential increase in ad blockers from YouTube's more aggressive ad policy. IDK, just speculation as it can't be measured externally.\nLet me know your thoughts\n:)\n",
            "gallery": []
        }
    },
    {
        "title": "China blocks use of Intel and AMD chips in government computers, FT reports By Reuters",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmkbn9/china_blocks_use_of_intel_and_amd_chips_in/",
        "nr_comments": 589,
        "upvotes": "3041",
        "content": {
            "text": null,
            "gallery": [
                "https://www.investing.com/news/stock-market-news/china-blocks-use-of-intel-and-amd-chips-in-government-computers-ft-reports-3350596"
            ]
        }
    },
    {
        "title": "$TSLA Bottom is here. YOLO time?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmesp5/tsla_bottom_is_here_yolo_time/",
        "nr_comments": 188,
        "upvotes": "93",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/xb1dzarbf8qc1.jpeg"
            ]
        }
    },
    {
        "title": "Which stock are you going to ride or die with at least for the next 5 years?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmdfbl/which_stock_are_you_going_to_ride_or_die_with_at/",
        "nr_comments": 2317,
        "upvotes": "951",
        "content": {
            "text": null,
            "gallery": []
        }
    },
    {
        "title": "What happened here?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmca5f/what_happened_here/",
        "nr_comments": 26,
        "upvotes": "31",
        "content": {
            "text": "Nuscale (SMR) blows a project in Utah.\n https://www.utilitydive.com/news/nuscale-uamps-project-small-modular-reactor-ramanasmr-/705717/\nWent so bad that that shareholders partake in a class action lawsuit\nhttps://www.google.com/amp/s/www.opb.org/article/2023/11/22/nuscale-nuclear-power-lawsuit/%3foutputType=amp\nStock has incredible fall. I buy up some because I like nuclear. Panicked at what looked like a 2 week pump and dump and sold. Looks like that was the case.\nWhat happened here?? Was this a pump and dump to get the price up to pre-crash prices so that stockholders could recoup their cash and tone down the lawsuit stuff? How does this even happen?\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bmca5f"
            ]
        }
    },
    {
        "title": "Should I keep it or sell it ? NVDA",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmbxzg/should_i_keep_it_or_sell_it_nvda/",
        "nr_comments": 83,
        "upvotes": "90",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/co82x512j7qc1.jpeg"
            ]
        }
    },
    {
        "title": "CEO of soon to be the most valuable company in the planet wants you to suffer",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmayld/ceo_of_soon_to_be_the_most_valuable_company_in/",
        "nr_comments": 496,
        "upvotes": "2684",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/hwbsjjvh97qc1.jpeg"
            ]
        }
    },
    {
        "title": "How to buy Ukrainian bonds in US/Canada? They currently pay about 38.10% per year.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bmarp7/how_to_buy_ukrainian_bonds_in_uscanada_they/",
        "nr_comments": 618,
        "upvotes": "3027",
        "content": {
            "text": "https://www.finanzen.net/anleihen/a2rtrp-ukraine-anleihe\n",
            "gallery": [
                "https://i.redd.it/d1n9wl8o77qc1.png"
            ]
        }
    },
    {
        "title": "Who put this up at the Meiji shrine in Tokyo",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm9d2w/who_put_this_up_at_the_meiji_shrine_in_tokyo/",
        "nr_comments": 294,
        "upvotes": "9965",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/3k54c3wnu6qc1.jpeg"
            ]
        }
    },
    {
        "title": "FTX: SBF’s lawyers slam DoJ’s “medieval” 50-year sentence recommendation",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bm909y/ftx_sbfs_lawyers_slam_dojs_medieval_50year/",
        "nr_comments": 81,
        "upvotes": "249",
        "content": {
            "text": null,
            "gallery": [
                "https://v.redd.it/ebktn54hr6qc1"
            ]
        }
    }
]