[
    {
        "title": "🤷🏼‍♂️DWAC short opportunity??🤷🏼‍♂️",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bljwsi/dwac_short_opportunity/",
        "nr_comments": 13,
        "upvotes": "•",
        "content": {
            "text": "This is to discuss the short opportunity of trumps new truth social listing. Not interested in discussing his politics or other actions in this one. It’s had me thinking about it for days on end and if nothing else, maybe sharing it will help me understand why I’m wrong…\nThat said, I want to state some trump facts about his prior years that are relevant.\n1. He managed to drag out the Atlantic city bankruptcy for many years. It first entered bankruptcy in 1990 and kept going until 2009 with trump. 2016 it shut doors properly.\n2. Over this time trump took about $75 million in todays dollars as wages for his 14 years with the company\n3. Trump doesn’t need to use truth social exclusively after July of this year and doesn’t have to inform the market until July that he’ll stop.\nNow truth social\nThe forecast 2022 November\n- 56 million users by 2024\n- 7.50 average revenue per user\nThat’s $420 million a year in revenue forecast for this year.\n- it was 226 million of revenue forecast for last year (2023)\nThis explains the current value as $420 million x an arbitrary Price earnings of 8 = $3.3 billion market cap.\nThe actual numbers\n-  active users of 607,000 (some estimates as high as 5 million)\n- revenue of $2 million last year (100% from a related party)\n-average revenue per user of $0.44 per user.\n- loss of $30 million in the last six months (mainly interest expenses of $22 million).\n- $12 mil in loans from a Russian associated to the Alex smirnov informant that appears to be a Russian agent (only mentioning as potential legal issue).\nThe merger gives the combined company cash reserve of about $250 million.\nAssuming losses of 30 million every six months or 60 million a year, the company has 4 years until definitive bankruptcy.\nThe future.\nLet’s consider all of the above.\nY’all know it’s not looking good from the above but what are the possibilities? From most to least optimistic below\n1. Truth social gets 80 million subscribers with arpu of $5.00. This would give it revenue of $400 million and profit of around $100 million per year assuming costs are similar pinterest.\n2. Same as above but trump gets extra wages ect to friends and takes a commission = $50 million a year in profit for shareholders\n3. Stagnation —> bankrupt in 4 years\n4. Stagnation + trump takes money for legal bills+friends —> bankrupt in 2 years\n5. Legal issues. The Russian loans and what appears to be a failure to update the market on the terrible state of the business could potentially enable shareholders who purchased DWAC to sue and take trump media cash/shares from current shareholders.\n6. Legal issues existing - there are legal issues existing with co founders that may stand to cause dilution of other shareholders pending their outcome.\n7. Trump stops using truth social as his primary account in July to keep his presidential dream alive and the share price tanks like a lead balloon.\nTo summarise. \nIn the best situation, DWAC grows 100 x in the next year and is possibly worth the current market capitalisation. \nMost likely, in 6-12 months, trump cashes out then stops using the app and any remaining shareholders get screwed. Similar to Atlantic city.\nThere are a range of other possibilities that all seem bad for DWAC shareholders.\nFor these reasons, my thesis is short sell DWAC now and cover in 6 months.\nWhat y’all think of the thesis and do you know a good way to short these shares? I.e. a broker like Robin Hood?\n",
            "gallery": [
                "https://www.sec.gov/Archives/edgar/data/1849635/000119312522150801/d226205ds4.htm"
            ]
        }
    },
    {
        "title": "LFG 🚀 I took out a 20k loan on my credit card and put it all in for Tuesday. Then I put all 50k in my Roth into it.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bljtrr/lfg_i_took_out_a_20k_loan_on_my_credit_card_and/",
        "nr_comments": 180,
        "upvotes": "•",
        "content": {
            "text": "All of my money (and 20 grand that is the bank’s) is in this play. (2,000 shares is my Individual account, 3,000 shares plus the calls are my Roth IRA). I have about 5k in my Roth remaining that is going into calls Monday. Either retiring comfortably or broke. Please destroy me in the comments.\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bljtrr"
            ]
        }
    },
    {
        "title": "7 minutes before close $50M NVDA calls were purchased",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bljp3b/7_minutes_before_close_50m_nvda_calls_were/",
        "nr_comments": 13,
        "upvotes": "•",
        "content": {
            "text": "https://preview.redd.it/b1h5611390qc1.jpg?width=680&format=pjpg&auto=webp&s=62787bb5739c7e05c010beb16ff7d40bc7e374d2\nApprox $50 million of $800 3/28 exp deep in the money calls were purchased 7 minutes before the market closed today 3/22.\nI wonder what next week has in store for Nvidia..\n*AND NO THIS IS NOT A HEDGE. NO ONE HEDGES A WEEK OUT BE SO FR PEOPLE... its probably just catching the pump to dump it lmao*\n",
            "gallery": []
        }
    },
    {
        "title": "YOLO ADVICE HELP",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bljee1/yolo_advice_help/",
        "nr_comments": 23,
        "upvotes": "•",
        "content": {
            "text": "I’m 17 years old and saved up about 19k in my Robin Hood I’m currently down abut 8 percent all time (3 years).  I want to put my whole portfolio on call options on TSLA but I’m scared of a recession happening within my experation date(I would do a 180 strike till August). Fuck buying shares or spreads I want to move out at 18 and I need to go big or go home. What would yall do with 19k.\n",
            "gallery": []
        }
    },
    {
        "title": "When wil RH liquidate Russian ADRs for customers still in limbo?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blj38e/when_wil_rh_liquidate_russian_adrs_for_customers/",
        "nr_comments": 17,
        "upvotes": "0",
        "content": {
            "text": "I held a few russian ADRs on RH (gazprom, MBT, NILSY) and ever since the ukraine war and RH halting their trading I haven't been able to do anything witb them. They have to even been liquodated. I tried surrendering them at the time but RH customer support was absolute garbage and were not helpful at all. Anyone else in the same boat? What happened to your holdings?\n",
            "gallery": []
        }
    },
    {
        "title": "Yolo'd $150k in my 401k into $RDDT",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blicei/yolod_150k_in_my_401k_into_rddt/",
        "nr_comments": 144,
        "upvotes": "108",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/gucz5c9h40qc1.png"
            ]
        }
    },
    {
        "title": "Due Diligence: Why Reddit $RDDT Is My Top Pick",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bli7h6/due_diligence_why_reddit_rddt_is_my_top_pick/",
        "nr_comments": 18,
        "upvotes": "0",
        "content": {
            "text": "My quick investment pitch for Reddit $RDDT stock.\nBusiness Model: Uniquely differentiated from Instagram and Snapchat, cannot be \"TikToked.\"\nStrong Balance Sheet: Over $1 billion in net cash.\nValuation: IPO pricing was too low, after 48% post-IPO jump, stock now trades at a 10x sales or around 9x EV/S. Mature profitable companies like Microsoft command 10x sales/ 30x earnings multiples. Reddit will eventually monetize. I expect 20% to 30% revenue growth - that should justify 20x sales multiple. \nHigh Growth ahead: ARPU is very low compared to $META $SNAP $PINS. User growth should be faster than all. Already signed $60m/yr licensing deal with $GOOGL, that locks in 7% growth already. 20% to 30% long term grower.\nUniqueness: lots of pr0n. No other stock is hosting pr0n. \nMeme Potential: IPO lockup next 6 months. \nPrice Target: $100 at 20x P/S, $500 if it memes.\nRisks: Reddit might not be able to monetize. Meta makes a copycat. \nBottomline: Buy for the value, stay for the memes.\n",
            "gallery": []
        }
    },
    {
        "title": "Reddit $RDDT Is The Next Meta: A Potential 100 Bagger",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bli0nw/reddit_rddt_is_the_next_meta_a_potential_100/",
        "nr_comments": 24,
        "upvotes": "0",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/br574bib10qc1.jpeg"
            ]
        }
    },
    {
        "title": "35k TSLA Puts",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bldj2x/35k_tsla_puts/",
        "nr_comments": 28,
        "upvotes": "18",
        "content": {
            "text": "Bought for April 19, after earnings. Will almost definitely sell before earnings announcement during the run down but I am sure they are going to get obliterated. \n",
            "gallery": [
                "https://i.redd.it/n1bcz61uzypc1.jpeg"
            ]
        }
    },
    {
        "title": "MRNA: Remember That Falling Knife? I Think It's Hit Bottom (And a RARE Adam and Eve Pattern is Forming on the Weekly Chart)",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blcr6l/mrna_remember_that_falling_knife_i_think_its_hit/",
        "nr_comments": 39,
        "upvotes": "3",
        "content": {
            "text": "Three months ago, I dared to tread where many portfolios went to bleed – calling a potential bottom on Moderna (MRNA)  https://www.reddit.com/r/wallstreetbets/comments/18llx12/buy_the_rumor_on_mrna/.\nThe \"Covid stock\" was a graveyard of failed bottom-fishing attempts... but I saw something different, just like I did with SQ (check out that successful call here) https://www.reddit.com/r/wallstreetbets/comments/17r7p3z/block_inc_sq_high_probability_technical_bullish/.\nThe Technicals Were Right (Again) – And This RARE Weekly Pattern is Emerging\nThose bullish signals I outlined back in November? They're evolving beautifully, and something even more compelling has emerged on the weekly chart: a classic Adam and Eve double bottom pattern. This isn't just any pattern – it's known for its power in signaling bullish reversals, and it's especially significant when it appears on a longer-term timeframe like a weekly chart.\n\nAdam's Dive (Nov 2023): That sharp drop formed the first bottom (Adam).\nEve's Softer Landing (Feb 2024): A rounder, gradual bottom (Eve) suggests buyers are stepping back in.\nThe Rarity Factor: Adam and Eve patterns don't show up every day, and their presence on a weekly chart makes this one even more significant.\nMomentum Divergence & More: The other signals (divergence, Heikin Ashi, money flow) are still backing this up.\n\nCrucial Breakout Needed:  For true confirmation, we need a decisive close above the high of $115.97 (from Jan 8th, 2024).\nWeekly MRNA Chart\nThe News Backs It Up\nRemember that Merck/Moderna skin cancer vaccine update? The market does – and it seems to love the Adam and Eve setup forming alongside this news. And while those declining COVID booster numbers sting for some, Moderna's superior efficacy and revolutionary technology shines brighter than ever.  Moreover, notable investors like Cathie Wood have stepped up their position in MRNA noted in an an article ironically titled, \"Is Cathie Wood Buying the Rumor?\" (Welcome to the party Cathie).\nMy Money's Where My Chart Is\nI've been building my MRNA position, and the technicals suggest it's not too late to join in. Let's be real, institutions aren't panicking –  which is usually a good sign for us contrarians.\nAs always, don't take my word for it...noted technical analyst Thomas Bulkowski has a lot to say about the Adam & Eve pattern here...https://thepatternsite.com/aedb.html\nChaikin Money Flow Increasing\n",
            "gallery": []
        }
    },
    {
        "title": "QQQ",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blc713/qqq/",
        "nr_comments": 34,
        "upvotes": "15",
        "content": {
            "text": "Who's with me ?! Holding on to these bad boys as close to expiration as I can- LOL\n",
            "gallery": [
                "https://i.redd.it/d3elcv4ppypc1.jpeg"
            ]
        }
    },
    {
        "title": "How cooked am I?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blc00d/how_cooked_am_i/",
        "nr_comments": 21,
        "upvotes": "3",
        "content": {
            "text": "I'm a regard. \n",
            "gallery": [
                "https://i.redd.it/wtw76wy7oypc1.jpeg"
            ]
        }
    },
    {
        "title": "Ralph Lauren ($RL) is a 10+ bagger",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blbrn6/ralph_lauren_rl_is_a_10_bagger/",
        "nr_comments": 34,
        "upvotes": "28",
        "content": {
            "text": "Consumer Discretionary and Retail stocks have shit the bed on earnings calls these last few months. That is DESPITE the fact that almost all of them have beat earnings in Q4 2023.\nThe problem is guidance.\nNKE went double down TWICE. First in December when they posted weak guidance. Then again just yesterday. They beat earnings estimates both times. They're down about 23% since their December earnings call. Again, despite beating earnings on both quarters.\nFL fell off a cliff, down 30% since their earnings (also weak guidance, but they also fucked up earnings).\nLULU RIP on weak guidance (down 16% since their call yesterday).\nConsumer confidence was high at the holiday season, but it's come back down to reality. January consumer spending shocked to the downside. February consumer spending was lower than expectations.\nJanuary CPI print was higher than expected.\nFebruary CPI was higher than expected.\nMarch CPI gonna be fucked. Look around, gas prices going up, war in the middle east, Red Sea shipping and insurance prices have gone up.\nConsumer confidence is fucked. People are sobering up to the reality that inflation is here to stay, even if JPow does a wink-wink, 3 rate cuts this year. If March CPI is fucked, that goes out the window too.\n--\n​\nNow, let's look at RL. Surely, it should be down given all of these macro concerns for consumer discretionary, the american consumer (as evidenced by LULU guidance with softening NA sales).\nNOPE. about 2% off the all time high (192) sitting at $197.60 (and that's after a 1.5% down day).\n​\nhttps://preview.redd.it/9r0dqm4tlypc1.png?width=1020&format=png&auto=webp&s=f1fb93229003a97d2ef26070a6589dede588a3f5\nThis is the MF'ing chart. It's up 28.47% YTD. It's trading like a tech AI stock. But it ain't.\nNotice that cliff at $170 to $140. If it falls, especially on bad earnings & guidance, it'll fall through that floor.\nEarnings is anticipated some time between May 21st and May 24th. Unfortunately the options for this ticker are monthly and quarterly (not weekly), so the May monthly options will be just short of the earnings date. I've got puts for June at $150.\nIgnore the P/L unrealized losses. I opened these today, at basically the stock's ATH. The reason it's marked down is because of the wide B/S spread at the end of the day. \n",
            "gallery": []
        }
    },
    {
        "title": "Am I a Regard?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1blazjm/am_i_a_regard/",
        "nr_comments": 10,
        "upvotes": "9",
        "content": {
            "text": "So, for some reason bitcoin is following me into my dreams and keeps saying me fuck you for not buying me at 15k.\nI am not that angry about it but I like looking at the chart. \nI mentioned a few times that behaving of bitcoin wonders me and stocks  following some of the strange behavior. So I kept looking.\nI want to know what you guys think of my regarded idea 💡 and if we are fucked? \nWe have 3 pics, no. 1 with 4 crowns was the first bitcoin jump, the pic with two crowns the second and the 3rd the one we had lately. So timeframes become shorter and we are just about to burst? \nTimeframes and support zones might change or am I wrong?\nPlease tell me how regarded I am.\n",
            "gallery": [
                "https://www.reddit.com/gallery/1blazjm"
            ]
        }
    },
    {
        "title": "Wall Street sees more upside in Nvidia stock after GTC event",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl9apz/wall_street_sees_more_upside_in_nvidia_stock/",
        "nr_comments": 55,
        "upvotes": "119",
        "content": {
            "text": "https://preview.redd.it/vuvewz3p3ypc1.png?width=1148&format=png&auto=webp&s=fa6578557bf34399e5b68eb15372ef33f1da75c0\nMost price targets have been raised to $1,000+ across all analysts. After today it doesn't seem unrealistic to think NVDA will hit $1,000 within the month.\nYahoo Finance video regarding the topic: https://www.youtube.com/watch?v=sZyyKt6b2eY\n",
            "gallery": []
        }
    },
    {
        "title": "Why Lululemon Shares Are Falling Today",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl962k/why_lululemon_shares_are_falling_today/",
        "nr_comments": 24,
        "upvotes": "3",
        "content": {
            "text": "Shares of athletic apparel and accessories retailer Lululemon (NASDAQ:LULU) fell 18.9% in the morning session after the company reported fourth-quarter results and provided full-year revenue and earnings guidance, which fell short of Wall Street's estimates. On the other hand, Lululemon slightly topped analysts' revenue and EPS expectations during the quarter. The company's growth was driven by a 12% increase in its same-store sales, with American stores growing 7% and international stores growing 44% on a constant currency basis. Overall, it was a weaker quarter for Lululemon.\nThe stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks.\nhttps://finance.yahoo.com/news/why-lululemon-lulu-shares-falling-192300560.html\n",
            "gallery": []
        }
    },
    {
        "title": "NVDA on track to hit $1000 next week",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl8w04/nvda_on_track_to_hit_1000_next_week/",
        "nr_comments": 48,
        "upvotes": "58",
        "content": {
            "text": "Here is my position. NVDA blew past resistance at $925 today all the way to $947. The largest point of resistance before $1000 is $950. If it can break out next week it will without a doubt hit $1000. The stock did 8% in the last week so it’s not going to take much to push past resistance. Not to mention over 80,000 short positions opened at $950 were liquidated today due to fear. The stock is full speed ahead at this point. Check the order book for yourself. \nThis is all just my opinion but I hope some of this could be insightful. It’s crazy how everyone is willing to pump some shitty stock like DWAC and not buy the dip on NVDA. Truly regarded! \n",
            "gallery": [
                "https://i.redd.it/7xz0fqr01ypc1.jpeg"
            ]
        }
    },
    {
        "title": "Bitcoin price data around halvings (time from halving until bull run)",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl8mq8/bitcoin_price_data_around_halvings_time_from/",
        "nr_comments": 20,
        "upvotes": "13",
        "content": {
            "text": "For the 2nd halving, which occurred on July 16th, 2016, it was approximately 284 days before BTC began its bull run. For the 3rd halving, which occurred on May 11th, 2020, it was approximately 161 days before BTC started its bull run (I keep saying \"approximately\" because it's subjective, I picked a date to mark the beginning of the bull run that looked right to me, others will have different opinions). This is a reduction in time between halvings and the beginning of a genuine bull run of 43.3%. If we were to see this occur again in 2024, that would mean that there will be 69.7 days between the halving and the beginning of a bull run, placing it around June 29th, 2024 (presuming the halving occurs on the estimated date of April 20th). Make of this what you will.\nNote: we didn't have ETFs, MSTR, and some of the other shit that we do now, when the previous halvings occurred. I don't know what that means, precisely. I would guess that it will reduce the space in between the halving and the next bull run even more, but I don't know that, obviously.\nEdit: I didn't bother with the 1st halving because that was so early on that almost nobody knew what bitcoin was, let alone bothered with it.\n",
            "gallery": []
        }
    },
    {
        "title": "Weekend Discussion Thread for March 22, 2024",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl8kj4/weekend_discussion_thread_for_march_22_2024/",
        "nr_comments": 3584,
        "upvotes": "87",
        "content": {
            "text": "View Post\n",
            "gallery": []
        }
    },
    {
        "title": "$AAPL YOLO",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl86ty/aapl_yolo/",
        "nr_comments": 35,
        "upvotes": "18",
        "content": {
            "text": "My biggest YOLO so far. Already shitting 🧱 \n",
            "gallery": [
                "https://i.redd.it/qt3u7kvvvxpc1.jpeg"
            ]
        }
    },
    {
        "title": "Lost $25K in a single day - 2021 meme stock roller-coaster revisited",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl6wgl/lost_25k_in_a_single_day_2021_meme_stock/",
        "nr_comments": 26,
        "upvotes": "53",
        "content": {
            "text": "Hey fellow degenerates,\nLet me take you back to a simpler time, Dec 2020 - Jan 2021, when I, a bright-eyed and bushy-tailed newbie, decided to dive headfirst into the murky waters of options trading. Armed with nothing but the Robinhood app and dreams of Lambos, I embarked on what can only be described as a financial roller-coaster.\nIn the span of a little over a month, I managed to execute 36 trades. My instruments of choice? Calls on LUCID, \"stock-that-shall-not-be-named\", and PMC. Yes, I was riding the meme stock wave, hoping to surf my way to untold riches. Spoiler alert: it didn't go as planned.\nHere's the breakdown:\n\nTotal Gains: $30,000\nTotal Losses: $50,000\n\nAs you can see below, I had a win rate of about 50%. Not too shabby for a rookie, right? Wrong. Because amidst these battles, there was one day, January 25th, that will forever be etched in my memory. \nOn that fateful day, I managed to lose $25,000 in a matter of minutes, as the short squeeze came to an abrupt end when Robinhood decided to halt options trading. This was equivalent of my 6 months pay at that time. And poof, just like that, it was gone! \nI literally had a GUH moment and I remember my hands trembling in disbelief that I was down $25,000 in less than 2 minutes . I don't play poker or gamble otherwise, so this shock was particularly severe and I did what any rational person would do - I deleted the Robinhood app and tried to erase the entire episode from my mind!\nhttps://preview.redd.it/uur971t0mxpc1.png?width=455&format=png&auto=webp&s=311803a1920eb8d4a5068d7ca2dee734f5ec90bb\nFor three long years, I avoided confronting the reality of what happened. But today, I mustered the courage to look back at my Robinhood history and reconcile with my past.\nWhy am I sharing this story on here, you ask? Because it's cathartic and today was the first day I'm seeing all these trades after 3 years of being away from robinhood. Now that I look back, I think had I not lost $25,000 on that day, I would have probably continued to make bigger and bigger bets until I finally lost it all. Typical gambler's fallacy. \nThe $25K lesson I learned was trite but very humbling - NEVER play with more than what you can afford to lose! Which also means YOLOs are out of the question. \n",
            "gallery": []
        }
    },
    {
        "title": "Tax Free Losses",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl6exk/tax_free_losses/",
        "nr_comments": 14,
        "upvotes": "62",
        "content": {
            "text": "COIN 245p 0DTES in Roth so the losses are tax free 👍🏽\n",
            "gallery": [
                "https://i.redd.it/lmie9ylxixpc1.jpeg"
            ]
        }
    },
    {
        "title": "NVDA calls 1.5k to 6k",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl5ym8/nvda_calls_15k_to_6k/",
        "nr_comments": 24,
        "upvotes": "73",
        "content": {
            "text": "Bought in at the dip right before close yesterday, 5 935c 3/22 and 1 930c 3/22. NVDA is king bubba\n",
            "gallery": [
                "https://i.redd.it/0ya4795nfxpc1.jpeg"
            ]
        }
    },
    {
        "title": "What the actual heck happened with LULU",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl5hn3/what_the_actual_heck_happened_with_lulu/",
        "nr_comments": 270,
        "upvotes": "576",
        "content": {
            "text": "We are in a market where a company like LULU that increased profits 400% YoY dumps -20% because it didn't outperform its massive outperformance. We're pricing everything like its Nvidia, so when a company merely does great (comparatively) and isn't 3x'ing every quarter the speculation deflates so quickly ON POSITIVE EARNINGS. When we are at the point where stock prices reflect speculation on exponential future growth, any indication of slow down IN GROWTH collapses a stock, thats how you know we are in a bubble. With an astronomical P/E in the 60's before today, 16% Sales Growth YoY isn't enough in this market. I think LULU is just a demonstration of what could happen to many other tickers that are pricing in decades of double digits growth when a company magically can't maintain that rate of growth. RIP to all your calls you regards and happy friday. PS Don't forget to go support your GF's favorite DJ this weekend.\n",
            "gallery": []
        }
    },
    {
        "title": "COIN: The next 50x play",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl5hbm/coin_the_next_50x_play/",
        "nr_comments": 42,
        "upvotes": "9",
        "content": {
            "text": "Alright boys. First, check out my username. I’ve been in crypto for a long time just to trade and have called every single BTC top. I’ve had puts on BTC since 73k (proof: https://www.reddit.com/r/BitcoinMarkets/s/ryWIFUSMWV). Check the downvotes. But you know what, this play doesn’t even rely on BTC. Heck it could go to 100-150k for all I care (it won’t) but one thing is for sure: \nCOIN is going down. Why? \n\nTheir customer service is absolute crap. They only just started phone support after many years and none of them can even speak English \nEvery single fast BTC move results in the exchange being shut down. This has been a problem on their exchange for many years with no fix in sight. Not a single other major crypto exchange (Binance/Bitmex/Deribit/etc) has this problem despite having more volume than Coinbase \nThe IV isn’t atrocious like it is on MSTR yet and not many shorts on the stock hence no ensuing squeeze. Most of you regards can actually afford it   \nBrian Armstrong’s wife has been cheating on him\nI have puts\n\nCOIN 150p end of July. The price tanking to below 100 will 50x these. I dare you to inverse me. Do it. \n",
            "gallery": []
        }
    },
    {
        "title": "$DWAC—Stop overthinking this shit regards! The REAL catalyst was not today...",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl5buu/dwacstop_overthinking_this_shit_regards_the_real/",
        "nr_comments": 475,
        "upvotes": "316",
        "content": {
            "text": "\"Oh, Trump will dump shares\" \"Oh, no he won't\" \"Oh it's down today, I'm bailing\" You are all overthinking and it's so dumb. Listen to me your Lisan Al-Gaib:\nThe CATALYST IS NOT SOME OBSCURE SHAREHOLDER MEETING. Do you think Trumps 6 million Truth Social followers know that the meeting took place today?\nThe catalyst is the ticker change to $DJT. For the first time, the world's best self-promoter will have his own stock and an army of people to tweet to!!! Look at how this dude tweets and how people eat it up:\nAs if he won't talk up $DJT\nWhy would he have tweeted about it or pushed it until it becomes \"his stock\"? It would have been stupid. Believe me, the average MAGA member is not thinking:\n\"Hmmm well the merger meeting of the SPAC $DWAC was today and I see that the lockup period is XYZ\"\nThey will be thinking come Monday:\n\"My savior and god emporer has a ticker and is tweeting about it. Me going to buy!\"\nDisc: I am an idiot not financial advice. DYODD. May buy or sell at any time. I am long DWAC and have a position. My analysis is not based on fundamentals, it's pure psychology.\n​\nhttps://preview.redd.it/3zie33tabxpc1.jpg?width=1284&format=pjpg&auto=webp&s=0c52167c600b76e34cdaac68faa8423731156fe9\n",
            "gallery": []
        }
    },
    {
        "title": "Balls Deep HIMS $15,800 - Long Dick Pills on the Dip",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl59kx/balls_deep_hims_15800_long_dick_pills_on_the_dip/",
        "nr_comments": 12,
        "upvotes": "16",
        "content": {
            "text": "WSB DD in profile\n",
            "gallery": [
                "https://i.redd.it/ouytxsjgaxpc1.jpeg"
            ]
        }
    },
    {
        "title": "$RDDT Options Open On Monday! (4 Images + Desc) I'm Gonna Short!",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl58w4/rddt_options_open_on_monday_4_images_desc_im/",
        "nr_comments": 31,
        "upvotes": "19",
        "content": {
            "text": "A lot of IPOs we see that have a startlingly good opening day generally see falloff not even shortly after, I imagine it is because the investors that buy see that 20-50% gain and immediately want to sell. Once options for $RDDT start trading on Monday, you better believe I'm going to be looking into long term short positions and puts!\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bl58w4"
            ]
        }
    },
    {
        "title": "Unrealized to Realized?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl4xd5/unrealized_to_realized/",
        "nr_comments": 19,
        "upvotes": "49",
        "content": {
            "text": "I have these NVDA calls and am afraid of being regarded for being too greedy. Calling out to the WSB experts to see if I should still hold or realize my gains on at least some of these contracts \n",
            "gallery": [
                "https://i.redd.it/x9jkutfx7xpc1.jpeg"
            ]
        }
    },
    {
        "title": "$ARM forming Bullish Continuation Pennant. Ready to blow soon.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bl4ubt/arm_forming_bullish_continuation_pennant_ready_to/",
        "nr_comments": 49,
        "upvotes": "14",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/4snirzj67xpc1.png"
            ]
        }
    }
]