[
    {
        "title": "If options are the most risky thing, with the least likely outcome of success, why do you all waste your money on them?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhj34k/if_options_are_the_most_risky_thing_with_the/",
        "nr_comments": 32,
        "upvotes": "•",
        "content": {
            "text": null,
            "gallery": []
        }
    },
    {
        "title": "Pls.asx 🚀🚀🚀",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhifjo/plsasx/",
        "nr_comments": 11,
        "upvotes": "•",
        "content": {
            "text": "Just longed 11k Aud with 5x leverage\nThere is currently an asx game on atm and I’m competing, if we pump this shit to the moon we all make bank\n",
            "gallery": [
                "https://i.redd.it/rgwxd9rdu0pc1.jpeg"
            ]
        }
    },
    {
        "title": "Saw this RV park in Arizona. Thought the little dude looked familiar…",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhhziv/saw_this_rv_park_in_arizona_thought_the_little/",
        "nr_comments": 48,
        "upvotes": "•",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/aw9hynvup0pc1.jpeg"
            ]
        }
    },
    {
        "title": "NVDA: Think like a hedge fund",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhhx4e/nvda_think_like_a_hedge_fund/",
        "nr_comments": 36,
        "upvotes": "•",
        "content": {
            "text": "Dear friends and family,\nThis afternoon I had a dream that nvda will be over 950 tomorrow afternoon and that I will \"miss out\" on the move. \nNow, this is where I want to stop the presses and lay down the hammer: what would a hedge fund be thinking going into this week with nvda up like a bazillion percent, volume and bullish sentiment coming in like berserk to play the fomc, and a special event where this Jensen fellow is going to be waving chips around and telling people they're cool? \nI tell you what -- it is time to fucking buy some puts cuz the fat kids are about to cash out and make some bagholders this week after teasing everyone to fomo for 1000. This is why when it pumps tomorrow I am probably going to get short. Everyone is going to be saying \"wtf is it down 10% for after announcing a cool new chip and fomc indicating 3-4 cuts in the back half of the year?\", and that is exactly where the big players want your mindset: denial. \n",
            "gallery": []
        }
    },
    {
        "title": "Nvidia Stock",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhhuzk/nvidia_stock/",
        "nr_comments": 42,
        "upvotes": "•",
        "content": {
            "text": "Kinda new to this stuff.\nBought Nvidia last wednesday at around $909 share price. Hoping it can go up to the thousand mark within the first 10 days of april. What are your guys' thoughts and/or advice?\n",
            "gallery": []
        }
    },
    {
        "title": "High-Yield Savings or Stocks?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhhkk5/highyield_savings_or_stocks/",
        "nr_comments": 17,
        "upvotes": "2",
        "content": {
            "text": "I've got $50k saved for my mortgage and $85k left at 4.8% interest. Should I stash it in a 5% high-yield savings or invest in Tesla and Apple? Looking for advice on which move is smarter. Thanks!\n",
            "gallery": []
        }
    },
    {
        "title": "It was nice, if only for a moment, to think I might climb out of the muck",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhh75d/it_was_nice_if_only_for_a_moment_to_think_i_might/",
        "nr_comments": 15,
        "upvotes": "9",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/u8catp7ci0pc1.jpeg"
            ]
        }
    },
    {
        "title": "Is this considered a Double top pattern ?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhgxzl/is_this_considered_a_double_top_pattern/",
        "nr_comments": 49,
        "upvotes": "10",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/m6w9769qf0pc1.png"
            ]
        }
    },
    {
        "title": "Pay-tience ..",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhgxaf/paytience/",
        "nr_comments": 11,
        "upvotes": "11",
        "content": {
            "text": "Started with 50 Calls and had to average down a few times.  Patience was very important. I dont like to hold calls overnight unless the expiration date is a few months over.\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bhgxaf"
            ]
        }
    },
    {
        "title": "Guess what this put will be worth on market open. (BA Boeing)",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhg9do/guess_what_this_put_will_be_worth_on_market_open/",
        "nr_comments": 52,
        "upvotes": "48",
        "content": {
            "text": "I’ll take a screenshot when they open and update. \n",
            "gallery": [
                "https://i.redd.it/462jdb7o90pc1.jpeg"
            ]
        }
    },
    {
        "title": "JPow's Got You By The Balls",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhfqun/jpows_got_you_by_the_balls/",
        "nr_comments": 17,
        "upvotes": "45",
        "content": {
            "text": null,
            "gallery": [
                "https://v.redd.it/ie23o9cn40pc1"
            ]
        }
    },
    {
        "title": "Big week ahead. NVDA GTC, BoJ RBA BoE FOMC announcements, Fed economic projections, Jpow 2x, MU FDX NKE LULU PDD earnings, Reddit IPO",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhf4ug/big_week_ahead_nvda_gtc_boj_rba_boe_fomc/",
        "nr_comments": 21,
        "upvotes": "70",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/ccjuyj7ezzoc1.png"
            ]
        }
    },
    {
        "title": "Apple Quietly Reveals MM1, a Multimodal AI LLM",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhezie/apple_quietly_reveals_mm1_a_multimodal_ai_llm/",
        "nr_comments": 67,
        "upvotes": "114",
        "content": {
            "text": "A new paper from Apple presents MM1, a family of multimodal AI models that combine vision and language understanding. The researchers conducted extensive experiments to identify the key factors driving performance in these models, testing different architectural choices and pre-training data mixtures. \nKey points:\n\nMM1 includes both dense models up to 30B parameters and mixture-of-experts (MoE) variants\nImage resolution has the biggest impact on performance, more than model size\nSpecific vision-language connector design has little effect\nMixing interleaved image+text, caption, and text-only data in pre-training is crucial\n5:5:1 ratio of caption, interleaved, and text data works best\nSynthetic caption data helps for few-shot learning\nThe 30B dense model beats prior SOTA on VQA and captioning tasks\n\nhttps://aimodels.substack.com/p/apple-is-working-on-multimodal-ai?triedRedirect=true\n",
            "gallery": []
        }
    },
    {
        "title": "ULTA $7,420 to $16,230 in 1 Day",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bheesn/ulta_7420_to_16230_in_1_day/",
        "nr_comments": 11,
        "upvotes": "59",
        "content": {
            "text": "Played the earnings.\nInversed WSB and noticed insiders have been shedding shares for the last 12 months. Times the market open just right.\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bheesn"
            ]
        }
    },
    {
        "title": "Whoever exercised, fuck you",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhdjec/whoever_exercised_fuck_you/",
        "nr_comments": 306,
        "upvotes": "734",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/3cgvlniamzoc1.jpeg"
            ]
        }
    },
    {
        "title": "Reddit's IPO as much as five times oversubscribed, company is poised to reach its targeted price range",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhcxec/reddits_ipo_as_much_as_five_times_oversubscribed/",
        "nr_comments": 207,
        "upvotes": "516",
        "content": {
            "text": null,
            "gallery": [
                "https://www.reuters.com/markets/deals/reddits-ipo-much-five-times-oversubscribed-sources-say-2024-03-17/"
            ]
        }
    },
    {
        "title": "So you mean to tell me I have a week for it to go up 1% and it's a 5 bagger?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhbymy/so_you_mean_to_tell_me_i_have_a_week_for_it_to_go/",
        "nr_comments": 65,
        "upvotes": "323",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/f302gpym9zoc1.png"
            ]
        }
    },
    {
        "title": "Morris Chang $TSM mogs Japanese business practices",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhbqtf/morris_chang_tsm_mogs_japanese_business_practices/",
        "nr_comments": 30,
        "upvotes": "52",
        "content": {
            "text": "The man is unhinged\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bhbqtf"
            ]
        }
    },
    {
        "title": "MSTR's Week Ahead - Analysis for Regards",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bhb2ma/mstrs_week_ahead_analysis_for_regards/",
        "nr_comments": 28,
        "upvotes": "22",
        "content": {
            "text": "Tons of misinformed regards here about MSTR. See frontpage graphs about \"MSTR Premium way above Bitcoin\" or \"Buy BTC ETF Instead\".\nTo you regards, this is why MSTR premium is way above Corn price, and why MSTR can continue to rise despite Corn prices going up or down.\n1. Analysis of Recent Market Movements on Monday/Friday:\nOn Monday, the price of Bitcoin remained stable around $72,000, while  MSTR experienced a significant increase of 14.35%.\nConversely, on Friday, Bitcoin saw a decrease from $71,000 to $69,000, yet MSTR showed a  notable increase of approximately 6.3%.\nContrary to speculation suggesting MSTR's price surge is solely  attributed to leveraged Bitcoin purchases, this was due to substantial unrealized losses experienced by short sellers since MSTR's  price at $400.\n2. Misguided Assumptions by Short Sellers:\nThe high short interest observed in MSTR at its $400 price stemmed from short seller's erroneous assumption that investors would shift from mining stocks (such as MARA, RIOT, CLSK) and MSTR to ETFs for Bitcoin exposure. However, this assumption proved to be incorrect as the premium for MSTR grew, resulting in substantial paper losses in the billions.\nhttps://finance.yahoo.com/news/short-sellers-lost-3-3-233548587.html\n3. High Paper Losses from Shorts Since $400\nThese losses, amounting to over $6 billion, have persisted due to a short interest of roughly 23% since MSTR's lower valuation. Despite a current short interest  of approximately 17%, a significant portion of short sellers has yet  to cover their positions, indicating the potential for further price escalation.\nThe increasing pressure from stock repurchases and the impending Bitcoin halving necessitate hedge funds to exit their short positions on MSTR, thereby precipitating a squeeze.\n4. Escalating Pressure on Short Sellers:\nThe convergence of rare events, including the imminent Bitcoin halving and the continuous upward trajectory of Bitcoin's price, has created pressure on short sellers. The prospect of Bitcoin's price sustaining levels above $60,000, coupled with the risk of significant paper losses leading to potential liquidations by lending institutions, has pressured short sellers to exit their MSTR positions. This scenario presents a unique confluence of circumstances, triggering a cascading effect as more funds  cover their short positions.\n____\nhttps://www.tradingview.com/news/newsbtc:41bbbffaf094b:0-bitcoin-crash-triggered-by-failed-1-billion-hedge-fund-spread-trade-expert/\nhttps://www.nasdaq.com/market-activity/stocks/mstr/short-interest\nDespite a current short interest of ~17%, a significant portion of short sellers have yet to cover their billions in paper losses. However, a few have covered their positions this week, which is why you've been seeing MSTR go up 14% or 6% despite Bitcoin prices dropping.\nThe main possibility short sellers get to liquidate their positions without a major loss is if Bitcoin prices sharply drop below typical correction levels (eg. $45k). Otherwise, if Bitcoin holds, drops slightly, or increases, we'll likely see MSTR go up in price due to billions in short seller buybacks.\n",
            "gallery": []
        }
    },
    {
        "title": "Forbes: Nvidia, Google And Microsoft Are Betting Billions On Biotech’s AI Future",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bh9eol/forbes_nvidia_google_and_microsoft_are_betting/",
        "nr_comments": 89,
        "upvotes": "368",
        "content": {
            "text": "Forbes just posted this video today going over Nvidia's future in the Biotech space. I think its very interesting where a lot of the investments Nvidia is making goes.\nhttps://www.youtube.com/watch?v=Xzw7TXdXYtk\n",
            "gallery": []
        }
    },
    {
        "title": "When T+1 goes live on May 28, how will that affect the market? And will institutional trades look different too?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bh81kw/when_t1_goes_live_on_may_28_how_will_that_affect/",
        "nr_comments": 27,
        "upvotes": "21",
        "content": {
            "text": "So the settlement period for trading of securities is moving from T+2 to T+1 on May 28. \nThis should make non-margin retail trading more responsive, right, and all securities more liquid? Like, if you buy with unsettled funds in a cash account, you can sell the next day instead of waiting two days to sell. So you can react faster in order to profit more or reduce loss.\nSo then:\n1) The focus has been on rules for retail trades, but there are also changes going into effect for institutional investors. How exactly is institutional trading affected?\n2) What are your predictions - will the new rules make the trading environment more volatile or less? Personally, I kinda see this change as adding volatility by increasing the volume of trades, but overall decreasing volatility, smoothing out jaggedness in price action caused by the T+2 delay.\nRegarding the changes for institutional trading, the SEC says here, https://www.sec.gov/news/press-release/2023-29:\n\nIn addition to shortening the standard settlement cycle, the final rules will improve the processing of institutional trades. Specifically, the final rules will require a broker-dealer to either enter into written agreements or establish, maintain, and enforce written policies and procedures reasonably designed to ensure the completion of allocations, confirmations, and affirmations as soon as technologically practicable and no later than the end of trade date. The final rules also require registered investment advisers to make and keep records of the allocations, confirmations, and affirmations for certain securities transactions. \n\nTL;DR: What will be different in terms of volatility after May 28?\n",
            "gallery": []
        }
    },
    {
        "title": "SP500 and DAX40 forecast for the upcoming week: CW12/2024",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bh7r8b/sp500_and_dax40_forecast_for_the_upcoming_week/",
        "nr_comments": 12,
        "upvotes": "10",
        "content": {
            "text": "Here's my personal forecast for the upcoming week: CW12/2024\n#SP500 and #DAX40\nGreen arrow = trading only LONG\nRed arrow = trading only SHORT\nYellow = stay away from the market\nhttps://preview.redd.it/az8o6hghfyoc1.jpg?width=1213&format=pjpg&auto=webp&s=b6d0a6f36a360b07906023106128aef487e88dd2\n",
            "gallery": []
        }
    },
    {
        "title": "TSM Bull Case",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bh7ork/tsm_bull_case/",
        "nr_comments": 131,
        "upvotes": "163",
        "content": {
            "text": "Alright, listen up, here's the deal with TSM.\n\nSemiconductor Shortage: We all know there's a global chip shortage, right? Well, TSM is one of the big dogs in the semiconductor game, and they're poised to capitalize big time on this shortage. More demand equals more tendies for us.\nTech Boom: With everything going digital, from 5G to IoT to self-driving cars, the demand for chips is through the roof. TSM's got the tech and the chops to meet that demand and then some.\nTop Dog Status: TSM ain't just any semiconductor company; they're the top dog in the manufacturing game. They're pumping out chips using cutting-edge tech like 7nm and 5nm processes. That's like printing money, baby.\nSupply Chain Master: While other companies might be struggling with supply chain issues, TSM's got it locked down tight. Their solid supply chain and diverse customer base mean they're not just surviving the chaos; they're thriving in it.\nBullish Buzz: You know how hype can send a stock to the moon? Well, TSM's been getting some serious buzz lately. Whether it's talks of new partnerships or killer earnings, the sentiment around TSM is sky-high, and that could mean big gains for us.\n\nSo, buckle up, fellow degenerates, because TSM ain't stopping until we hit that sweet $400 mark. 🚀🚀🚀\n",
            "gallery": []
        }
    },
    {
        "title": "50k profit 0dte NFLX puts",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bh7dwb/50k_profit_0dte_nflx_puts/",
        "nr_comments": 10,
        "upvotes": "49",
        "content": {
            "text": "Found out I can't use my friends password anymore, decided to yeet some puts.\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bh7dwb"
            ]
        }
    },
    {
        "title": "What Are Your Moves Tomorrow, March 18, 2024",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bh6yxa/what_are_your_moves_tomorrow_march_18_2024/",
        "nr_comments": 5341,
        "upvotes": "720",
        "content": {
            "text": "View Post\n",
            "gallery": []
        }
    },
    {
        "title": "Too Much Risk Appetite",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bh5ohd/too_much_risk_appetite/",
        "nr_comments": 32,
        "upvotes": "83",
        "content": {
            "text": "I always say I’m going to buy 100 shares to sell covered calls, but then I end up buying weeklies.\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bh5ohd"
            ]
        }
    },
    {
        "title": "whats going on w the $6 strike?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bh5h2b/whats_going_on_w_the_6_strike/",
        "nr_comments": 32,
        "upvotes": "8",
        "content": {
            "text": "sirius xm\n",
            "gallery": [
                "https://i.redd.it/qz53xz0gzxoc1.jpeg"
            ]
        }
    },
    {
        "title": "$NVO Discussion",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bh5gqk/nvo_discussion/",
        "nr_comments": 113,
        "upvotes": "70",
        "content": {
            "text": "Is there a reason why this stock isn’t openly discussed on these forums? \nThey’re the maker of Ozempic and as people view obesity as a disease > a lack of discipline there are discussions in Canada about making the drug something covered to treat obesity. \nConsistent worldwide shortages due to large demand, consistent research showing its effectiveness and new drugs developed by the company that outpaced the competition makes me think that this stock is a great value add/something degens like myself can gamble on with predictable growth \n",
            "gallery": [
                "https://i.redd.it/01yss93ezxoc1.jpeg"
            ]
        }
    },
    {
        "title": "Prime Allegiant engineering & safety standards",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bh56lb/prime_allegiant_engineering_safety_standards/",
        "nr_comments": 83,
        "upvotes": "394",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/67vgfmvdxxoc1.jpeg"
            ]
        }
    },
    {
        "title": "Is TSM a bargain at 27x earnings?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bh4c5a/is_tsm_a_bargain_at_27x_earnings/",
        "nr_comments": 175,
        "upvotes": "234",
        "content": {
            "text": "I am comparing TSM to other semiconductor juggernauts\nPE Ratios\nAVGO 46\nNVDA 74\nASML 43\nLAM 35\nAMAT 23\nAMD 364\nINTC 106\nARM #N/A\nI don't know anything about value investing, but doesn't a low PE relative to peers with growth potential, sustainable income, and pricing leverage suggest that TSM is undervalued?\nI am also curious about ARM. I have heard their technology is in all sorts of devices, but they are not making a lot of money. What's the story on this stock?\n",
            "gallery": []
        }
    }
]