[
    {
        "title": "Spread on some porn",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjxs1x/spread_on_some_porn/",
        "nr_comments": 28,
        "upvotes": "•",
        "content": {
            "text": "Here is my spread from having 12k and using 8k margin.\n",
            "gallery": [
                "https://v.redd.it/0d4lq4ap3mpc1"
            ]
        }
    },
    {
        "title": "First time attempting anything like this, and apparently I screwed up!",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjxmen/first_time_attempting_anything_like_this_and/",
        "nr_comments": 16,
        "upvotes": "•",
        "content": {
            "text": "I received one of the Reddit IPO invitations, and I thought I had completed the process as directed, including funding the e trade account. However, tonight I logged in and found that the Direct Share Program had closed so I have no way to indicate interest. Somehow I mistakenly thought that I was supposed to tell how many shares I wanted after the price was set. Please forgive my ignorance as this entire process was new to me, and I am not an investor as you can easily see. Is all hope lost? Is there no other way I can participate in the IPO, thanks to my idiocy?\n",
            "gallery": []
        }
    },
    {
        "title": "I mistyped 420 shares ;(",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjx695/i_mistyped_420_shares/",
        "nr_comments": 10,
        "upvotes": "11",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/hegu2qm2ylpc1.jpeg"
            ]
        }
    },
    {
        "title": "Anyone doing calls or put on $FDX (FedEx)",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjx5r3/anyone_doing_calls_or_put_on_fdx_fedex/",
        "nr_comments": 11,
        "upvotes": "5",
        "content": {
            "text": "If you’re doing an options play for ER tomorrow say what your position is and why!\n",
            "gallery": []
        }
    },
    {
        "title": "Imagine the family dinners NVDA /AMD CEO’s are cousins:",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjx1br/imagine_the_family_dinners_nvda_amd_ceos_are/",
        "nr_comments": 55,
        "upvotes": "210",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/h85dbvxtwlpc1.jpeg"
            ]
        }
    },
    {
        "title": "reverse head and shoulders",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjwvuk/reverse_head_and_shoulders/",
        "nr_comments": 18,
        "upvotes": "9",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/zead0jbfvlpc1.jpeg"
            ]
        }
    },
    {
        "title": "Oh boy lost all in day trade 👁️👁️",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjwqia/oh_boy_lost_all_in_day_trade/",
        "nr_comments": 12,
        "upvotes": "9",
        "content": {
            "text": "Found that in canada personal finance group \n",
            "gallery": [
                "https://i.redd.it/mvololr3ulpc1.jpeg"
            ]
        }
    },
    {
        "title": "All aboard the DWAC rocket, next stop is the moon and beyond !!! 🚀🚀🚀",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjwnol/all_aboard_the_dwac_rocket_next_stop_is_the_moon/",
        "nr_comments": 46,
        "upvotes": "54",
        "content": {
            "text": "My fellow degenerates/apes, KingKong's here, I know you have been looking for rockets to the moon, DWAC is the rocket, powered by the following fuel catalysts which shall propel it to the moon and beyond; I am all in on DWAC now, here is a screenshot of Today $279K  or 32% up of my portfolio( stocks, warrants and options of DWAC), I will continue to add on it to my portfolio until its moon landing.\nShort term fuel catalysts to the moon :\n\nThe (DWAC+TMTG) merger vote result will be released on Friday 03/22/24 at 10am EST\nAbout 11% short interests are being covered.\nHigher percentages and unknown Naked short-selling positions are forced to close by stock brokerages and money makers before ticker change on merger's day, which might cause MOASS !\nVery low 41 million shares float even after the merger and insiders including Trump are locked up from selling any shares for 150 days, all it takes is a spark of fuel catalyst, the nuclear chain reaction shall turbocharge the rocket.\nOn merger's day, most likely Monday 03/25/24, the ticker changes from DWAC to DJT (Donald John Trump), and Trump rings the bell in Nasdaq broadcasting to the world, FOMO institutions(not allowed to own any SPAC before De-SPAC), MAGA buyers, and retail investors all over the world are rushing in !!!\n\nAll aboard the DWAC rocket, next stop is the moon and beyond !!! 🚀🚀🚀\nhttps://preview.redd.it/mrduyd5xrlpc1.jpg?width=1408&format=pjpg&auto=webp&s=5c838f1af4cf473e41c2b478c73482bb652264d8\nhttps://preview.redd.it/fljfo9a0tlpc1.jpg?width=1814&format=pjpg&auto=webp&s=2002ffacc17637cb7cead48da9c016c314b266cc\nhttps://preview.redd.it/3do03htzrlpc1.jpg?width=1200&format=pjpg&auto=webp&s=8cd6a45c4cc25a28581a9c92cb72b83f1a077cb5\n",
            "gallery": []
        }
    },
    {
        "title": "Btc vs nvidia vs gold",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjwc2n/btc_vs_nvidia_vs_gold/",
        "nr_comments": 38,
        "upvotes": "42",
        "content": {
            "text": "Nvidia and corn holders know how to cook\n",
            "gallery": [
                "https://i.redd.it/ndnu5cthqlpc1.jpeg"
            ]
        }
    },
    {
        "title": "Elon did a good thing here. Calls on $TSLA",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjw8vv/elon_did_a_good_thing_here_calls_on_tsla/",
        "nr_comments": 30,
        "upvotes": "28",
        "content": {
            "text": "This is actually incredible \n",
            "gallery": [
                "https://v.redd.it/cdobqbspplpc1"
            ]
        }
    },
    {
        "title": "The future is here",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjvvuc/the_future_is_here/",
        "nr_comments": 39,
        "upvotes": "434",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/ji0r58gimlpc1.jpeg"
            ]
        }
    },
    {
        "title": "After All That Shit Talk You Guys Are Posting Reddit Buys Like True Internet Nerds",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjvih0/after_all_that_shit_talk_you_guys_are_posting/",
        "nr_comments": 61,
        "upvotes": "37",
        "content": {
            "text": "Of course everyone that said they were buying puts isn’t. You guys always do the inverse of what you say. \nI don’t know where the money came from to hit the top range because they were still sending those stock emails asking people to participate last night. \nI guess you guys pulled them through the finish line in typical WSB fashion.\nAnyway. Good luck tomorrow. It’s gonna be a shit show here.\n",
            "gallery": []
        }
    },
    {
        "title": "RDDT IPO: Regarded DD - Puts It Is",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjvcd1/rddt_ipo_regarded_dd_puts_it_is/",
        "nr_comments": 12,
        "upvotes": "3",
        "content": {
            "text": "Hey Fellow Regards,\nWant to make some money on puts?\nHow much is Reddit worth?\nReddit was valued at $10 billion in a private fundraising round in August 2021. When it first decided to list, it was aiming for a valuation of more than $15 billion; however, the company has lowered its sights to $5 billion according to the New York Times.\nIs Reddit profitable?\nNo, Reddit isn’t profitable. However, the company has been substantially growing revenue in the past few years. Reddit’s total revenue in 2023 was $804 million, up 21% from $666 million in 2022. Reddit’s net loss for 2023 narrowed to $90.8 million.\nIs Reddit Owned by the CCP?\nNo, but Chinese company TenCent (which like all companies in China, takes orders from the CCP) owns a 7.5% stake in Reddit.\nHow Much Does Reddit’s CEO Make Despite the Business Hemorrhaging hundreds of millions of dollars every year?\nReddit CEO Steve Huffman's total compensation exceeded $193M in 2023.  YIKES.\nWhat Are Some Power Dynamic and Risk Factors That Face Reddit In the Coming Years?\nLast year Reddit mods, who are unpaid wildcards, took many of their subreddits private in protest of API changes that Reddit corporate made.  This massively disrupted the advertisement business that Reddit uses to generate money (despite losing money every single year since inception) and can/will happen again due to Reddits’s reliance on unpaid moderation.\nThere’s an expectation that because of all the gnarly NSFW content, advertisers will shy away from the platform so they don’t have their add pop up in between posts of midget porn and foot jerking.\nIs the FTC investigating them at all?\nYes, they are investigating their potential use of data in large language AI model training.\nIs there an insider lockup period for any of those that got pre-IPO shares?\nYes.\n",
            "gallery": []
        }
    },
    {
        "title": "NVDA Bull case: The jacket he wore looks like it comes from Tom Ford's spring 2023 collection, and it retails for $8,990.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjvcav/nvda_bull_case_the_jacket_he_wore_looks_like_it/",
        "nr_comments": 26,
        "upvotes": "52",
        "content": {
            "text": "$1k tomorrow?Source: https://www.businessinsider.com/jensen-huang-wardrobe-black-leather-jackets-signature-look-2024-3\nhttps://preview.redd.it/6ld3f0lihlpc1.png?width=748&format=png&auto=webp&s=149bb391a9811f21ca73804e81310a97757c7b6d\nhttps://preview.redd.it/lh3c9z9ailpc1.png?width=703&format=png&auto=webp&s=3c20e9acd7f05378b2f7b1277cec57dd6d28208d\n​\n",
            "gallery": []
        }
    },
    {
        "title": "Full Account YOLO",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjv5sz/full_account_yolo/",
        "nr_comments": 18,
        "upvotes": "14",
        "content": {
            "text": null,
            "gallery": [
                "https://www.reddit.com/gallery/1bjv5sz"
            ]
        }
    },
    {
        "title": "No indicator has done a better job of predicting when the next global recession will start than when the Bank of Japan starts raising rates",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjv030/no_indicator_has_done_a_better_job_of_predicting/",
        "nr_comments": 42,
        "upvotes": "48",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/hw6ug99yelpc1.jpeg"
            ]
        }
    },
    {
        "title": "I got scammed by option market makers on TSLA",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjun9u/i_got_scammed_by_option_market_makers_on_tsla/",
        "nr_comments": 24,
        "upvotes": "0",
        "content": {
            "text": "So i took a small call position today 180c expiring friday for .82 at  1:57pm…………yes i know was just  before fed meeting i was confident in upside so placed a bet with low size. \nSure enough price was volatile but closed strong price up over 1% from where i entered yet my calls were priced at .90????? \nDelta at .24 how the fk did a near $2 move result in my contracts only being up 8 cents?? \nIve had similiar trades recently where i get a solid move yet options barely moved or wefe even negative!\nIve traded for several years now and it feels as of late options trading had been a total scam as far as teyijg to trade short term action. Why ive now went to stock trades\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bjun9u"
            ]
        }
    },
    {
        "title": "Reddit IPO",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjudk9/reddit_ipo/",
        "nr_comments": 21,
        "upvotes": "8",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/44dui85f9lpc1.jpeg"
            ]
        }
    },
    {
        "title": "My next play? REDDIT",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjudfd/my_next_play_reddit/",
        "nr_comments": 34,
        "upvotes": "0",
        "content": {
            "text": "Reddit is the only social media platform where I don't hate myself after using. \n",
            "gallery": [
                "https://i.redd.it/rqb7sf2o9lpc1.jpeg"
            ]
        }
    },
    {
        "title": "Is Vertiv (VRT) a Good Growth Story Because They Have Water Cooling Solved - instead of the other guy",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bju7so/is_vertiv_vrt_a_good_growth_story_because_they/",
        "nr_comments": 19,
        "upvotes": "8",
        "content": {
            "text": "It's Not a DD but a discussion and wondering if anyone has been following them closely.\nJensen specifically mentioned Vertiv in his GTC analysis talk which was amazing btw. It was like a bonus earnings call.\n\nIn 2023 Vertiv was up 269%\nIt's American based in Westerville, Ohio\nIn the field of Generative AI they are the only other company other than Nvidia that went up 200% in 2023\nJensen said at GTC that we are going to need bigger GPU's and more and more data centers - this seems to be the rack that Nvidia prefers and is using rather than SCMI\nIf you're installing the racks you're also installing the networking for those NVLINK connections of 600 GPU's running as 1 giant GPU\nIn December 2023 they announced they would provide cooling to Intel's Gaudi AI accelerator\nJoe Biden, Raimondo and J Pow just gave Intel 8.5 billion in funding just because America (it's a national security issue)\n\n\nProduction of Chips needs to come home\n\nBecause their providing the racks that have water the racks also need power and they have collaborated with American Electric AEP Power to implement the microgrid application.\n\n\nThey're providing the diesel generator backups for disaster recovery in that microgrid application\n\nGenerative AI is going to need more water cooling.\nSam Altman said Chips are the new currency\nVertiv Dominates the industry - 2023 they posted better than expected results with an ambition forecast for the year\n\n\nEarnings per share grew 126% in Q3\n\nSMCI seems played out\nThey have a chart that looks like this\n\nhttps://preview.redd.it/fxkrh7168lpc1.png?width=387&format=png&auto=webp&s=cd9f4ce1797406d2400b4cd4289fbb05dd95e9bb\nAnd they have this video on their website\nhttps://reddit.com/link/1bju7so/video/pfao5lx78lpc1/player\n",
            "gallery": []
        }
    },
    {
        "title": "Straight to hell boiii",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjtun7/straight_to_hell_boiii/",
        "nr_comments": 72,
        "upvotes": "64",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/vivk2sxb5lpc1.jpeg"
            ]
        }
    },
    {
        "title": "DD: Multiple reasons why Reddit will actually go up post-IPO",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjtgh8/dd_multiple_reasons_why_reddit_will_actually_go/",
        "nr_comments": 50,
        "upvotes": "13",
        "content": {
            "text": "Everyone is saying \"I cannot wait to short Reddit\" but if you look at the large picture many things are working in Reddit's favor to have a successful IPO. \n1. Banks and Exchanges want a successful high-profile IPO.\nOnly 151 companies went public last year. This is down significantly from 2021 when there were 1,035. \nPart of the reason for the decline is many high-profile companies that quickly fell below their IPO levels like Instacart. Investment banks make money by partnering with companies in the IPO process; Morgan Stanley, Goldman Sachs, J.P.Morgan and Bank of America Securities are the lead underwriters for Reddit.\n2. Limited institutional interest in shorting the stock\nVery few funds or institutions are going to short the stock. As I mentioned investment banks want more IPOs so why would they short Reddit and potentially cause more companies to stay private? Additionally, after the short-squeeze that happened with Game S no fund is going to risk shorting Reddit. The risk of being burned is too high for the possible reward. Also, because Reddit is so new there are no swaps or other complex instruments available, the only way to short would be actual short-selling. Bill Ackman ran into this same issue with herbalife and got burned.\n3. Options will not be available immediately and the exchange has discretion on when to allow them. \nGoing back to my first point. The NYSE has an interest in the IPO going well. They know options will increase volatility so they will wait as long as possible before allowing options to be traded. Options are the only way 99% of retial investors can go short on a stock. Obviously, you could actually short-sell the stock but the average retail investor will not and it's not even possible on Robinhood. \n\nAs I am writing this it was just announced because of strong demand the IPO will be at the top of the IPO range ($34) . Another reason Reddit will have a strong IPO. I locked in 100 shares for tomorrow via the IPO. See ya'll regards on the moon.\n",
            "gallery": []
        }
    },
    {
        "title": "RDDT IPO Original DD",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjsyx9/rddt_ipo_original_dd/",
        "nr_comments": 17,
        "upvotes": "27",
        "content": {
            "text": "I am providing my RDDT IPO DD - it is a quantitative collection of the most relevant data points and includes some analysis based on Forced Buyers that you probably won't find anywhere else.\n​\nThe Reddit IPO Offer:\n​\n\n\nDEAL TERMS\n\n\n\nnothing new here but note that at the target price they are a big small cap\n​\n\n\nMARKET CAP ANALYSIS -\n\n\n\nTo me this is the interesting section. So many boomers buying index funds means that we get to predict what they will need to buy. the lazy bankers over at Goldman, JP Morgan, BOFA, Morgan Stanley, Citigroup, DB and the others got this oversubscribed by only selling to the people who were already captive buyers.   The timing on this is not instantaneous, but plays out over the index rebalancing's noted in KEY DATES\n​\n\n\n\nFINANCIALS\n\n\n\nEventually the street will care about RDDT making money, but not today.  The ability to dial up the advertising saturation is the key for longer term investors.\n\n\nCOMPS\n\n\n\nbasically fair priced.  lazy bankers love to price leaving money on the table. Plenty of upside.\n\n\nENGAGEMENT\n\n\n\ngood enough.\n\n\nDEAL STRUCTURE\n\n\n\nnothing to like here, the CEO pay business suck, but is forgivable given the IPO.  but I would blackball them if they tried to pull this shit again.\n​\n\n\nKEY DATES\n\n\n\nhttps://preview.redd.it/tyva1wzbukpc1.png?width=643&format=png&auto=webp&s=402ec2d2db5156f37e94c93e4b63054db03a850e\n\n\nRECCOMENDATION\n\n\n\nhttps://preview.redd.it/wlvllm2lukpc1.png?width=643&format=png&auto=webp&s=5db615f22cef18051b49d7bec288eaabcaa91727\nRISKS, UNKNOWS AND THE APE FACTOR\nI would really like to know about per user engagement trends.   This will become more important as they further saturate the subredds with ads.\nWSB Apes may jump on the bandwagon and exaggerate and quicken the trend.   WSB appears mostly frosty to the RDDT IPO, but then again …...I don't see any WSB downside. But not seeing any frothy actions like  WSB heydays.  WSB getting boring?  good.  That's why we are so highly regarded.\n​\n",
            "gallery": []
        }
    },
    {
        "title": "I went from $6k>25k>0 in a month",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjsji3/i_went_from_6k25k0_in_a_month/",
        "nr_comments": 166,
        "upvotes": "457",
        "content": {
            "text": "since we are sharing, here's my dick and balls chart\n",
            "gallery": [
                "https://i.redd.it/b15e4by2vkpc1.jpeg"
            ]
        }
    },
    {
        "title": "Nothing is Making Sense with ARM Anymore",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjrm7u/nothing_is_making_sense_with_arm_anymore/",
        "nr_comments": 11,
        "upvotes": "11",
        "content": {
            "text": "​\nLiterally me right now (if you saw the movie you know)\nSo the sell-off that everyone expected did not happen in Mar 12. I thought the whole point of going public is to sell some stocks of the company to raise capital. It's hard to believe they will hold onto 90% of the stock even after the lock up, unless it has always been to plan to make only 10% of the company public tradable. Even they sell a small percentage of what they are holding, say 10% more, it will cause the available stocks on the market to double.\nI can think of a few reasons why Softbank should sell. But they might be just wishful thinking from my part.\n\nKeep in mind that Softbank does not benefit from the current stock price until they actually sell, because the current free float was sold to the market at IPO price.\nPE too high. 1600 ttm, 100 forward. Are you kidding me? (inb4 \"PE does not matter in AI stocks\")\nThere are better AI stocks out there. Why would someone hold ARM over NVDA?\n\nPosition: Apr 17, $100 puts and $80 puts.\n",
            "gallery": []
        }
    },
    {
        "title": "Here we go!",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjrchr/here_we_go/",
        "nr_comments": 29,
        "upvotes": "43",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/b3mlf6aulkpc1.jpeg"
            ]
        }
    },
    {
        "title": "US DOJ to sue Apple for antitrust violations, Bloomberg News reports",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjr3g0/us_doj_to_sue_apple_for_antitrust_violations/",
        "nr_comments": 11,
        "upvotes": "16",
        "content": {
            "text": null,
            "gallery": [
                "https://www.reuters.com/technology/us-doj-sue-apple-antitrust-violations-bloomberg-news-reports-2024-03-20/"
            ]
        }
    },
    {
        "title": "How much will this worth tomorrow if price stays?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjqq2m/how_much_will_this_worth_tomorrow_if_price_stays/",
        "nr_comments": 34,
        "upvotes": "21",
        "content": {
            "text": "First of all, this is not my position. I just saw this from another community. I am learning option and trying to estimate how much will this worth tomorrow if price opens at 110. I am thinking about 60k. Is that too overestimated?\n",
            "gallery": [
                "https://i.redd.it/zut4wcq9hkpc1.jpeg"
            ]
        }
    },
    {
        "title": "Bitcoin, just a little bit of history repeating.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjqiv0/bitcoin_just_a_little_bit_of_history_repeating/",
        "nr_comments": 43,
        "upvotes": "20",
        "content": {
            "text": "I'm looking for the Bitcoin breakout in four days, and look for it to double in 22 days after that. The halving will be on 4/20. Consider this your invite to the party.  The difference between what bitcoin has done recently and last cycle was literally just the pump that we got from Saylor. Look for confirmation by the price consolidating under resistance for roughly the next three days, just like it did last time. \nhttps://preview.redd.it/3ft5b7u0fkpc1.png?width=3167&format=png&auto=webp&s=77fad424f5edd17e949b9a39ee1949d4a4aa8268\n",
            "gallery": []
        }
    },
    {
        "title": "Wish me luck!!",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bjqfj6/wish_me_luck/",
        "nr_comments": 30,
        "upvotes": "36",
        "content": {
            "text": "This is a website I spent half my day on, might as well go for it. I hear it’s 400-500% oversubscribed!\n",
            "gallery": [
                "https://i.redd.it/kg3y4dc3fkpc1.jpeg"
            ]
        }
    }
]