[
    {
        "title": "This is it.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj52jw/this_is_it/",
        "nr_comments": 11,
        "upvotes": "•",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/1cor0sb42fpc1.jpeg"
            ]
        }
    },
    {
        "title": "Looks like the CORN short squeeze is on...",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj51lo/looks_like_the_corn_short_squeeze_is_on/",
        "nr_comments": 25,
        "upvotes": "•",
        "content": {
            "text": "Food prices have adjusted for inflationary downpressure and the effects have not been realized in one of the key staples of our economy. CORN\nWhile everyone has their head in the sky with pie dreams of AI, let's not forget what feeds America. What fuels growth. What drives the economy.\nCORN call volume is picking up rapidly. It's been massively shorted and suppressed but it's about to spring like a coil and cause a short squeeze that will send a huge ripple across the broader market.\nI also believe that this will be the catalyst that will re-trigger the squeeze on all the meme stocks. \nThis is the true moass. \n$CORN 4/19 20C\n$0.60 currently and will give 67% return if CORN makes it to $21.00 before 4/20.\nIt is currently at $20.02 (green arrow) and needs to get to $21 (red arrow).\nProfit is white arrow. \nIt recently hit its bottom and its flying north and jacked to the tits.\nBuying top shelf meddi on 4/20.\nDo ur own DD, I EAT CRANS\n",
            "gallery": [
                "https://i.redd.it/vcz9q6gu1fpc1.jpeg"
            ]
        }
    },
    {
        "title": "Managing risk should be NORMAL",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj4scn/managing_risk_should_be_normal/",
        "nr_comments": 16,
        "upvotes": "•",
        "content": {
            "text": "I don't mean this to come off preachy. I myself have lived a life of stock market sin, but I've come to the light and I want others to see the truth as well. \nIn this sub we have come to glorify massive gains and colossal losses 📉.  The typical person here would seem to have a 5-10k dollar Robinhood account, which they eagerly are willing to risk most of on a random earnings event, overnighting weeklies, or dca-ing 0dte against the market until their account reaches -99%. \nWhat if it didn't have to be this way? What if someone with a 5-10k cash account could average 100-200 bucks a day in gains rather than just going all or nothing? They would only take 25-100 trading days to double up with a more measured approach to trading. \nHow? Well, how about for starters: \n1) Weeklies and 0dte are for scalping, not swinging. Yes, when you see COIN or NVDA or whatever the fuck stock you suck yourself off to has a good setup on the intraday: you scalp that shit. You buy a weekly and sit there until you've made a little money and you throw the option back into the sea 🌊 after like 10-30 minutes.  \n2) Swinging has a clean technical setup. So, say we want to enter a trade against QQQ in this bull market. The trend is already against it. Would it make more sense to enter short if it was stalling out at like 445 where you would have a closer logical stop, or 434 where you're just jerking yourself off hoping the last 6 months of trend support will break? Praise God. 👏  \n3) You can accept a loss and you know where you'll take it when you enter a trade. A general rule I've learned in the futures trading community is you never will let a single day take out more than 3 days of your average gains. Preferably less, but we are in the business of risking it for the biscuit so sometimes shit happens. Say you made 200 for the last 5 days, and the next day you get fucked for 600, you're still up 400 and your mental has probably taken a hit but it's better than if you took your account from 5k to 12k overnight then toileted the entire account dca-ing spy puts against an uptrend day. Then you just won't be feeling good about shit for a couple months rather than a day or two.   \nThat's just 3 simple things, my fellow degens. We're here to make money, not fund the local hedge fund manager's next visit to a brothel.\n",
            "gallery": []
        }
    },
    {
        "title": "Calls on AMD",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj4jmc/calls_on_amd/",
        "nr_comments": 36,
        "upvotes": "124",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/f0hul2rvwepc1.jpeg"
            ]
        }
    },
    {
        "title": "Fuck it we ride into Valhalla, $BB",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj46td/fuck_it_we_ride_into_valhalla_bb/",
        "nr_comments": 16,
        "upvotes": "8",
        "content": {
            "text": "Am I REgarded, or am I Acoustic - Will be adding more calls into my portfolio in the next few days. Thinking $2.5k more. \n",
            "gallery": [
                "https://i.redd.it/830ldj4dtepc1.jpeg"
            ]
        }
    },
    {
        "title": "SPY 4/5 515P $19.5k YOLO",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj3z3j/spy_45_515p_195k_yolo/",
        "nr_comments": 16,
        "upvotes": "18",
        "content": {
            "text": "Usually not a bear 🌈🐻 but couldn’t resist. I think the market is simply too frothy and fragile, waiting for a correction. Any hawkish tone tomorrow and down we go. Built this $20k from $1k just a few months ago, so this is a true yolo for me…would hate to see it back at zero! See you on the other side folks! Hope everyone comes out a winner. 👊🏻\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bj3z3j"
            ]
        }
    },
    {
        "title": "Inflation is Transitory",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj3trp/inflation_is_transitory/",
        "nr_comments": 16,
        "upvotes": "5",
        "content": {
            "text": "As yes, the favorite slogan of our God, daddy Jpow. He said this so many times. \nTRANSITORY\nThat was his favorite word for a long time. I remember drinking games where people would take a shot everytime he said that word during a speech. Now our fabled God of funny Money, Prince of the drunk sailors, has a new term:\nCONFIDENCE\nI don't know how many motherfucking times I have heard this guy say the word confident, confidence, or some phrase like, \"we must be confident with the data.\" WELL GUESS WHAT? Last week's data was anything but \"confident.\" It was bad, it was mixed, inflation is up, consumer confidence (haha) is down, literally the definition of confusing. \nI don't know what that means, and I sure as fuck know Jpow doesn't know what that means. So that's not exactly confidence, I guess we will see if the fed is going to Do what it has said it's going to do. \nNow im not a homobear, I have calls on palantir and PayPal, and buys on US100(forex) but I did hedge with some spy puts that expire Friday.\nThe question is, is this mother fucker going to do What he said he's going to do? A million mother fucking times And follow the data and come out hawkish or is he just going to prove that he's a fucking lizard person and just like INFLATION IS TRANSITORY, the feds entire WE NEED CONFIDENCE IN THE DATA, is all bullshit\n",
            "gallery": []
        }
    },
    {
        "title": "Every CEO On The Planet Bows Down To Nvidia - Elon Musk - There is Currently Nothing Better Than Nvidia Hardware for AI",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj2u3x/every_ceo_on_the_planet_bows_down_to_nvidia_elon/",
        "nr_comments": 15,
        "upvotes": "14",
        "content": {
            "text": "​\nhttps://preview.redd.it/d6lskqb5hepc1.png?width=1591&format=png&auto=webp&s=d4a1793196f812a0d85d3d6d5838c2aeec3ff964\n",
            "gallery": []
        }
    },
    {
        "title": "SPY ANTI YOLO",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj2ibe/spy_anti_yolo/",
        "nr_comments": 25,
        "upvotes": "19",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/pqyesq9heepc1.jpeg"
            ]
        }
    },
    {
        "title": "I could’ve sold for 13k on March 8th. Am I cooked?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj2hit/i_couldve_sold_for_13k_on_march_8th_am_i_cooked/",
        "nr_comments": 47,
        "upvotes": "28",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/h9p9a2vaeepc1.jpeg"
            ]
        }
    },
    {
        "title": "TSM and Intel pause construction because US labor is more expensive than China- in other news water is wet, GG",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj2ch3/tsm_and_intel_pause_construction_because_us_labor/",
        "nr_comments": 61,
        "upvotes": "235",
        "content": {
            "text": null,
            "gallery": [
                "https://www.datacenterdynamics.com/en/news/chemical-and-material-suppliers-for-tsmc-and-intel-pause-arizona-construction-plans-citing-rising-costs/"
            ]
        }
    },
    {
        "title": "Any advice ? {a little bit of Rant please ignore}",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj28or/any_advice_a_little_bit_of_rant_please_ignore/",
        "nr_comments": 79,
        "upvotes": "14",
        "content": {
            "text": "I keep loosing so much on 0 dte SPY options. It’s just happened 3 or 4 times so far and those have been the biggest losses ever. I have been consistently trading from a long time. I do follow all the news. Understand all the options strategies, and a lot of finance terms. I listen to fed calls every week, listen to podcasts, earnings calls. And I can guess direction pretty well too.\nLast few weeks I have been sleeping less and less but wake up every day an hour before markets do analysis and I am right on the  general direction at least 60% -70% of the time. I bet calls on Appl, google, when they were at their lows but sold out at small profits. Next day google runs 6% up. \nI trade well on high volatility days. Make some profit and stop. And out of nowhere, I don’t know what happens, as soon as i go into a position bigger than I ever normally do on a 0dte markets tend to go tits up in the other direction. \nAnd the only SPY/ qqq positions I lost big were puts at 0dte. The first time I lost over 30k in a single day spy went up my option was worth .06 and I was ITM again in 2020. And now I keep buying puts and it just runs the other direction. \nLike today’s rally, why ? I know markets go up and down. Today, it’s not just NVDA, every sector went up and the inflows too were pretty intense. like my NvDA calls today I exited at a loss even as the price went up. \nI don’t know why end up in this position after going through so much trash analysts interviews and readings. I miss out on big profits and take 90% of full losses . \nDo you guys never trade big naked option positions. I see some people make wins out of literal crazy bets I want to get fricking 50% win a couple of times. Where you buy something and it goes in your direction not against you. \nDo you guys only trade spreads and iron condors ? Or just stocks? How is it working for you? Please help! This is just insane how I spend months together, take incredible stress and time and keep loosing more. What am I missing?\n",
            "gallery": [
                "https://www.reddit.com/gallery/1bj28or"
            ]
        }
    },
    {
        "title": "I can tell momma I officially made it: Featured in a Forbes article",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj1tiq/i_can_tell_momma_i_officially_made_it_featured_in/",
        "nr_comments": 405,
        "upvotes": "8550",
        "content": {
            "text": "Mods. Where’s my flair?\n",
            "gallery": [
                "https://i.redd.it/oj7cefdl8epc1.jpeg"
            ]
        }
    },
    {
        "title": "Is my fear overblown?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj1in7/is_my_fear_overblown/",
        "nr_comments": 28,
        "upvotes": "3",
        "content": {
            "text": "When markets fall, it's typically the most speculative asset (ie BTC) that gets dumped first. If you've seen the movie Margin Call, Jeremy Irons said the way to win is to be smarter or cheat, and he doesn't cheat, so it's helluva easier to just be first. \nSome of you know I've been losing my ass on puts the last couple of weeks, about 10k combined on NVDA and others that ended up worthless. I've in the past few days sold more than 50% of my holdings so now I'm 3/4 cash and 1/4 securities. The cash is making ~4.97% on SPAXX so it's not like it isn't gaining but I'm chickening out because I've seen this before - and no I'm not talking about forward PE or anything rational but rather the overall feeling of a feeding frenzy. \nI'm holding TSM (also calls for 5/19), INTC (and LEAPS), IONQ, RIVN, SOXL ($21 avg), BA (and calls for Jan '25) HOOD, and SOFI. Plan to close all my CSP before JP opens his mouth tomorrow. Worst case I lose potential gains but best case I don't lose too much on what I do own.\n",
            "gallery": [
                "https://i.redd.it/f1lhvac36epc1.png"
            ]
        }
    },
    {
        "title": "Tomorrow Big Dicks on VIX",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj0e0y/tomorrow_big_dicks_on_vix/",
        "nr_comments": 28,
        "upvotes": "31",
        "content": {
            "text": "My line is the grey trend line. The rest the lines are just some AI generated bullshit.\nYou cannot mistake the elegance and simplicity of that grey line. It has depth and meaning...soul.\nBut it is not the line itself I would like to direct your piss ant attention to -- it is the space between the teabags.\nEvery time VIX price teabags my grey line, it then shoots up into a testosterone filled rage of fear and volatility. This of course leaves the market with a red devil's dick boner.\nThe VIXrection would have been huger but JPOW made it nut prematurely in pure anticipation. That's why it softened up today.\nBut tomorrow ... big dicks on VIX.\nYou know what to do. \n$VXX 14C 3/22\n",
            "gallery": [
                "https://i.redd.it/wxt88f5uwdpc1.jpeg"
            ]
        }
    },
    {
        "title": "CMG announced 50 for 1 stock split",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bj08ws/cmg_announced_50_for_1_stock_split/",
        "nr_comments": 37,
        "upvotes": "103",
        "content": {
            "text": "Tasty split on top of some tasty gains. Time for some of that nacho cheese dip tonight!\n",
            "gallery": [
                "https://i.redd.it/m7vb5ptqvdpc1.jpeg"
            ]
        }
    },
    {
        "title": "NVIDIA - GTC Financial Analyst Q&A - March 2024",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bizsic/nvidia_gtc_financial_analyst_qa_march_2024/",
        "nr_comments": 18,
        "upvotes": "10",
        "content": {
            "text": "Here he  dissects a little better his keynote speech,  the potential of different industries they are tapping into by supersizing  their partner’s potential and creating new businesses  opportunities from thin air is  incredible .  He basically said that he is the matrix, he is everything and will be everywhere. He  got some alien technology that nobody has and is light years ahead of his competition .\n",
            "gallery": [
                "https://video.ibm.com/recorded/133431763"
            ]
        }
    },
    {
        "title": "DWAC",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1biza6p/dwac/",
        "nr_comments": 38,
        "upvotes": "40",
        "content": {
            "text": "Ready to HODL. You won't find paper hands here. Sell limit set for $100/contract. Take me to Valhalla.\n",
            "gallery": [
                "https://i.redd.it/yrv9kyuaodpc1.jpeg"
            ]
        }
    },
    {
        "title": "Question: for people experienced dot com bubble, was Cisco CEO like like Jensen Huang in yesterday's NVDA conference?",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1biyg2p/question_for_people_experienced_dot_com_bubble/",
        "nr_comments": 96,
        "upvotes": "31",
        "content": {
            "text": "Was Cisco promising futuristic things that never came true during dot com bubble? What were some promises? \nWas Cisco listing a wall of companies that are employing their new products?\nIs NVDA averting a potential 2000 by doing this, therefore creating the new industry they are promising instead of just selling hyperboles without support?\nShould I get calls?\n",
            "gallery": []
        }
    },
    {
        "title": "I wish I knew how to quit this ($130k PLTR YOLO)",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1biy0yr/i_wish_i_knew_how_to_quit_this_130k_pltr_yolo/",
        "nr_comments": 29,
        "upvotes": "20",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/ikyydnlsedpc1.png"
            ]
        }
    },
    {
        "title": "Chipotle’s board of directors approves 50-for-1 stock split",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bixmj5/chipotles_board_of_directors_approves_50for1/",
        "nr_comments": 238,
        "upvotes": "1538",
        "content": {
            "text": null,
            "gallery": [
                "https://www.cnbc.com/2024/03/19/chipotles-board-of-directors-approves-50-for-1-stock-split-.html"
            ]
        }
    },
    {
        "title": "Fannie Mae predicts that higher mortgage rates will stick around longer . Mortgage rates expected to end the year at 6.4%,higher than the p.",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bixe0x/fannie_mae_predicts_that_higher_mortgage_rates/",
        "nr_comments": 23,
        "upvotes": "26",
        "content": {
            "text": "​\nhttps://preview.redd.it/qg2rzu3y9dpc1.png?width=2400&format=png&auto=webp&s=30aada668b8b40e4614431b8bbf88f23adaa0f4b\n",
            "gallery": []
        }
    },
    {
        "title": "The government of Saudi Arabia plans to create a fund of about $40 billion to invest in artificial intelligence (NVDA to the moon bers BTFO)",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1biv8nh/the_government_of_saudi_arabia_plans_to_create_a/",
        "nr_comments": 20,
        "upvotes": "53",
        "content": {
            "text": null,
            "gallery": [
                "https://www.nytimes.com/2024/03/19/business/saudi-arabia-investment-artificial-intelligence.html"
            ]
        }
    },
    {
        "title": "75k FDX ER YOLO (Should have bought on Thursday)",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1biuxf3/75k_fdx_er_yolo_should_have_bought_on_thursday/",
        "nr_comments": 47,
        "upvotes": "39",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/g37qrrexscpc1.jpeg"
            ]
        }
    },
    {
        "title": "6 figure $DWAC yolo",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1biutwk/6_figure_dwac_yolo/",
        "nr_comments": 29,
        "upvotes": "55",
        "content": {
            "text": "Might sell some 3/28 calls tomorrow on the morning spike\nTarget price $80\n",
            "gallery": [
                "https://i.redd.it/c4mfzbg8scpc1.jpeg"
            ]
        }
    },
    {
        "title": "lol CNBC",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bius5d/lol_cnbc/",
        "nr_comments": 105,
        "upvotes": "707",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/yqa0oggvrcpc1.jpeg"
            ]
        }
    },
    {
        "title": "YOLO Crowd Bets Nvidia Could More Than Double in Value by Friday",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1biuh44/yolo_crowd_bets_nvidia_could_more_than_double_in/",
        "nr_comments": 150,
        "upvotes": "707",
        "content": {
            "text": "“Nvidia calls with a 1,940 strike were actively bought Monday”\n",
            "gallery": [
                "https://www.bloomberg.com/news/articles/2024-03-18/yolo-crowd-bets-nvidia-could-more-than-double-in-value-by-friday"
            ]
        }
    },
    {
        "title": "SPY YOLO",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1biu5hj/spy_yolo/",
        "nr_comments": 256,
        "upvotes": "327",
        "content": {
            "text": "New all time highs tomorrow. Who's with me? \n",
            "gallery": [
                "https://i.redd.it/s6xd595cncpc1.jpeg"
            ]
        }
    },
    {
        "title": "What Are Your Moves Tomorrow, March 20, 2024",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bitoc0/what_are_your_moves_tomorrow_march_20_2024/",
        "nr_comments": 6505,
        "upvotes": "561",
        "content": {
            "text": "View Post\n",
            "gallery": []
        }
    },
    {
        "title": "AMD Yolo",
        "url": "https://old.reddit.com/r/wallstreetbets/comments/1bitck4/amd_yolo/",
        "nr_comments": 14,
        "upvotes": "39",
        "content": {
            "text": null,
            "gallery": [
                "https://i.redd.it/x3u66gpmhcpc1.jpeg"
            ]
        }
    }
]